// Copyright 2025 Сергей Савельев (serge@savel.pro)
//
// Лицензировано согласно Лицензии Apache, Версия 2.0 ("Лицензия");
// вы можете использовать этот файл только в соответствии с Лицензией.
// Вы можете найти копию Лицензии по адресу
//
// http://www.apache.org/licenses/LICENSE-2.0.
//
// За исключением случаев, когда это регламентировано существующим
// законодательством, или если это не оговорено в письменном соглашении,
// программное обеспечение, распространяемое на условиях данной Лицензии,
// предоставляется "КАК ЕСТЬ", и любые явные или неявные ГАРАНТИИ ОТВЕРГАЮТСЯ.
// Информацию об основных правах и ограничениях, применяемых к определенному
// языку согласно Лицензии, вы можете найти в данной Лицензии.

#Область Основная

Функция ЭтоБэкап() Экспорт
		
	Возврат Ложь;
	
КонецФункции

Функция РазрешенОбменБэкапов() Экспорт
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьОбработку(Шина) Экспорт
	
	Возврат Обработки[Шина.Обработка].Создать();
		
КонецФункции

Функция ГруппаПолучателей() Экспорт
	
	Возврат ИдентификаторИнфобазы();
	
КонецФункции

Функция ПользовательПоУмолчанию() Экспорт
	
	Возврат ИдентификаторИнфобазы();
	
КонецФункции

Функция ИдентификаторИнфобазы() Экспорт
	
	СтрокаСоединения = НРег(КафкаПовтИсп.СтрокаСоединенияИнфобазы());
	
	ИмяИБ = СокрЛП(НСтр(СтрокаСоединения, "ref"));
	ИмяКластера = СокрЛП(НСтр(СтрокаСоединения, "srvr"));
	
	Если ИмяКластера = "" Тогда
		Возврат ИмяИБ;
	Иначе
		Возврат ИмяИБ + "@" + ИмяКластера;
	КонецЕсли;
	
КонецФункции

Функция ИмяИнфобазы() Экспорт
	
	СтрокаСоединения = НРег(КафкаПовтИсп.СтрокаСоединенияИнфобазы());
	Возврат СокрЛП(НСтр(СтрокаСоединения, "ref"));
	
КонецФункции

#КонецОбласти
