// Copyright 2025 Сергей Савельев (serge@savel.pro)
//
// Лицензировано согласно Лицензии Apache, Версия 2.0 ("Лицензия");
// вы можете использовать этот файл только в соответствии с Лицензией.
// Вы можете найти копию Лицензии по адресу
//
// http://www.apache.org/licenses/LICENSE-2.0.
//
// За исключением случаев, когда это регламентировано существующим
// законодательством, или если это не оговорено в письменном соглашении,
// программное обеспечение, распространяемое на условиях данной Лицензии,
// предоставляется "КАК ЕСТЬ", и любые явные или неявные ГАРАНТИИ ОТВЕРГАЮТСЯ.
// Информацию об основных правах и ограничениях, применяемых к определенному
// языку согласно Лицензии, вы можете найти в данной Лицензии.

#Область Общее

Функция ВерсияПодсистемы() Экспорт
	
	Возврат "5.1.4";
	
КонецФункции

Процедура СообщитьПользователю(Текст, ОбъектДанных = Неопределено, Поле = Неопределено, ИдентификаторНазначения = Неопределено) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Если ОбъектДанных <> Неопределено Тогда
		Сообщение.УстановитьДанные(ОбъектДанных);
	КонецЕсли;
	Если Поле <> Неопределено Тогда
		Сообщение.Поле = Поле;
	КонецЕсли;
	Если ИдентификаторНазначения <> Неопределено Тогда
		Сообщение.ИдентификаторНазначения = ИдентификаторНазначения;
	КонецЕсли;
	Сообщение.Сообщить();
	
КонецПроцедуры

Функция КорневаяИнформацияОбОшибке(ИнформацияОбОшибке) Экспорт
	
	Результат = ИнформацияОбОшибке;
	Пока Результат.Причина <> Неопределено Цикл
		Результат = Результат.Причина;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область АвтоВыгрузка

Процедура ВыгрузитьРегламент(Шина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если КафкаПовтИсп.ЭтоБэкап() И Не КафкаПереопределяемый.РазрешенОбменБэкапов() Тогда
		ТекстСообщения = "Обмен бэкапов запрещен. Выгрузка не будет запущена.";
		СообщитьПользователю(ТекстСообщения);
		ЗаписьЖурналаРегистрации("Обмен данными.Кафка."+Шина.Наименование, УровеньЖурналаРегистрации.Предупреждение, , , ТекстСообщения);
		Возврат;
	КонецЕсли;
		
	Выгрузить(Шина);
	
КонецПроцедуры

Процедура Выгрузить(Шина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Шина) Тогда
		ВызватьИсключение "Не заполнена шина. Выгрузка невозможна.";
	КонецЕсли;
	
	ШинаИнфо = ШинаИнфо(Шина);
		
	Если Не ЗначениеЗаполнено(ШинаИнфо.Узел) Тогда
		ВызватьИсключение "Не заполнен узел шины. Выгрузка невозможна.";
	КонецЕсли;
	
	Параллелизм = ИнициализироватьПараллелизм(ШинаИнфо.ОбменКоличествоПотоков);
	
	Обработка = КафкаПереопределяемый.ПолучитьОбработку(ШинаИнфо);
	
	// Установим реквизиты обработки.
	ПотенциальныеРеквизитыОбработки = Новый Структура;
	ПотенциальныеРеквизитыОбработки.Вставить("Шина", ШинаИнфо.Ссылка);
	ПотенциальныеРеквизитыОбработки.Вставить("Узел", ШинаИнфо.Узел);
	УстановитьРеквизитыОбработки(Обработка, ПотенциальныеРеквизитыОбработки);
		
	КластерИнфо = КластерИнфо(ШинаИнфо.Кластер);
	Если КластерИнфо = Неопределено Тогда
		ВызватьИсключение "Некорректный кластер.";
	КонецЕсли;
	
	Адаптер = Адаптер(КластерИнфо);
	
	ВыгружаемыеОбъектыМетаданных = Обработка.ВыгружаемыеОбъектыМетаданных();
	
	Заголовки = Новый Соответствие;
	
	ИнформацияОбОшибке = Неопределено;
	
	Если Не Обработка.ПередВыгрузкойШины(ШинаИнфо, Заголовки, Адаптер) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ВыгрузитьУзел(ШинаИнфо, КластерИнфо, Обработка, Адаптер, Заголовки, ВыгружаемыеОбъектыМетаданных, Параллелизм);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;
	
	Обработка.ПослеВыгрузкиШины(ШинаИнфо, ИнформацияОбОшибке);
	
	Если ИнформацияОбОшибке <> Неопределено Тогда
		ТекстОшибки = "Выгрузка данных в шину """+ШинаИнфо.Наименование+""" завершилась ошибкой.
		|" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьУзел(ШинаИнфо, КластерИнфо, Обработка, Адаптер, Заголовки, ВыгружаемыеОбъектыМетаданных, Параллелизм)
		
	Изменения = ПолучитьИзменения(ШинаИнфо.Узел);
	
	Если Изменения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Конфигурация = КонфигурацияШины(ШинаИнфо.Ссылка);
	Если Параллелизм.МаксСтепень < 2 Тогда
		Конфигурация.Вставить("linger.ms", "0");
	КонецЕсли;
	
	// Создадим экземпляр отправителя внутри шлюза.
	Producer = Адаптер.ProducerCreate(
		ШинаИнфо.Наименование,
		Конфигурация,
		ШинаИнфо.КлиентТаймаут
	);
	
	Если Producer = Неопределено Тогда
		ВызватьИсключение Строка(Адаптер.КодОтвета) + " " + Адаптер.ОписаниеОшибки;
	КонецЕсли;
		
	Попытка
					
		ПредПорядок = Неопределено;
		
		Для Каждого СтрокаОбъектМетаданных Из ВыгружаемыеОбъектыМетаданных Цикл
					
			РезультатЗапросаИзменения = Изменения.Получить(СтрокаОбъектМетаданных.ПолноеИмя);
			
			Если РезультатЗапросаИзменения = Неопределено Или РезультатЗапросаИзменения.Пустой() Тогда
				Продолжить; // нечего выгружать по текущей таблице
			КонецЕсли;
			
			// Перед началом выгрузки данных нового порядка дожидаемся завершения выгрузки данных старого порядка.
			Если ПредПорядок <> СтрокаОбъектМетаданных.Порядок Тогда
				ДождатьсяОсвобожденияПулаПотоков(Параллелизм, Истина);
			КонецЕсли;
			
			ПредПорядок = СтрокаОбъектМетаданных.Порядок;
						
			ВыгрузитьОбъектМетаданных(ШинаИнфо, КластерИнфо, Обработка, Адаптер, Producer, СтрокаОбъектМетаданных, РезультатЗапросаИзменения, Заголовки, Параллелизм);
					
		КонецЦикла;
			
		ДождатьсяОсвобожденияПулаПотоков(Параллелизм, Истина);
		
		Адаптер.ProducerRelease(Producer);
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		Адаптер.ProducerRelease(Producer);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьИзменения(Узел)
		
	МассивТекстЗапроса = Новый Массив;
	МассивИменаТаблиц  = Новый Массив;
	
	СоставМетаданных = Узел.Метаданные().Состав;
	
	Для Каждого ЭлементСостава Из СоставМетаданных Цикл
		
		ОбъектМетаданныхИнфо = КафкаПовтИсп.ОписаниеОбъектаМетаданных(ЭлементСостава.Метаданные.ПолноеИмя());
		
		Если ОбъектМетаданныхИнфо.ЭтоКонстанта Тогда
			
			МассивТекстЗапроса.Добавить(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА
			|ИЗ
			|	" + ОбъектМетаданныхИнфо.ПолноеИмя + ".Изменения
			|ГДЕ
			|	Узел = &Узел");
			
		ИначеЕсли ОбъектМетаданныхИнфо.ЭтоСсылочныйОбъект Тогда
			
			МассивТекстЗапроса.Добавить(
			"ВЫБРАТЬ ПЕРВЫЕ 999999999
			|	Изменения.Ссылка
			|ИЗ
			|	" + ОбъектМетаданныхИнфо.ПолноеИмя + ".Изменения КАК Изменения
			|ГДЕ
			|	Изменения.Узел = &Узел
			|УПОРЯДОЧИТЬ ПО
			|	Ссылка");
			
		Иначе
			
			Если ОбъектМетаданныхИнфо.КлючевыеПоля.Количество() = 0 Тогда
				
				МассивТекстЗапроса.Добавить(
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ИСТИНА
				|ИЗ
				|	" + ОбъектМетаданныхИнфо.ПолноеИмя + ".Изменения
				|ГДЕ
				|	Узел = &Узел");
				
			Иначе
				
				СтрокаИзмерения = СтрСоединить(ОбъектМетаданныхИнфо.КлючевыеПоля, ", ");
				
				МассивТекстЗапроса.Добавить(
				"ВЫБРАТЬ ПЕРВЫЕ 999999999
				|	" + СтрокаИзмерения + "
				|ИЗ
				|	" + ОбъектМетаданныхИнфо.ПолноеИмя + ".Изменения
				|ГДЕ
				|	Узел = &Узел
				|УПОРЯДОЧИТЬ ПО
				|	" + СтрокаИзмерения);
				
			КонецЕсли;
						
		КонецЕсли;
		
		МассивИменаТаблиц.Добавить(ОбъектМетаданныхИнфо.ПолноеИмя);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(МассивТекстЗапроса, Символы.ПС+";"+Символы.ПС);
	Запрос.УстановитьПараметр("Узел", Узел);
	
	МассивРезультатыЗапросов = Запрос.ВыполнитьПакет();
		
	Результат = Новый Соответствие;
	
	Для Индекс = 0 По МассивИменаТаблиц.ВГраница() Цикл
		
		ИмяТаблицы = МассивИменаТаблиц[Индекс];
		РезультатЗапроса = МассивРезультатыЗапросов[Индекс];
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Результат.Вставить(ИмяТаблицы, РезультатЗапроса);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ВыгрузитьОбъектМетаданных(ШинаИнфо, КластерИнфо, Обработка, Адаптер, Producer, СтрокаОбъектМетаданных, РезультатЗапросаИзменения, ОбщиеЗаголовки, Параллелизм)
	
	Если ЗначениеЗаполнено(СтрокаОбъектМетаданных.РазмерПакета) Тогда
		РазмерПакета = СтрокаОбъектМетаданных.РазмерПакета;
	Иначе
		РазмерПакета = 250;
	КонецЕсли;
	
	Заголовки = Новый Соответствие;
	Для Каждого КЗ Из ОбщиеЗаголовки Цикл
		Заголовки.Вставить(КЗ.Ключ, КЗ.Значение);
	КонецЦикла;
	
	ОбъектМетаданныхИнфо = КафкаПовтИсп.ОписаниеОбъектаМетаданных(СтрокаОбъектМетаданных.ПолноеИмя);
	
	Если Не Обработка.ПередВыгрузкойТаблицы(ОбъектМетаданныхИнфо, Заголовки) Тогда
		Возврат;
	КонецЕсли;
		
	ИзмененияВыборка = РезультатЗапросаИзменения.Выбрать();
	
	ЗаписьЖурналаРегистрации(
			"Обмен данными.Кафка." + ШинаИнфо.Наименование,
			УровеньЖурналаРегистрации.Примечание,
			ШинаИнфо.Узел.Метаданные(),
			ШинаИнфо.Узел,
			"Начата асинхронная отправка " + ИзмененияВыборка.Количество() + " объектов '" + СтрокаОбъектМетаданных.ПолноеИмя + "'."
	);
			
	ТекущийПакет = Неопределено;
						
	// Обходим все измененные/удаленные объекты.
	Пока ИзмененияВыборка.Следующий() Цикл
		
		Если ТекущийПакет = Неопределено Тогда
			
			ТаблицаДанные = Новый ТаблицаЗначений;
			Для Каждого Колонка Из РезультатЗапросаИзменения.Колонки Цикл
				ТаблицаДанные.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
			КонецЦикла;
			
			ТекущийПакет = Новый Структура;
			ТекущийПакет.Вставить("ОбъектМетаданныхИнфо", ОбъектМетаданныхИнфо);
			ТекущийПакет.Вставить("Заголовки", Заголовки);
			ТекущийПакет.Вставить("Данные", ТаблицаДанные);
			ТекущийПакет.Вставить("Размер", 0);
			
		КонецЕсли;					
				
		ЗаполнитьЗначенияСвойств(ТекущийПакет.Данные.Добавить(), ИзмененияВыборка);
		ТекущийПакет.Размер = ТекущийПакет.Размер + 1;
		
		Если ТекущийПакет.Размер >= РазмерПакета Тогда
			ВыгрузитьПакет(ШинаИнфо, КластерИнфо, Обработка, Адаптер, Producer, Параллелизм, ТекущийПакет);
			ТекущийПакет = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекущийПакет <> Неопределено Тогда
		ВыгрузитьПакет(ШинаИнфо, КластерИнфо, Обработка, Адаптер, Producer, Параллелизм, ТекущийПакет);
		ТекущийПакет = Неопределено;
	КонецЕсли;
		
	ЗаписьЖурналаРегистрации(
			"Обмен данными.Кафка." + ШинаИнфо.Наименование,
			УровеньЖурналаРегистрации.Примечание,
			ШинаИнфо.Узел.Метаданные(),
			ШинаИнфо.Узел,
			"Завершена асинхронная отправка " + ИзмененияВыборка.Количество() + " объектов '" + СтрокаОбъектМетаданных.ПолноеИмя+"'."
	);
			
	Обработка.ПослеВыгрузкиТаблицы(ОбъектМетаданныхИнфо);
	
КонецПроцедуры

Процедура ВыгрузитьПакет(ШинаИнфо, КластерИнфо, Обработка, Адаптер, Producer, Параллелизм, Пакет)
	
	ДождатьсяОсвобожденияПулаПотоков(Параллелизм);	
		
	Если Параллелизм.МаксСтепень < 2 Тогда
		// Выгрузим пакет в этом же сеансе.
		
		ВыгрузитьПакетЭтотСеанс(ШинаИнфо, Обработка, Адаптер, Producer, Пакет);
		
		Параллелизм.ОбъектыСчетчик = Параллелизм.ОбъектыСчетчик + Пакет.Размер;
		
    Иначе
		// Выгрузим пакет в отдельном фоновом сеансе.
		
		Параллелизм.ПотокиСчетчик = Параллелизм.ПотокиСчетчик + 1;
		
		ПараметрыФЗ = Новый Массив;
		ПараметрыФЗ.Добавить(ШинаИнфо);
		ПараметрыФЗ.Добавить(КластерИнфо);
		ПараметрыФЗ.Добавить(Producer);
		ПараметрыФЗ.Добавить(Пакет);
		ПараметрыФЗ.Добавить(Параллелизм.СеансИнфо);
		
		ФЗ = ФоновыеЗадания.Выполнить("КафкаСервер.ВыгрузитьПакетОтдельныйСеанс", ПараметрыФЗ, ,
				"Поток выгрузки данных в шину '"+ШинаИнфо.Наименование+"' № "+Параллелизм.ПотокиСчетчик);
				
		Параллелизм.Потоки.Добавить(ФЗ);
		Параллелизм.ПотокиРазмеры.Вставить(ФЗ.УникальныйИдентификатор, Пакет.Размер);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ВыгрузитьПакетОтдельныйСеанс(ШинаИнфо, КластерИнфо, Producer, Пакет, РодительскийСеансИнфо) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Обработка = КафкаПереопределяемый.ПолучитьОбработку(ШинаИнфо);
	
	// Установим реквизиты обработки.
	ПотенциальныеРеквизитыОбработки = Новый Структура;
	ПотенциальныеРеквизитыОбработки.Вставить("Узел", ШинаИнфо.Узел);
	ПотенциальныеРеквизитыОбработки.Вставить("Шина", ШинаИнфо.Ссылка);
	УстановитьРеквизитыОбработки(Обработка, ПотенциальныеРеквизитыОбработки);
	
	// Если текущий сеанс запущен на другом сервере, относительно родительского,
	// используем шлюз на сервере родительского сеанса.
	ШлюзАдрес = КластерИнфо.ШлюзАдрес;
	Если СтрСравнить(РодительскийСеансИнфо.СерверИмя, ИмяКомпьютера()) <> 0 Тогда
		Если ШлюзАдрес = Неопределено Или ПустаяСтрока(ШлюзАдрес) Тогда
			ЭтоLocalhost = Истина;
			ШлюзПорт = Неопределено;
		Иначе
			ПозДвоеточие = СтрНайти(ШлюзАдрес, ":");
			Если ПозДвоеточие = 0 Тогда
				ШлюзСервер = ШлюзАдрес;
				ШлюзПорт = Неопределено;
			Иначе
				ШлюзСервер = Лев(ШлюзАдрес, ПозДвоеточие-1);
				ШлюзПорт = Сред(ШлюзАдрес, ПозДвоеточие);
			КонецЕсли;
			ЭтоLocalhost = (
				СтрСравнить(ШлюзСервер, "localhost") = 0
				Или СтрСравнить(ШлюзСервер, "127.0.0.1") = 0
			);
		КонецЕсли;
		Если ЭтоLocalhost Тогда
			ШлюзАдрес = РодительскийСеансИнфо.СерверИмя;
			Если ЗначениеЗаполнено(ШлюзПорт) Тогда
				ШлюзАдрес = ШлюзАдрес + ШлюзПорт;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	Адаптер = Обработки.КафкаАдаптер.Создать();
	Адаптер.Инициализировать(
			ШлюзАдрес,
			КластерИнфо.ШлюзПользователь,
			КластерИнфо.ШлюзПароль,
			КластерИнфо.ШлюзТаймаут
	);
	
	ВыгрузитьПакетЭтотСеанс(ШинаИнфо, Обработка, Адаптер, Producer, Пакет);
	
КонецПроцедуры

Процедура ВыгрузитьПакетЭтотСеанс(ШинаИнфо, Обработка, Адаптер, Producer, Пакет)
		
	ОбъектМетаданныхИнфо = Пакет.ОбъектМетаданныхИнфо;
	
	Обработка.ПередВыгрузкойПакета(ОбъектМетаданныхИнфо, Адаптер);
			
	Для Каждого СтрокаПакета Из Пакет.Данные Цикл
		
		// Скопируем общие заголовки.
		Заголовки = Новый Соответствие;
		Для Каждого КЗ Из Пакет.Заголовки Цикл
			Заголовки.Вставить(КЗ.Ключ, КЗ.Значение);
		КонецЦикла;
		
		// Итерацию выгрузки каждого объекта выполняем в отдельной транзакции.
		// Внутри транзакции только необходимый минимум действий.
		НачатьТранзакцию();
		
		Попытка
		
			// Устанавливаем разделяемую блокировку 
			ПространствоБлокировки = ОбъектМетаданныхИнфо.ПолноеИмя;
			Если ОбъектМетаданныхИнфо.ЭтоПодчиненныйРегистр Или ОбъектМетаданныхИнфо.ЭтоПоследовательность Тогда
				ПространствоБлокировки = ПространствоБлокировки + ".НаборЗаписей";
			КонецЕсли;
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПространствоБлокировки);
			Для Каждого Поле Из ОбъектМетаданныхИнфо.КлючевыеПоля Цикл
				ЭлементБлокировки.УстановитьЗначение(Поле, СтрокаПакета[Поле]);
			КонецЦикла;
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			Блокировка.Заблокировать();
			
			// Читаем объект.
			Если ОбъектМетаданныхИнфо.ЭтоКонстанта Тогда
				
				Объект = Константы[ОбъектМетаданныхИнфо.Имя].СоздатьМенеджерЗначения();
				Объект.Прочитать();
			
			ИначеЕсли ОбъектМетаданныхИнфо.ЭтоСсылочныйОбъект Тогда
				
				Объект = СтрокаПакета.Ссылка.ПолучитьОбъект();
				
				Если Объект = Неопределено Тогда
					Объект = Новый УдалениеОбъекта(СтрокаПакета.Ссылка);
				КонецЕсли;
									
			Иначе // Это регистр или последовательность
			
				РегистрМенеджер = КафкаПовтИсп.МенеджерОбъектаМетаданных(ОбъектМетаданныхИнфо.ПолноеИмя);
				
				Объект = РегистрМенеджер.СоздатьНаборЗаписей();
				Для Каждого Поле Из ОбъектМетаданныхИнфо.КлючевыеПоля Цикл
					Объект.Отбор[Поле].Установить(СтрокаПакета[Поле]);
				КонецЦикла;
				Объект.Прочитать();
				
			КонецЕсли;
						
			// Разрегистрируем объект, там самым наложив исключительную блокировку
			// на таблицу регистрации изменений.
			ПланыОбмена.УдалитьРегистрациюИзменений(ШинаИнфо.Узел, Объект);
			
			ВыгружатьОбъект = Обработка.ПередВыгрузкойОбъекта(Объект, ОбъектМетаданныхИнфо, Заголовки);
			
			Если ВыгружатьОбъект Тогда
				RecordMetadata = ВыгрузитьОбъект(ШинаИнфо, Обработка, Producer, Адаптер, Объект, ОбъектМетаданныхИнфо, Заголовки);
			КонецЕсли;
						
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ОтменитьТранзакцию();
			
			ВызватьИсключение
			"Не удалось выполнить отправку объекта "+ПредставлениеОбъекта(Объект, ОбъектМетаданныхИнфо)+".
			|"+ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			
		КонецПопытки;
		
		Если ВыгружатьОбъект Тогда
			Обработка.ПослеВыгрузкиОбъекта(Объект, ОбъектМетаданныхИнфо, RecordMetadata);
		КонецЕсли;
		
	КонецЦикла;
	
	Обработка.ПослеВыгрузкиПакета(ОбъектМетаданныхИнфо);
	
КонецПроцедуры

Функция ВыгрузитьОбъект(ШинаИнфо, Обработка, Producer, Адаптер, Объект, ОбъектМетаданныхИнфо, Заголовки)
	
	Ключ = Обработка.СообщениеКлюч(Объект, ОбъектМетаданныхИнфо, Заголовки);
	Если Ключ = Неопределено Тогда
		ВызватьИсключение "Не определен ключ сообщения.";
	КонецЕсли;
	
	Значение = Обработка.СообщениеЗначение(Объект, ОбъектМетаданныхИнфо, Заголовки);
	Если Значение = Неопределено Тогда
		ВызватьИсключение "Не определено значение сообщения.";
	КонецЕсли;
	
	Если ШинаИнфо.ТемаЭтоПрефикс Тогда
		ТемаСуффикс = Обработка.СообщениеСуффиксТемы(Объект, ОбъектМетаданныхИнфо, Заголовки);
		Если Не ЗначениеЗаполнено(ТемаСуффикс) Тогда
			ВызватьИсключение "Не заполнен суффикс темы.";
		КонецЕсли;
		Тема = ШинаИнфо.ТемаПрефикс + ТемаСуффикс;
	Иначе
		Тема = ШинаИнфо.Тема;
	КонецЕсли;
	
	HttpЗапрос = Новый HttpЗапрос("producer/send");
	HttpЗапрос.Заголовки.Вставить("Content-Type", "application/octet-stream");
	
	Поток = HttpЗапрос.ПолучитьТелоКакПоток();
	
	ЗаписьДанных = Новый ЗаписьДанных(Поток, КодировкаТекста.UTF8, ПорядокБайтов.BigEndian);
	
	// Версия - 2 байта
	ЗаписьДанных.ЗаписатьЦелое16(1); // 1
	
	// Id отправителя
	Буфер = ПолучитьБуферДвоичныхДанныхИзСтроки(Producer.id);
	ЗаписьДанных.ЗаписатьЦелое32(Буфер.Размер);
	Если Буфер.Размер > 0 Тогда
		ЗаписьДанных.ЗаписатьБуферДвоичныхДанных(Буфер);
	КонецЕсли;
	
	// Токен отправителя
	Буфер = ПолучитьБуферДвоичныхДанныхИзСтроки(Producer.token);
	ЗаписьДанных.ЗаписатьЦелое32(Буфер.Размер);
	Если Буфер.Размер > 0 Тогда
		ЗаписьДанных.ЗаписатьБуферДвоичныхДанных(Буфер);
	КонецЕсли;
	
	// Тема
	Буфер = ПолучитьБуферДвоичныхДанныхИзСтроки(Тема);
	ЗаписьДанных.ЗаписатьЦелое32(Буфер.Размер);
	Если Буфер.Размер > 0 Тогда
		ЗаписьДанных.ЗаписатьБуферДвоичныхДанных(Буфер);
	КонецЕсли;
	
	// Раздел
	Раздел = Неопределено;
	Если Раздел = Неопределено Или Раздел = Null Тогда
		ЗаписьДанных.ЗаписатьБайт(1); // 1
	Иначе
		ЗаписьДанных.ЗаписатьБайт(0); // 0
		ЗаписьДанных.ЗаписатьЦелое32(Раздел);
	КонецЕсли;
	
	// Заголовки
	ЗаписьДанных.ЗаписатьЦелое32(Заголовки.Количество());
	Для Каждого КлючЗначение Из Заголовки Цикл
		
		Буфер = ПолучитьБуферДвоичныхДанныхИзСтроки(КлючЗначение.Ключ);
		ЗаписьДанных.ЗаписатьЦелое32(Буфер.Размер);
		Если Буфер.Размер > 0 Тогда
			ЗаписьДанных.ЗаписатьБуферДвоичныхДанных(Буфер);
		КонецЕсли;
		
		Если КлючЗначение.Значение = Неопределено Или КлючЗначение.Значение = Null Тогда
			ЗаписьДанных.ЗаписатьБайт(1); // 1
		Иначе
			ЗаписьДанных.ЗаписатьБайт(0); // 0
			Буфер = ПолучитьБуферДвоичныхДанныхИзСтроки(КлючЗначение.Значение);
			ЗаписьДанных.ЗаписатьЦелое32(Буфер.Размер);
			Если Буфер.Размер > 0 Тогда
				ЗаписьДанных.ЗаписатьБуферДвоичныхДанных(Буфер);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// Ключ
	Если Ключ = Null Тогда
		ЗаписьДанных.ЗаписатьБайт(1); // 1
	Иначе
		ЗаписьДанных.ЗаписатьБайт(0); // 0
		Буфер = СериализоватьКлючВБуферДвоичныхДанных(Ключ, ШинаИнфо.КлючСердес);
		ЗаписьДанных.ЗаписатьЦелое32(Буфер.Размер);
		Если Буфер.Размер > 0 Тогда
			ЗаписьДанных.ЗаписатьБуферДвоичныхДанных(Буфер);
		КонецЕсли;
	КонецЕсли;
	
	//Значение
	Если Значение = Null Тогда
		ЗаписьДанных.ЗаписатьБайт(1); // 1
		ЗаписьДанных.Закрыть();
	Иначе
		ЗаписьДанных.ЗаписатьБайт(0); // 0
		СериализоватьЗначениеВПотокИЗакрытьЗаписьДанных(Значение, ШинаИнфо.ЗначениеСердес, ЗаписьДанных, Поток);
	КонецЕсли;
	
	Поток.Закрыть();
	
	// Отправляем сообщение
	
	HttpСоединение = Адаптер.ПолучитьHttpСоединение();
	
	HttpОтвет = HttpСоединение.ОтправитьДляОбработки(HttpЗапрос);
	HttpОтвет = Адаптер.ПроверитьHttpОтвет(HttpОтвет);	
	
	Если HttpОтвет = Неопределено Тогда
		ВызватьИсключение Строка(Адаптер.КодОтвета) + " " + Адаптер.ОписаниеОшибки;
	КонецЕсли;
	
	// Читаем ответ
	
	Поток = HttpОтвет.ПолучитьТелоКакПоток();
	
	ЧтениеДанных = Новый ЧтениеДанных(Поток, КодировкаТекста.UTF8, ПорядокБайтов.BigEndian);
	
	Версия = ЧтениеДанных.ПрочитатьЦелое16();
	
	Если Версия = 1 Тогда
		
		ТопикДлина = ЧтениеДанных.ПрочитатьЦелое32();
		Если ТопикДлина = 0 Тогда
			Topic = "";
		Иначе
			Буфер = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных(ТопикДлина);
			Topic = ПолучитьСтрокуИзБуфераДвоичныхДанных(Буфер, КодировкаТекста.UTF8);
		КонецЕсли;
		
		Partition = ЧтениеДанных.ПрочитатьЦелое32();
		
		Offset = ЧтениеДанных.ПрочитатьЦелое64();
		
		Timestamp = ЧтениеДанных.ПрочитатьЦелое64();
		
		SerializedKeySize = ЧтениеДанных.ПрочитатьЦелое32();
		
		SerializedValueSize = ЧтениеДанных.ПрочитатьЦелое32();
		
	Иначе
		ВызватьИсключение "Неизвестная версия бинарной сериализации: " + Версия + ".";
	КонецЕсли;
	
	ЧтениеДанных.Закрыть();
	
	Поток.Закрыть();
	
	RecordMetadata = Новый Структура;
	RecordMetadata.Вставить("topic", Topic);
	RecordMetadata.Вставить("partition", Partition);
	RecordMetadata.Вставить("offset", Offset);
	RecordMetadata.Вставить("timestamp", Timestamp);
	RecordMetadata.Вставить("serializedKeySize", SerializedKeySize);
	RecordMetadata.Вставить("serializedValueSize", SerializedValueSize);
	
	Возврат RecordMetadata;
	
КонецФункции

Функция СериализоватьКлючВБуферДвоичныхДанных(Значение, Сердес)
	
	Если Сердес = Перечисления.КафкаСердес.Строка Тогда
				
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			Возврат ПолучитьБуферДвоичныхДанныхИзСтроки(Значение);
		Иначе
			ВызватьИсключение "Некорректный тип исходных данных для сериализации ключа.";
		КонецЕсли;
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.ДвоичныеДанные Тогда
				
		ЗначениеТип = ТипЗнч(Значение);
		Если ЗначениеТип = Тип("ДвоичныеДанные") Тогда
			Возврат ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(Значение);
		ИначеЕсли ЗначениеТип = Тип("БуферДвоичныхДанных") Тогда
			Возврат Значение;
		Иначе
			ВызватьИсключение "Некорректный тип исходных данных для сериализации ключа.";
		КонецЕсли;
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.Uuid Тогда
				
		Если ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда
			Возврат ПолучитьБуферДвоичныхДанныхИзСтроки(XmlСтрока(Значение));
		Иначе
			ВызватьИсключение "Некорректный тип исходных данных для сериализации ключа.";
		КонецЕсли;
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.СтруктураJson Тогда
				
		ЗначениеТип = ТипЗнч(Значение);
		Если ЗначениеТип = Тип("Структура") Или ЗначениеТип = Тип("ФиксированнаяСтруктура") Тогда
			
			Поток = Новый ПотокВПамяти;
			ЗаписьJson = Новый ЗаписьJson;
			ЗаписьJson.ОткрытьПоток(Поток, КодировкаТекста.UTF8, Ложь, Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
			JsonСериализовать(Значение, ЗаписьJson);
			ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
			
			Возврат ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанные);
			
		Иначе
			ВызватьИсключение "Некорректный тип исходных данных для сериализации ключа.";
		КонецЕсли;
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.СоответствиеJson Тогда
				
		ЗначениеТип = ТипЗнч(Значение);
		Если ЗначениеТип = Тип("Соответствие") Или ЗначениеТип = Тип("ФиксированноеСоответствие") Тогда
			
			Поток = Новый ПотокВПамяти;
			ЗаписьJson = Новый ЗаписьJSON;
			ЗаписьJson.ОткрытьПоток(Поток, , , Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
			JsonСериализовать(Значение, ЗаписьJson);
			ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
			
			Возврат ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанные);
			
		Иначе
			ВызватьИсключение "Некорректный тип исходных данных для сериализации ключа.";
		КонецЕсли;
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.Xml Тогда
		
		Поток = Новый ПотокВПамяти;
		ЗаписьXml = Новый ЗаписьXML;
		ЗаписьXml.Отступ = Ложь;
		ЗаписьXml.ОткрытьПоток(Поток);
		XmlСериализовать(Значение, ЗаписьXml);
		ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
		
		Возврат ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанные);
		
	Иначе
		ВызватьИсключение "Неожиданный/неподдерживаемый тип сериализации ключа: """+Сердес+"""."
	КонецЕсли;
	
КонецФункции

Процедура СериализоватьЗначениеВПотокИЗакрытьЗаписьДанных(Значение, Сердес, ЗаписьДанных, Поток)
	
	Если Сердес = Перечисления.КафкаСердес.Строка Тогда
				
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			
			ЗаписьДанных.ЗаписатьСтроку(Значение);
			ЗаписьДанных.Закрыть();
			
		Иначе
			ВызватьИсключение "Некорректный тип исходных данных для сериализации значения.";
		КонецЕсли;
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.ДвоичныеДанные Тогда
				
		ЗначениеТип = ТипЗнч(Значение);
		Если ЗначениеТип = Тип("ДвоичныеДанные") Тогда
			
			ЗаписьДанных.Записать(Значение);
			ЗаписьДанных.Закрыть();
			
		ИначеЕсли ЗначениеТип = Тип("БуферДвоичныхДанных") Тогда
			
			Если Значение.Размер > 0 Тогда
				ЗаписьДанных.ЗаписатьБуферДвоичныхДанных(Значение);
			КонецЕсли;
			ЗаписьДанных.Закрыть();
			
		Иначе
			ВызватьИсключение "Некорректный тип исходных данных для сериализации значения.";
		КонецЕсли;
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.Uuid Тогда
				
		Если ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда
			
			ЗаписьДанных.ЗаписатьСтроку(XmlСтрока(Значение));
			ЗаписьДанных.Закрыть();
			
		Иначе
			ВызватьИсключение "Некорректный тип исходных данных для сериализации значения.";
		КонецЕсли;
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.СтруктураJson Тогда
				
		ЗначениеТип = ТипЗнч(Значение);
		Если ЗначениеТип = Тип("Структура") Или ЗначениеТип = Тип("ФиксированнаяСтруктура") Тогда
			
			ЗаписьДанных.Закрыть();
			
			ЗаписьJson = Новый ЗаписьJSON;
			ЗаписьJson.ОткрытьПоток(Поток, КодировкаТекста.UTF8, Ложь, Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
			JsonСериализовать(Значение, ЗаписьJson);
						
		Иначе
			ВызватьИсключение "Некорректный тип исходных данных для сериализации значения.";
		КонецЕсли;
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.СоответствиеJson Тогда
				
		ЗначениеТип = ТипЗнч(Значение);
		Если ЗначениеТип = Тип("Соответствие") Или ЗначениеТип = Тип("ФиксированноеСоответствие") Тогда
			
			ЗаписьДанных.Закрыть();
			
			ЗаписьJson = Новый ЗаписьJSON;
			ЗаписьJson.ОткрытьПоток(Поток, КодировкаТекста.UTF8, Ложь, Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
			JsonСериализовать(Значение, ЗаписьJson);
			
		Иначе
			ВызватьИсключение "Некорректный тип исходных данных для сериализации значения.";
		КонецЕсли;
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.Xml Тогда
		
		ЗаписьДанных.Закрыть();
		
		ЗаписьXml = Новый ЗаписьXML;
		ЗаписьXml.Отступ = Ложь;
		ЗаписьXml.ОткрытьПоток(Поток);
		XmlСериализовать(Значение, ЗаписьXml);
		
	Иначе
		ВызватьИсключение "Неожиданный/неподдерживаемый тип сериализации значения: """+Сердес+"""."
	КонецЕсли;
	
КонецПроцедуры

Функция ИнициализироватьПараллелизм(МаксСтепень)
		
	Результат = Новый Структура;
	
	Результат.Вставить("МаксСтепень", МаксСтепень);
	Результат.Вставить("Потоки", Новый Массив);
	Результат.Вставить("ПотокиСчетчик", 0);
	Результат.Вставить("ПотокиРазмеры", Новый Соответствие);
	Результат.Вставить("ОбъектыСчетчик", 0);
	
	Если Результат.МаксСтепень < 1 Тогда
		Результат.МаксСтепень = 1;
	КонецЕсли;
	
	СеансИнфо = Новый Структура;
	СеансИнфо.Вставить("СерверИмя", ИмяКомпьютера());
	
	Результат.Вставить("СеансИнфо", Новый ФиксированнаяСтруктура(СеансИнфо));
	
	Возврат Результат;
	
КонецФункции

Процедура ДождатьсяОсвобожденияПулаПотоков(Параллелизм, ПолноеОсвобождение=Ложь)
	
	Если Не ПолноеОсвобождение И Параллелизм.Потоки.Количество() < Параллелизм.МаксСтепень Тогда
		Возврат;
	КонецЕсли;
	
	ЦелевоеКоличествоПотоков = ?(ПолноеОсвобождение, 0,	Параллелизм.МаксСтепень-1);
	
	Пока Параллелизм.Потоки.Количество() > ЦелевоеКоличествоПотоков Цикл
	
		Параллелизм.Потоки = ФоновыеЗадания.ОжидатьЗавершенияВыполнения(Параллелизм.Потоки, 5);
			
		Колво = Параллелизм.Потоки.Количество();
		Индекс = Колво;
		Пока Индекс > 0 Цикл
			
			Индекс = Индекс - 1;
			ФЗ = Параллелизм.Потоки[Индекс];
			
			Если ФЗ.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
				
				Параллелизм.Потоки.Удалить(Индекс);
				
				Параллелизм.ОбъектыСчетчик = Параллелизм.ОбъектыСчетчик + Параллелизм.ПотокиРазмеры[ФЗ.УникальныйИдентификатор];
				Параллелизм.ПотокиРазмеры.Удалить(ФЗ.УникальныйИдентификатор);
				
			ИначеЕсли ФЗ.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
				
				ОписаниеОшибки = "Один из потоков завершился ошибкой.";
				Если ФЗ.ИнформацияОбОшибке <> Неопределено Тогда
					ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + ПодробноеПредставлениеОшибки(ФЗ.ИнформацияОбОшибке);
				КонецЕсли;
				
				ВызватьИсключение ОписаниеОшибки;
				
			ИначеЕсли ФЗ.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
				
				ВызватьИсключение "Один из потоков был вручную отменен.";
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПредставлениеОбъекта(Объект, ОбъектМетаданныхИнфо)
	
	Результат = ОбъектМетаданныхИнфо.ПолноеИмя;
	
	Если Объект <> Неопределено Тогда
		Если ОбъектМетаданныхИнфо.ЭтоСсылочныйОбъект Тогда
			Результат = Результат+" ("""+Строка(Объект)+""")"
		ИначеЕсли ОбъектМетаданныхИнфо.ЭтоПодчиненныйРегистр Тогда
			Результат = Результат+" ("+Строка(Объект.Отбор.Регистратор.Значение)+")"
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область АвтоЗагрузка

Процедура ЗагрузитьРегламент(Шина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Если КафкаПовтИсп.ЭтоБэкап() И Не КафкаПереопределяемый.РазрешенОбменБэкапов() Тогда
		ТекстСообщения = "Обмен бэкапов запрещен. Загрузка не будет запущена.";
		СообщитьПользователю(ТекстСообщения);
		ЗаписьЖурналаРегистрации("Обмен данными.Кафка."+Шина, УровеньЖурналаРегистрации.Предупреждение, , , ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Загрузить(Шина);
	
КонецПроцедуры

Процедура Загрузить(Шина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МоментСтарта = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ШинаИнфо = ШинаИнфо(Шина);
	Если ШинаИнфо = Неопределено Тогда
		ВызватьИсключение "Некорректная шина.";
	КонецЕсли;
	
	КластерИнфо = КластерИнфо(ШинаИнфо.Кластер);
	Если КластерИнфо = Неопределено Тогда
		ВызватьИсключение "Некорректный кластер.";
	КонецЕсли;
	
	Адаптер = Адаптер(КластерИнфо);
	
	Если ШинаИнфо.ОбменДлительностьСеанса <> 0 Тогда
		МоментЗавершения = МоментСтарта + ШинаИнфо.ОбменДлительностьСеанса;
	КонецЕсли;
	
	// Инициализируем параметры получателя.
	ConsumerConfig = КонфигурацияШины(ШинаИнфо.Ссылка);
	Если ConsumerConfig.Получить("group.id") = Неопределено Тогда 
		ConsumerConfig.Вставить("group.id", КафкаПовтИсп.ГруппаПолучателей());
	КонецЕсли;
	
	Consumer = Адаптер.ConsumerCreate(ШинаИнфо.Наименование, ConsumerConfig, ШинаИнфо.КлиентТаймаут);
	Если Consumer = Неопределено Тогда
		ВызватьИсключение Строка(Адаптер.КодОтвета) + " " + Адаптер.ОписаниеОшибки;
	КонецЕсли;
	
	// Получаем перечень всех читаемых разделов.
	Попытка
		Partitions = ПолучитьЧитаемыеРазделы(Адаптер, Consumer, ШинаИнфо.Тема);
		Если Partitions = Неопределено Тогда
			ВызватьИсключение Строка(Адаптер.КодОтвета) + " " + Адаптер.ОписаниеОшибки;
		КонецЕсли;
	Исключение
		Адаптер.ConsumerRelease(Consumer);
		ВызватьИсключение;
	КонецПопытки;
	
	Если Partitions.Количество() = 0 Тогда
		ВызватьИсключение "Не найдены темы Кафка, соответствующие предоставленному отбору.";
	КонецЕсли;
	
	// Вычисляем количество потоков.
	КоличествоПотоков = Макс(ШинаИнфо.ОбменКоличествоПотоков, 1);
	КоличествоПотоков = Мин(КоличествоПотоков, Partitions.Количество());
	
	Если КоличествоПотоков > 1 Тогда
		
		// Освобождаем текущего потребиталя, т.к. в каждом потоке будет свой собственный.
		Адаптер.ConsumerRelease(Consumer);
		
		// Инициализируем массив потоков.
		Потоки = Новый Массив;
		Для НомерПотока = 1 По КоличествоПотоков Цикл
			Поток = Новый Структура;
			Поток.Вставить("Номер", НомерПотока);
			Поток.Вставить("Partitions", Новый Массив);
			Поток.Вставить("ConsumerConfig", ConsumerConfig);
			Потоки.Добавить(Поток);
		КонецЦикла;
			
		// Произвольным (но равномерным) образом распределяем читаемые разделы по потокам.
		ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел;
		РазделовОсталось = Partitions.Количество();
		Пока РазделовОсталось > 0 Цикл
			Для Каждого Поток Из Потоки Цикл
				Индекс = ГенераторСлучайныхЧисел.СлучайноеЧисло(0, РазделовОсталось-1);
				TopicPartition = Partitions[Индекс];
				Поток.Partitions.Добавить(TopicPartition);
				Partitions.Удалить(Индекс);
				РазделовОсталось = РазделовОсталось - 1;
				Если РазделовОсталось = 0 Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ТекущийСеанс = ПолучитьТекущийСеансИнформационнойБазы();
		
		ФоновоеЗадание = ТекущийСеанс.ПолучитьФоновоеЗадание();
		ФоновоеЗаданиеИдентификатор = ?(ФоновоеЗадание = Неопределено, Неопределено, ФоновоеЗадание.УникальныйИдентификатор);
		
		СеансИнфо = Новый Структура;
		СеансИнфо.Вставить("Номер", ТекущийСеанс.НомерСеанса);
		СеансИнфо.Вставить("ДатаНачала", ТекущийСеанс.НачалоСеанса);
		СеансИнфо.Вставить("СерверИмя", ИмяКомпьютера());
		СеансИнфо.Вставить("ФоновоеЗаданиеИдентификатор", ФоновоеЗаданиеИдентификатор);
		СеансИнфо = Новый ФиксированнаяСтруктура(СеансИнфо);
		
		МассивЗаданий = Новый Массив;
		
		// Несколько потоков - запустим каждый в отдельном сеансе.
		Для Каждого Поток Из Потоки Цикл
						
			ЗаданиеПараметры = Новый Массив;
			ЗаданиеПараметры.Добавить(ШинаИнфо);
			ЗаданиеПараметры.Добавить(КластерИнфо);
			ЗаданиеПараметры.Добавить(Поток);
			ЗаданиеПараметры.Добавить(МоментЗавершения);
			ЗаданиеПараметры.Добавить(СеансИнфо);
			
			ЗаданиеКлюч = "КафкаСервер.ЗагрузитьРазделы_"
					+ Строка(ШинаИнфо.Ссылка.УникальныйИдентификатор()) + "_"
					+ Формат(Поток.Номер, "ЧЦ=3; ЧДЦ=0; ЧН=000");
					
			ЗаданиеНаименование = "Кафка загрузка " + ШинаИнфо.Наименование + " (" + Поток.Номер + ")";
					
			Задание = ФоновыеЗадания.Выполнить("КафкаСервер.ЗагрузитьРазделы", ЗаданиеПараметры, ЗаданиеКлюч, ЗаданиеНаименование);
			
			МассивЗаданий.Добавить(Задание);
			
		КонецЦикла;
		
		Ошибки = Новый Массив;
		
		// Ожидаем завершения потоков.
		Пока МассивЗаданий.Количество() > 0 Цикл
		
			МассивЗаданий = ФоновыеЗадания.ОжидатьЗавершенияВыполнения(МассивЗаданий, 5);
			
			Индекс = МассивЗаданий.Количество();
			Пока Индекс > 0 Цикл
				
				Индекс = Индекс - 1;
				Задание = МассивЗаданий[Индекс];
				
				Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
					Продолжить;
				КонецЕсли;
				
				МассивЗаданий.Удалить(Индекс);
				
				Если Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
					Ошибки.Добавить(Задание.ИнформацияОбОшибке);
				ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
					ОписаниеОшибки = "Один из потоков был вручную отменен.";
					ЗаписьЖурналаРегистрации(
							"Обмен данными.Кафка."+ШинаИнфо.Наименование,
							УровеньЖурналаРегистрации.Предупреждение,
							ШинаИнфо.Ссылка.Метаданные(),
							ШинаИнфо.Ссылка,
							ОписаниеОшибки);
				КонецЕсли;
						
			КонецЦикла;
			
		КонецЦикла;
		
		// Обработаем ошибки.
		Если Ошибки.Количество() > 0 Тогда
			МассивОписаниеОшибки = Новый Массив;
			МассивОписаниеОшибки.Добавить("Один или несколько потоков загрузки завершились ошибками.");
			Для Каждого ИнформацияОбОшибке Из Ошибки Цикл
				Если ИнформацияОбОшибке = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				МассивОписаниеОшибки.Добавить(Символы.ПС);
				МассивОписаниеОшибки.Добавить(Символы.ПС);
				МассивОписаниеОшибки.Добавить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			КонецЦикла;
			ВызватьИсключение СтрСоединить(МассивОписаниеОшибки);
		КонецЕсли;
		
	Иначе
		
		Поток = Новый Структура;
		Поток.Вставить("Номер", 1);
		Поток.Вставить("Partitions", Partitions);
		Поток.Вставить("Consumer", Consumer);
		Поток.Вставить("Адаптер", Адаптер);
		
		Попытка
			ЗагрузитьРазделы(ШинаИнфо, КластерИнфо, Поток, МоментЗавершения);
			Адаптер.ConsumerRelease(Consumer);
		Исключение
			Адаптер.ConsumerRelease(Consumer);
			ВызватьИсключение;
		КонецПопытки;

	КонецЕсли;
			
КонецПроцедуры

Процедура ЗагрузитьРазделы(ШинаИнфо, КластерИнфо, Параметры, МоментЗавершения, РодительскийСеансИнфо = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Инициализируем API Кафки.
	Адаптер = Неопределено;
	Если Не Параметры.Свойство("Адаптер", Адаптер) Тогда 
		Адаптер = Адаптер(КластерИнфо);
	КонецЕсли;
	
	// Инициализируем обработку загрузки данных.
	Обработка = КафкаПереопределяемый.ПолучитьОбработку(ШинаИнфо);
	Если Обработка = Неопределено Тогда
		ВызватьИсключение "Не удалось инициализировать обработку обмена для шины """+ШинаИнфо.Наименование+""".";
	КонецЕсли;
	
	// Установим реквизиты обработки.
	ПотенциальныеРеквизитыОбработки = Новый Структура;
	ПотенциальныеРеквизитыОбработки.Вставить("Узел", ШинаИнфо.Узел);
	ПотенциальныеРеквизитыОбработки.Вставить("Шина", ШинаИнфо.Ссылка);
	УстановитьРеквизитыОбработки(Обработка, ПотенциальныеРеквизитыОбработки);
	
	// Если по каким-то (или всем) разделам загрузка запрещена, удаляем разделы из массива.
	Индекс = Параметры.Partitions.Количество();
	Пока Индекс > 0 Цикл
		Индекс = Индекс - 1;
		TopicPartition = Параметры.Partitions[Индекс];
		Если Не Обработка.ПередЗагрузкойРаздела(TopicPartition.topic, TopicPartition.partition, Адаптер) Тогда
			Параметры.Partitions.Удалить(Индекс);
		КонецЕсли;
	КонецЦикла;
	
	Если Параметры.Partitions.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Consumer = Неопределено;
	Если Параметры.Свойство("Consumer", Consumer) Тогда
		
		ЗагрузитьРазделы_(ШинаИнфо, Обработка, Адаптер, Consumer, Параметры.Partitions, МоментЗавершения, РодительскийСеансИнфо);
		
	Иначе
		
		// Создаем экземпляр получателя внутри шлюза, который будет читать сообщения.
		Consumer = Адаптер.ConsumerCreate(
				ШинаИнфо.Наименование+" ("+Параметры.Номер+")",
				Параметры.ConsumerConfig,
				ШинаИнфо.КлиентТаймаут
		);
		Если Consumer = Неопределено Тогда
			ВызватьИсключение Строка(Адаптер.КодОтвета) + " " + Адаптер.ОписаниеОшибки;
		КонецЕсли;
		
		Попытка
			ЗагрузитьРазделы_(ШинаИнфо, Обработка, Адаптер, Consumer, Параметры.Partitions, МоментЗавершения, РодительскийСеансИнфо);
			Адаптер.ConsumerRelease(Consumer);
		Исключение
			Адаптер.ConsumerRelease(Consumer);
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
			
КонецПроцедуры

Процедура ЗагрузитьРазделы_(ШинаИнфо, Обработка, Адаптер, Consumer, Partitions, МоментЗавершения, РодительскийСеансИнфо)
	
	Успех = Адаптер.ConsumerAssign(Consumer, Partitions);
	Если Успех <> Истина Тогда
		ВызватьИсключение Строка(Адаптер.КодОтвета) + " " + Адаптер.ОписаниеОшибки;
	КонецЕсли;
	
	СостояниеЧтения = Новый Соответствие;
	
	ДобавитьТекущиеСмещения(СостояниеЧтения, ШинаИнфо.Кластер, Partitions);
	ДобавитьКонечныеСмещения(СостояниеЧтения, Адаптер, Consumer, Partitions);
	
	ОсталосьРазделов = 0;
	
	Для Каждого КлючЗначениеТема Из СостояниеЧтения Цикл
		Для Каждого КлючЗначениеРаздел Из КлючЗначениеТема.Значение Цикл
			
			СостояниеЧтенияРаздела = КлючЗначениеРаздел.Значение;
							
			Если СостояниеЧтенияРаздела.ТекущееСмещение > СостояниеЧтенияРаздела.КонечноеСмещение Тогда
				
				ТекстЗаписи =
				"Текущая позиция раздела ("+Формат(СостояниеЧтенияРаздела.ТекущееСмещение, "ЧН=0")+") больше конечной ("+Формат(СостояниеЧтенияРаздела.КонечноеСмещение, "ЧН=0")+").
				|Текущая позиция будет скорректирована.";
				
				ЗаписьЖурналаРегистрации(
						"Обмен данными.Кафка."+ШинаИнфо.Наименование,
						УровеньЖурналаРегистрации.Предупреждение,
						,
						КлючЗначениеТема.Ключ+":"+Формат(КлючЗначениеРаздел.Ключ, "ЧН=0; ЧГ=0"),
						ТекстЗаписи
				);
				
				СостояниеЧтенияРаздела.ТекущееСмещение = СостояниеЧтенияРаздела.КонечноеСмещение;
				
			КонецЕсли;
						
			Если ШинаИнфо.ПриемВРеальномВремени Или СостояниеЧтенияРаздела.ТекущееСмещение < СостояниеЧтенияРаздела.КонечноеСмещение Тогда
				ОсталосьРазделов = ОсталосьРазделов + 1;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Если ОсталосьРазделов > 0 Тогда
		
		ДобавитьНачальныеСмещения(СостояниеЧтения, Адаптер, Consumer, Partitions);
		
		Для Каждого КлючЗначениеТема Из СостояниеЧтения Цикл
			Для Каждого КлючЗначениеРаздел Из КлючЗначениеТема.Значение Цикл
				
				СостояниеЧтенияРаздела = КлючЗначениеРаздел.Значение;
				
				Если СостояниеЧтенияРаздела.ТекущееСмещение < СостояниеЧтенияРаздела.НачальноеСмещение Тогда
					
					ТекстЗаписи =
					"Текущая позиция раздела ("+Формат(СостояниеЧтенияРаздела.ТекущееСмещение, "ЧН=0")+") меньше начальной ("+Формат(СостояниеЧтенияРаздела.НачальноеСмещение, "ЧН=0")+").
					|Текущая позиция будет скорректирована.";
					
					ЗаписьЖурналаРегистрации(
							"Обмен данными.Кафка."+ШинаИнфо.Наименование,
							УровеньЖурналаРегистрации.Предупреждение,
							,
							КлючЗначениеТема.Ключ+":"+Формат(КлючЗначениеРаздел.Ключ, "ЧН=0; ЧГ=0"),
							ТекстЗаписи
					);
					
					СостояниеЧтенияРаздела.ТекущееСмещение = СостояниеЧтенияРаздела.НачальноеСмещение;
					
				КонецЕсли;
							
				СостояниеЧтенияРаздела.Вставить("ПолученоСообщений", 0);
				СостояниеЧтенияРаздела.Вставить("ПолученоСообщенийПослеПоследнейФиксации", 0);
				
				Успех = Адаптер.ConsumerSeek(Consumer, КлючЗначениеТема.Ключ, КлючЗначениеРаздел.Ключ, СостояниеЧтенияРаздела.ТекущееСмещение);
				Если Успех <> Истина Тогда
					ВызватьИсключение Строка(Адаптер.КодОтвета) + " " + Адаптер.ОписаниеОшибки;
				КонецЕсли;
						
				ЗаписьЖурналаРегистрации(
						"Обмен данными.Кафка."+ШинаИнфо.Наименование,
						УровеньЖурналаРегистрации.Информация,
						,
						КлючЗначениеТема.Ключ+":"+Формат(КлючЗначениеРаздел.Ключ, "ЧН=0; ЧГ=0"),
						"Начато чтение раздела. Текущая позиция: "+Формат(СостояниеЧтенияРаздела.ТекущееСмещение, "ЧН=0")+"."
				);
				
			КонецЦикла;
		КонецЦикла;
		
		МоментПоследнейФиксации = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Пока ОсталосьРазделов > 0 Цикл
			
			КоличествоПолученных = ПолучитьСообщения(ШинаИнфо, Обработка, Адаптер, Consumer, СостояниеЧтения, ОсталосьРазделов, МоментПоследнейФиксации);
			
			Если Не ШинаИнфо.ПриемВРеальномВремени И КоличествоПолученных = 0 Тогда
				Прервать;
			КонецЕсли;
						
			Если НеобходимоЗавершитьОперацию(МоментЗавершения, РодительскийСеансИнфо) Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого КлючЗначениеТема Из СостояниеЧтения Цикл
			Для Каждого КлючЗначениеРаздел Из КлючЗначениеТема.Значение Цикл
				
				СостояниеЧтенияРаздела = КлючЗначениеРаздел.Значение;
								
				ЗаписьЖурналаРегистрации(
						"Обмен данными.Кафка."+ШинаИнфо.Наименование,
						УровеньЖурналаРегистрации.Информация,
						,
						КлючЗначениеТема.Ключ+":"+Формат(КлючЗначениеРаздел.Ключ, "ЧН=0; ЧГ=0"),
						"Завершено чтение раздела. Конечная позиция: "+Формат(СостояниеЧтенияРаздела.ТекущееСмещение, "ЧН=0")+"."
				);
				
				Если СостояниеЧтенияРаздела.ПолученоСообщений > 0 Тогда
					РегистрыСведений.КафкаПозиции.УдалитьСтарые(ШинаИнфо.Кластер, КлючЗначениеТема.Ключ, КлючЗначениеРаздел.Ключ);
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого КлючЗначениеТема Из СостояниеЧтения Цикл
		Для Каждого КлючЗначениеРаздел Из КлючЗначениеТема.Значение Цикл
			
			СостояниеЧтенияРаздела = КлючЗначениеРаздел.Значение;
			
			Обработка.ПослеЗагрузкиРаздела(КлючЗначениеТема.Ключ, КлючЗначениеРаздел.Ключ, СостояниеЧтенияРаздела.ТекущееСмещение);
			
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

Процедура ДобавитьНачальныеСмещения(Смещения, Адаптер, Consumer, Partitions)
			
	BeginningOffsets = Адаптер.ConsumerGetBeginningOffsets(Consumer, Partitions);
	
	Если BeginningOffsets = Неопределено Тогда
		ВызватьИсключение Строка(Адаптер.КодОтвета) + " " + Адаптер.ОписаниеОшибки;
	КонецЕсли;
	
	Для Каждого TopicOffsets Из BeginningOffsets Цикл
		
		СмещенияТемы = Смещения.Получить(TopicOffsets.topic);
		Если СмещенияТемы = Неопределено Тогда
			СмещенияТемы = Новый Соответствие;
			Смещения.Вставить(TopicOffsets.topic, СмещенияТемы);
		КонецЕсли;
		
		Для Каждого PartitionOffset Из TopicOffsets.offsets Цикл
			
			СмещенияРаздела = СмещенияТемы.Получить(PartitionOffset.partition);
			Если СмещенияРаздела = Неопределено Тогда
				СмещенияРаздела = Новый Структура;
				СмещенияТемы.Вставить(PartitionOffset.partition, СмещенияРаздела);
			КонецЕсли;
			
			СмещенияРаздела.Вставить("НачальноеСмещение", partitionOffset.offset);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьКонечныеСмещения(Смещения, Адаптер, Consumer, Partitions)
			
	EndOffsets = Адаптер.ConsumerGetEndOffsets(Consumer, Partitions);
	
	Если EndOffsets = Неопределено Тогда
		ВызватьИсключение Строка(Адаптер.КодОтвета) + " " + Адаптер.ОписаниеОшибки;
	КонецЕсли;
	
	Для Каждого TopicOffsets Из EndOffsets Цикл
		
		СмещенияТемы = Смещения.Получить(TopicOffsets.topic);
		Если СмещенияТемы = Неопределено Тогда
			СмещенияТемы = Новый Соответствие;
			Смещения.Вставить(TopicOffsets.topic, СмещенияТемы);
		КонецЕсли;
		
		Для Каждого PartitionOffset Из TopicOffsets.offsets Цикл
			
			СмещенияРаздела = СмещенияТемы.Получить(PartitionOffset.partition);
			Если СмещенияРаздела = Неопределено Тогда
				СмещенияРаздела = Новый Структура;
				СмещенияТемы.Вставить(PartitionOffset.partition, СмещенияРаздела);
			КонецЕсли;
			
			СмещенияРаздела.Вставить("КонечноеСмещение", partitionOffset.offset);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьТекущиеСмещения(Смещения, Кластер, Partitions)
	
	Для Каждого TopicPartition Из Partitions Цикл
		
		СмещенияТемы = Смещения.Получить(TopicPartition.topic);
		Если СмещенияТемы = Неопределено Тогда
			СмещенияТемы = Новый Соответствие;
			Смещения.Вставить(TopicPartition.topic, СмещенияТемы);
		КонецЕсли;
		
		СмещенияРаздела = СмещенияТемы.Получить(TopicPartition.partition);
		Если СмещенияРаздела = Неопределено Тогда
			СмещенияРаздела = Новый Структура;
			СмещенияТемы.Вставить(TopicPartition.partition, СмещенияРаздела);
		КонецЕсли;
		
		ТекущееСмещение = РегистрыСведений.КафкаПозиции.ПолучитьПозицию(Кластер, TopicPartition.topic, TopicPartition.partition);
		Если Не ЗначениеЗаполнено(ТекущееСмещение) Тогда
			ТекущееСмещение = 0;
		КонецЕсли;
		
		СмещенияРаздела.Вставить("ТекущееСмещение", ТекущееСмещение);
		
	КонецЦикла;
		
КонецПроцедуры

Функция ПолучитьСообщения(ШинаИнфо, Обработка, Адаптер, Consumer, СостояниеЧтения, ОсталосьРазделов, МоментПоследнейФиксации)
	
	HttpОтвет = Адаптер.ConsumerPollRaw(Consumer, ШинаИнфо.ПриемТаймаутОжидания, "application/octet-stream");
	
	Если HttpОтвет = Неопределено Тогда
		ВызватьИсключение Строка(Адаптер.КодОтвета) + " " + Адаптер.ОписаниеОшибки;
	КонецЕсли;
	
	КоличествоПолученных = 0;
	
	Поток = HttpОтвет.ПолучитьТелоКакПоток();
	
	ЧтениеДанных = Новый ЧтениеДанных(Поток, КодировкаТекста.UTF8, ПорядокБайтов.BigEndian);
	
	Попытка
		
		Версия = ЧтениеДанных.ПрочитатьЦелое16();
		Если Версия = Неопределено Тогда
			ВызватьИсключение "Неожиданный конец пакета.";
		КонецЕсли;
		
		Если Версия = 1 Тогда
			КоличествоСообщений = ЧтениеДанных.ПрочитатьЦелое32();
			Если КоличествоСообщений = Неопределено Тогда
				ВызватьИсключение "Неожиданный конец пакета.";
			КонецЕсли;
		Иначе
			ВызватьИсключение "Неизвестная версия бинарной сериализации: " + Версия + ".";
		КонецЕсли;
		
		ИмяПроцедурыЗагрузки = "Обработка." + ШинаИнфо.ПриемПроцедура + "(Сообщение)";
		
		Пока Не ЧтениеДанных.ЧтениеЗавершено Цикл
			
			Сообщение = ПрочитатьСообщение(ШинаИнфо, ЧтениеДанных, Версия);
			
			Если Сообщение = Неопределено Тогда
				// Был достигнут конец потока.
				Прервать;
			КонецЕсли;
			
			СообщениеТема = Сообщение.Тема;
			СообщениеРаздел = Сообщение.Раздел;
			СообщениеСмещение = Сообщение.Смещение;
			
			Попытка
				
				Выполнить(ИмяПроцедурыЗагрузки);
				
				Если ТранзакцияАктивна() Тогда
					ВызватьИсключение "Обнаружена активная транзакция между получением сообщений.";
				КонецЕсли;
				
			Исключение
				
				Пока ТранзакцияАктивна() Цикл
					ОтменитьТранзакцию();
				КонецЦикла;
				
				ЗафиксироватьПозицииЧтения(ШинаИнфо, СостояниеЧтения);
				
				ВызватьИсключение;
				
			КонецПопытки;
			
			СостояниеЧтенияРаздела = СостояниеЧтения[СообщениеТема][СообщениеРаздел];
			
			СостояниеЧтенияРаздела.ПолученоСообщений = СостояниеЧтенияРаздела.ПолученоСообщений + 1;			
			СостояниеЧтенияРаздела.ПолученоСообщенийПослеПоследнейФиксации = СостояниеЧтенияРаздела.ПолученоСообщенийПослеПоследнейФиксации + 1;			
			
			ПредыдущееСмещение = СостояниеЧтенияРаздела.ТекущееСмещение;
			СостояниеЧтенияРаздела.ТекущееСмещение = СообщениеСмещение + 1;
			
			Если Не ШинаИнфо.ПриемВРеальномВремени
			И ПредыдущееСмещение < СостояниеЧтенияРаздела.КонечноеСмещение
			И СостояниеЧтенияРаздела.ТекущееСмещение >= СостояниеЧтенияРаздела.КонечноеСмещение Тогда
				ОсталосьРазделов = ОсталосьРазделов - 1;
			КонецЕсли;
			
			ТекущийМомент = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
			Если ТекущийМомент - МоментПоследнейФиксации >= 10000 Тогда
				
				МоментПоследнейФиксации = ТекущийМомент;
				
				ЗафиксироватьПозицииЧтения(ШинаИнфо, СостояниеЧтения);
				
				Успех = Адаптер.ConsumerTouch(Consumer);
				Если Успех <> Истина Тогда
					ВызватьИсключение Строка(Адаптер.КодОтвета) + " " + Адаптер.ОписаниеОшибки;
				КонецЕсли;
				
			КонецЕсли;
			
			КоличествоПолученных = КоличествоПолученных + 1;
			
		КонецЦикла;
		
		ЧтениеДанных.Закрыть();
		ЧтениеДанных = Неопределено;
		
		Поток.Закрыть();
		Поток = Неопределено;
		
	Исключение
		
		Если ЧтениеДанных <> Неопределено Тогда
			ЧтениеДанных.Закрыть();
		КонецЕсли;
		
		Если Поток <> Неопределено Тогда
			Поток.Закрыть();
		КонецЕсли;
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Если КоличествоСообщений <> Неопределено И КоличествоСообщений <> КоличествоПолученных Тогда
		ВызватьИсключение "Количество фактически полученных сообщений не соответствует заявленному.";
	КонецЕсли;
	
	Если КоличествоПолученных > 0 Тогда
		ЗафиксироватьПозицииЧтения(ШинаИнфо, СостояниеЧтения);
	КонецЕсли;
		
	Возврат КоличествоПолученных;
	
КонецФункции

Функция ПрочитатьСообщение(ШинаИнфо, ЧтениеДанных, Версия)
	
	Если Версия = 1 Тогда
		
		Длина = ЧтениеДанных.ПрочитатьЦелое32();
		
		// Чтение первого значения возвращает Неопределено, если достигнут конец потока.
		Если Длина = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если Длина = 0 Тогда
			Тема = "";
		Иначе
			Буфер = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных(Длина);
			Если Буфер = Неопределено Или Буфер.Размер <> Длина Тогда
				ВызватьИсключение "Неожиданный конец сообщения.";
			КонецЕсли;
			Тема = ПолучитьСтрокуИзБуфераДвоичныхДанных(Буфер, КодировкаТекста.UTF8);
		КонецЕсли;
		
		Раздел = ЧтениеДанных.ПрочитатьЦелое32();
		Если Раздел = Неопределено Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		КонецЕсли;
		
		Смещение = ЧтениеДанных.ПрочитатьЦелое64();
		Если Смещение = Неопределено Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		КонецЕсли;
		
		ОтметкаВремени = ЧтениеДанных.ПрочитатьЦелое64();
		Если ОтметкаВремени = Неопределено Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		КонецЕсли;
		
		КоличествоЗаголовков = ЧтениеДанных.ПрочитатьЦелое32();
		Если КоличествоЗаголовков = Неопределено Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		КонецЕсли;
		
		Заголовки = Новый Соответствие;
		
		Для НомерЗаголовка = 1 По КоличествоЗаголовков Цикл
			
			Длина = ЧтениеДанных.ПрочитатьЦелое32();
			Если Длина = Неопределено Тогда
				ВызватьИсключение "Неожиданный конец сообщения.";
			ИначеЕсли Длина = 0 Тогда
				ЗаголовокИмя = "";
			Иначе
				Буфер = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных(Длина);
				Если Буфер = Неопределено Или Буфер.Размер <> Длина Тогда
					ВызватьИсключение "Неожиданный конец сообщения.";
				КонецЕсли;
				ЗаголовокИмя = ПолучитьСтрокуИзБуфераДвоичныхДанных(Буфер, КодировкаТекста.UTF8);
			КонецЕсли;
			
			ЗаголовокЭтоNull = ЧтениеДанных.ПрочитатьБайт();
			Если ЗаголовокЭтоNull = Неопределено Тогда
				ВызватьИсключение "Неожиданный конец сообщения.";
			КонецЕсли;
			
			Если ЗаголовокЭтоNull Тогда
				ЗаголовокЗначение = Null;
			Иначе
				Длина = ЧтениеДанных.ПрочитатьЦелое32();
				Если Длина = Неопределено Тогда
					ВызватьИсключение "Неожиданный конец сообщения.";
				ИначеЕсли Длина = 0 Тогда
					ЗаголовокЗначение = "";
				Иначе
					Буфер = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных(Длина);
					Если Буфер = Неопределено Или Буфер.Размер <> Длина Тогда
						ВызватьИсключение "Неожиданный конец сообщения.";
					КонецЕсли;
					ЗаголовокЗначение = ПолучитьСтрокуИзБуфераДвоичныхДанных(Буфер, КодировкаТекста.UTF8);
				КонецЕсли;
			КонецЕсли;
			
			Заголовки.Вставить(ЗаголовокИмя, ЗаголовокЗначение);
			
		КонецЦикла;
		
		Ключ = ДесериализоватьЗначение(ЧтениеДанных, ШинаИнфо.КлючСердес);
		
		Значение = ДесериализоватьЗначение(ЧтениеДанных, ШинаИнфо.ЗначениеСердес);
		
		Сообщение = Новый Структура;
		Сообщение.Вставить("Тема", Тема);
		Сообщение.Вставить("Раздел", Раздел);
		Сообщение.Вставить("Смещение", Смещение);
		Сообщение.Вставить("ОтметкаВремени", ОтметкаВремени);
		Сообщение.Вставить("Заголовки", Заголовки);
		Сообщение.Вставить("Ключ", Ключ);
		Сообщение.Вставить("Значение", Значение);
		
	Иначе
		ВызватьИсключение "Неизвестная версия бинарной сериализации: " + Версия + ".";
	КонецЕсли;
	
	Возврат Сообщение;
	
КонецФункции

Функция ДесериализоватьЗначение(ЧтениеДанных, Сердес)
	
	ЭтоNull = ЧтениеДанных.ПрочитатьБайт();
	Если ЭтоNull = Неопределено Тогда
		ВызватьИсключение "Неожиданный конец сообщения.";
	КонецЕсли;
	
	Если ЭтоNull Тогда
		
		Возврат Null;
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.Null Тогда
		
		ВызватьИсключение "Некорректный тип исходных данных. Ожидается NULL, но получено другое значение.";
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.Игнорировать Тогда
		
		Длина = ЧтениеДанных.ПрочитатьЦелое32();
		
		Если Длина = Неопределено Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		ИначеЕсли Длина > 0 Тогда
			ЧтениеДанных.Пропустить(Длина);
		КонецЕсли;
		
		Возврат Неопределено;
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.Строка Тогда
		
		Длина = ЧтениеДанных.ПрочитатьЦелое32();
		
		Если Длина = Неопределено Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		ИначеЕсли Длина = 0 Тогда
			Возврат "";
		КонецЕсли;
		
		Буфер = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных(Длина);
		Если Буфер = Неопределено Или Буфер.Размер <> Длина Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		КонецЕсли;
		
		Возврат ПолучитьСтрокуИзБуфераДвоичныхДанных(Буфер, КодировкаТекста.UTF8);
				
	ИначеЕсли Сердес = Перечисления.КафкаСердес.ДвоичныеДанные Тогда
		
		Длина = ЧтениеДанных.ПрочитатьЦелое32();
		
		Если Длина = Неопределено Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		ИначеЕсли Длина = 0 Тогда
			Буфер = Новый БуферДвоичныхДанных(0);
			Возврат ПолучитьДвоичныеДанныеИзБуфераДвоичныхДанных(Буфер);
		КонецЕсли;
		
		РезультатЧтения = ЧтениеДанных.Прочитать(Длина);
		Если РезультатЧтения = Неопределено Или РезультатЧтения.Размер <> Длина Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		КонецЕсли;
		
		Возврат РезультатЧтения.ПолучитьДвоичныеДанные();
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.Uuid Тогда
		
		Длина = ЧтениеДанных.ПрочитатьЦелое32();
		
		Если Длина = Неопределено Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		ИначеЕсли Длина = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Буфер = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных(Длина);
		Если Буфер = Неопределено Или Буфер.Размер <> Длина Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		КонецЕсли;
		
		UuidСтрокой = ПолучитьСтрокуИзБуфераДвоичныхДанных(Буфер, КодировкаТекста.UTF8);
		Возврат XmlЗначение(Тип("УникальныйИдентификатор"), UuidСтрокой);
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.СтруктураJson Тогда
		
		Длина = ЧтениеДанных.ПрочитатьЦелое32();
		
		Если Длина = Неопределено Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		ИначеЕсли Длина = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		РезультатЧтения = ЧтениеДанных.Прочитать(Длина);
		Если РезультатЧтения = Неопределено Или РезультатЧтения.Размер <> Длина Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		КонецЕсли;
		
		Поток = РезультатЧтения.ОткрытьПотокДляЧтения();
		ЧтениеJson = Новый ЧтениеJSON;
		ЧтениеJson.ОткрытьПоток(Поток, КодировкаТекста.UTF8);
		Значение = JsonДесериализовать(ЧтениеJson, Ложь);
		Поток.Закрыть();
		Возврат Значение;
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.СоответствиеJson Тогда
		
		Длина = ЧтениеДанных.ПрочитатьЦелое32();
		
		Если Длина = Неопределено Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		ИначеЕсли Длина = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		РезультатЧтения = ЧтениеДанных.Прочитать(Длина);
		Если РезультатЧтения = Неопределено Или РезультатЧтения.Размер <> Длина Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		КонецЕсли;
		
		Поток = РезультатЧтения.ОткрытьПотокДляЧтения();
		ЧтениеJson = Новый ЧтениеJSON;
		ЧтениеJson.ОткрытьПоток(Поток, КодировкаТекста.UTF8);
		Значение = JsonДесериализовать(ЧтениеJson, Истина);
		Поток.Закрыть();
		Возврат Значение;
		
	ИначеЕсли Сердес = Перечисления.КафкаСердес.Xml Тогда
		
		Длина = ЧтениеДанных.ПрочитатьЦелое32();
		
		Если Длина = Неопределено Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		ИначеЕсли Длина = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		РезультатЧтения = ЧтениеДанных.Прочитать(Длина);
		Если РезультатЧтения = Неопределено Или РезультатЧтения.Размер <> Длина Тогда
			ВызватьИсключение "Неожиданный конец сообщения.";
		КонецЕсли;
		
		Поток = РезультатЧтения.ОткрытьПотокДляЧтения();
		ЧтениеXml = Новый ЧтениеXML;
		ЧтениеXml.ОткрытьПоток(Поток, , , КодировкаТекста.UTF8);
		Значение = XmlДесериализовать(ЧтениеXml);
		Поток.Закрыть();
		Возврат Значение;
		
	Иначе
		ВызватьИсключение "Неожиданный/неподдерживаемый тип сериализации значения: """+Сердес+"""."
	КонецЕсли;
	
КонецФункции

Процедура ЗафиксироватьПозицииЧтения(ШинаИнфо, СостояниеЧтения)
	
	Если ТранзакцияАктивна() Тогда
		ВызватьИсключение "Во время фиксации позиции чтения транзакция не должна быть активна.";
	КонецЕсли;
	
	Для Каждого КлючЗначениеТема Из СостояниеЧтения Цикл
		Для Каждого КлючЗначениеРаздел Из КлючЗначениеТема.Значение Цикл
			
			СостояниеЧтенияРаздела = КлючЗначениеРаздел.Значение;
			
			Если СостояниеЧтенияРаздела.ПолученоСообщенийПослеПоследнейФиксации = 0 Тогда
				Продолжить;
			КонецЕсли;
						
			РегистрыСведений.КафкаПозиции.УстановитьПозицию(ШинаИнфо.Кластер, КлючЗначениеТема.Ключ, КлючЗначениеРаздел.Ключ, СостояниеЧтенияРаздела.ТекущееСмещение);
			
			СостояниеЧтенияРаздела.ПолученоСообщенийПослеПоследнейФиксации = 0;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция НеобходимоЗавершитьОперацию(МоментЗавершения, РодительскийСеансИнфо)
	
	// Проверка истечения максимальной длительности сеанса.
	Если МоментЗавершения <> Неопределено И ТекущаяУниверсальнаяДатаВМиллисекундах() >= МоментЗавершения Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Проверка активности родительского фонового задания.
	Если РодительскийСеансИнфо <> Неопределено И РодительскийСеансИнфо.ФоновоеЗаданиеИдентификатор <> Неопределено Тогда
		РодительскоеФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(РодительскийСеансИнфо.ФоновоеЗаданиеИдентификатор);
		Если РодительскоеФоновоеЗадание = Неопределено Или РодительскоеФоновоеЗадание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Проверка необходимости завершения соединения из-за выключенного рабочего процесса.
	НеобходимостьЗавершенияСоединения = НеобходимостьЗавершенияСоединения();
	Если НеобходимостьЗавершенияСоединения.НеобходимоЗавершить Тогда
		Возврат Истина;
	КонецЕсли;
				
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьЧитаемыеРазделы(Адаптер, Consumer, Тема)
	
	Partitions = Новый Массив;
		
	Если ЭтоШаблон(Тема) Тогда
		
		РегулярноеВыражение = ПолучитьРегулярноеВыражениеПоШаблону(Тема);
				
		TopicInfos = Адаптер.ConsumerListTopics(Consumer, РегулярноеВыражение);
		Если TopicInfos = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Для Каждого TopicInfo Из TopicInfos Цикл
			Для Каждого PartitionInfo Из TopicInfo.partitions Цикл
				Partitions.Добавить(Новый ФиксированнаяСтруктура("topic, partition", TopicInfo.topic, PartitionInfo.partition));
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		
		PartitionInfos = Адаптер.ConsumerGetPartitions(Consumer, Тема);
		Если PartitionInfos = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Для Каждого PartitionInfo Из PartitionInfos Цикл
			Partitions.Добавить(Новый ФиксированнаяСтруктура("topic, partition", Тема, PartitionInfo.partition));
		КонецЦикла;
				
	КонецЕсли;
	
	Возврат Partitions;
	
КонецФункции

#КонецОбласти

#Область РучноеИспользование

Функция КластерПоУмолчанию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Константы.КафкаКластерПоУмолчанию.Получить();
	
КонецФункции

Функция Адаптер(Кластер) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КластерТип = ТипЗнч(Кластер);
	Если КластерТип = Тип("СправочникСсылка.КафкаКластеры") Тогда
		КластерИнфо = КластерИнфо(Кластер);
		Если КластерИнфо = Неопределено Тогда
			ВызватьИсключение "Некорректный кластер.";
		КонецЕсли;
	ИначеЕсли КластерТип = Тип("Структура") Или КластерТип = Тип("ФиксированнаяСтруктура") Тогда
		КластерИнфо = Кластер;
	Иначе
		ВызватьИсключение "Некорректный тип параметра ""Кластер"".";
	КонецЕсли;
		
	Адаптер = Обработки.КафкаАдаптер.Создать();
		
	Адаптер.Инициализировать(
			КластерИнфо.ШлюзАдрес,
			КластерИнфо.ШлюзПользователь,
			КластерИнфо.ШлюзПароль,
			КластерИнфо.ШлюзТаймаут
	);
			
	Возврат Адаптер;
	
КонецФункции

Функция СоздатьProducer(Кластер, Адаптер, Операция, ДопКонфигурация = Неопределено, ТаймаутМс = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Конфигурация = КонфигурацияОтправителя(Кластер);
	
	Если ДопКонфигурация <> Неопределено Тогда
		Для Каждого КлючЗначение Из ДопКонфигурация Цикл
			Конфигурация.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Producer = Адаптер.ProducerCreate(Операция, Конфигурация, ТаймаутМс);
	
	Возврат Producer;
	
КонецФункции

Функция СоздатьConsumer(Кластер, Адаптер, Операция, ДопКонфигурация = Неопределено, ТаймаутМс = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Конфигурация = КонфигурацияПолучателя(Кластер);
	
	Если ДопКонфигурация <> Неопределено Тогда
		Для Каждого КлючЗначение Из ДопКонфигурация Цикл
			Конфигурация.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Consumer = Адаптер.ConsumerCreate(Операция, Конфигурация, ТаймаутМс);
	
	Возврат Consumer;
	
КонецФункции

Функция СоздатьAdmin(Кластер, Адаптер, Операция, ДопКонфигурация = Неопределено, ТаймаутМс = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Конфигурация = КонфигурацияБазовая(Кластер);
	
	Если ДопКонфигурация <> Неопределено Тогда
		Для Каждого КлючЗначение Из ДопКонфигурация Цикл
			Конфигурация.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Admin = Адаптер.AdminCreate(Операция, Конфигурация, ТаймаутМс);
	
	Возврат Admin;
	
КонецФункции

#КонецОбласти

#Область СлужебныеФункции

Функция КонфигурацияБазовая(Кластер)
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Кластеры.КафкаСерверы КАК Серверы,
	|	Кластеры.КафкаПротоколБезопасности КАК ПротоколБезопасности,
	|	Кластеры.КафкаМеханизмSASL КАК МеханизмSASL,
	|	Кластеры.КафкаПользователь КАК Пользователь,
	|	Кластеры.КафкаПользовательУстановлен КАК ПользовательУстановлен,
	|	Кластеры.КафкаПароль КАК Пароль
	|ИЗ
	|	Справочник.КафкаКластеры КАК Кластеры
	|ГДЕ
	|	Кластеры.Ссылка = &Кластер");
	Запрос.УстановитьПараметр("Кластер", Кластер);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение "Передан некорректный параметр.";
	КонецЕсли;
	
	КластерРеквизиты = РезультатЗапроса.Выгрузить()[0];
	
	Результат = Новый Соответствие;
	Результат.Вставить("client.id", КафкаПереопределяемый.ИдентификаторИнфобазы());
	Результат.Вставить("bootstrap.servers", КластерРеквизиты.Серверы);
	Результат.Вставить("security.protocol", КластерРеквизиты.ПротоколБезопасности);
	
	Если КластерРеквизиты.ПротоколБезопасности = "PLAINTEXT" Тогда
		
	ИначеЕсли КластерРеквизиты.ПротоколБезопасности = "SASL_PLAINTEXT" Или КластерРеквизиты.ПротоколБезопасности = "SASL_SSL" Тогда
				
		Результат.Вставить("sasl.mechanism", КластерРеквизиты.МеханизмSASL);
		
		Если КластерРеквизиты.МеханизмSASL = "PLAIN" Тогда
			ClassName = "org.apache.kafka.common.security.plain.PlainLoginModule";
		ИначеЕсли КластерРеквизиты.МеханизмSASL = "SCRAM-SHA-256" Или КластерРеквизиты.МеханизмSASL = "SCRAM-SHA-512" Тогда
			ClassName = "org.apache.kafka.common.security.scram.ScramLoginModule";
		Иначе
			ВызватьИсключение "Неожиданное значение механизма SASL: """ + КластерРеквизиты.МеханизмSASL + """.";
		КонецЕсли;
		
		Если КластерРеквизиты.ПользовательУстановлен Тогда
			SaslUsername = КластерРеквизиты.Пользователь;
		Иначе
			SaslUsername = КафкаПереопределяемый.ПользовательПоУмолчанию();
		КонецЕсли;
		SaslUsername = СтрЗаменить(SaslUsername, "\", "\\");
		SaslUsername = СтрЗаменить(SaslUsername, """", "\""");
		
		SaslPassword = КластерРеквизиты.Пароль.Получить();
		SaslPassword = Строка(SaslPassword);
		SaslPassword = СтрЗаменить(SaslPassword, "\", "\\");
		SaslPassword = СтрЗаменить(SaslPassword, """", "\""");
		
		Результат.Вставить("sasl.jaas.config", ClassName + " required username=""" + SaslUsername + """ password=""" + SaslPassword + """;");
		
	ИначеЕсли КластерРеквизиты.ПротоколБезопасности = "SSL" Тогда
		
	Иначе
		ВызватьИсключение "Неожиданное значение протокола безопасности: """ + КластерРеквизиты.ПротоколБезопасности + """.";
	КонецЕсли;
		
	Возврат Результат;
			
КонецФункции

Функция КонфигурацияОтправителя(Кластер)
		
	Конфигурация = КонфигурацияБазовая(Кластер);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КафкаКластеры.ШлюзТаймаут КАК ШлюзТаймаут
	|ИЗ
	|	Справочник.КафкаКластеры КАК КафкаКластеры
	|ГДЕ
	|	КафкаКластеры.Ссылка = &Кластер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Конфигурация.Параметр КАК Параметр,
	|	Конфигурация.Значение КАК Значение
	|ИЗ
	|	Справочник.КафкаКластеры.КафкаКонфигурацияОтправителя КАК Конфигурация
	|ГДЕ
	|	Конфигурация.Ссылка = &Кластер");
	Запрос.УстановитьПараметр("Кластер", Кластер);
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатыЗапросов[0].Выбрать();
	Выборка.Следующий();	
	Конфигурация.Вставить("delivery.timeout.ms", Выборка.ШлюзТаймаут*1000-1000);
	
	Выборка = РезультатыЗапросов[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Конфигурация.Вставить(Выборка.Параметр, Выборка.Значение);
	КонецЦикла;
	
	Возврат Конфигурация;
			
КонецФункции

Функция КонфигурацияПолучателя(Кластер)
		
	Результат = КонфигурацияБазовая(Кластер);
	
	Результат.Вставить("group.id", КафкаПереопределяемый.ГруппаПолучателей());
	Результат.Вставить("auto.offset.reset", "earliest");
	Результат.Вставить("enable.auto.commit", "false");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Конфигурация.Параметр КАК Параметр,
	|	Конфигурация.Значение КАК Значение
	|ИЗ
	|	Справочник.КафкаКластеры.КафкаКонфигурацияПолучателя КАК Конфигурация
	|ГДЕ
	|	Конфигурация.Ссылка = &Кластер");
	Запрос.УстановитьПараметр("Кластер", Кластер);
	РезультатЗапроса = Запрос.Выполнить();
			
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Параметр, Выборка.Значение);
	КонецЦикла;
	
	Возврат Результат;
			
КонецФункции

Функция КонфигурацияШины(Шина)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Шины.Ссылка КАК Ссылка,
	|	Шины.Кластер КАК Кластер,
	|	Шины.ОбменНаправление КАК ОбменНаправление
	|ИЗ
	|	Справочник.КафкаШины КАК Шины
	|ГДЕ
	|	Шины.Ссылка = &Шина
	|	И НЕ Шины.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Конфигурация.Параметр КАК Параметр,
	|	Конфигурация.Значение КАК Значение
	|ИЗ
	|	Справочник.КафкаШины.КафкаКонфигурация КАК Конфигурация
	|ГДЕ
	|	Конфигурация.Ссылка = &Шина");
	Запрос.УстановитьПараметр("Шина", Шина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[0].Пустой() Тогда
		ВызватьИсключение "Передан некорректный параметр.";
	КонецЕсли;
	
	ШинаРеквизиты = РезультатЗапроса[0].Выгрузить()[0];
	
	Если ШинаРеквизиты.ОбменНаправление = Перечисления.КафкаНаправленияОбмена.Выгрузка Тогда
		Результат = КонфигурацияОтправителя(ШинаРеквизиты.Кластер);
	ИначеЕсли ШинаРеквизиты.ОбменНаправление = Перечисления.КафкаНаправленияОбмена.Загрузка Тогда
		Результат = КонфигурацияПолучателя(ШинаРеквизиты.Кластер);
	Иначе
		ВызватьИсключение "Неожиданное направление обмена: """+ШинаРеквизиты.ОбменНаправление+""".";
	КонецЕсли;
			
	ТЗ = РезультатЗапроса[1].Выгрузить();
	Для Каждого С Из ТЗ Цикл
		Результат.Вставить(С.Параметр, С.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьРеквизитыОбработки(Обработка, ПотенциальныеРеквизиты)
	
	ОбработкаМетаданные = Обработка.Метаданные();
	
	Для Каждого КЗ Из ПотенциальныеРеквизиты Цикл
		
		ОбработкаРеквизит = ОбработкаМетаданные.Реквизиты.Найти(КЗ.Ключ);
		
		Если ОбработкаРеквизит <> Неопределено Тогда
			
			ЗначениеПравое = КЗ.Значение;
			Обработка[КЗ.Ключ] = ЗначениеПравое;
			ЗначениеЛевое = Обработка[КЗ.Ключ]; 
			
			Если Не ЗначениеЗаполнено(ЗначениеЛевое) И Не ЗначениеЗаполнено(ЗначениеПравое) Тогда
			ИначеЕсли ЗначениеЛевое <> ЗначениеПравое Тогда
				ВызватьИсключение "Не удалось установить реквизит """+КЗ.Ключ+""" при инициализации обработки выгрузки/загрузки данных.";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ШинаИнфо(Шина) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Шины.Ссылка КАК Ссылка,
	|	Шины.ПометкаУдаления КАК ПометкаУдаления,
	|	Шины.Родитель КАК Родитель,
	|	Шины.ЭтоГруппа КАК ЭтоГруппа,
	|	Шины.Наименование КАК Наименование,
	|	Шины.Кластер КАК Кластер,
	|	Шины.ОбменНаправление КАК ОбменНаправление,
	|	Шины.Тема КАК Тема,
	|	Шины.Узел КАК Узел,
	|	Шины.КлючСердес КАК КлючСердес,
	|	Шины.ЗначениеСердес КАК ЗначениеСердес,
	|	Шины.ОбменДлительностьСеанса КАК ОбменДлительностьСеанса,
	|	Шины.ОбменКоличествоПотоков КАК ОбменКоличествоПотоков,
	|	Шины.ОбменПоРасписанию КАК ОбменПоРасписанию,
	|	Шины.ОбменРасписание КАК ОбменРасписание,
	|	Шины.ОбменРасписаниеРазброс КАК ОбменРасписаниеРазброс,
	|	Шины.Обработка КАК Обработка,
	|	Шины.КлиентТаймаут КАК КлиентТаймаут,
	|	Шины.ПриемПроцедура КАК ПриемПроцедура,
	|	Шины.ПриемВРеальномВремени КАК ПриемВРеальномВремени,
	|	Шины.ПриемТаймаутОжидания КАК ПриемТаймаутОжидания,
	|	ЕСТЬNULL(ЕСТЬNULL(Шины.ПользовательРеглЗадания, Шины.Родитель.ПользовательРеглЗадания), """") КАК ПользовательРеглЗадания
	|ИЗ
	|	Справочник.КафкаШины КАК Шины
	|ГДЕ
	|	Шины.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Шина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[0].Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Шапка = РезультатЗапроса[0].Выгрузить()[0];
	Для Каждого Колонка Из РезультатЗапроса[0].Колонки Цикл
		Результат.Вставить(Колонка.Имя, Шапка[Колонка.Имя]);
	КонецЦикла;
		
	Результат.ОбменРасписание = Результат.ОбменРасписание.Получить();
	
	Результат.Тема = Тема(Результат.Тема);
	
	Результат.Вставить("ТемаЭтоПрефикс", СтрЗаканчиваетсяНа(Результат.Тема, "*"));
	Если Результат.ТемаЭтоПрефикс Тогда
		Результат.Вставить("ТемаПрефикс", Лев(Результат.Тема, СтрДлина(Результат.Тема)-1));
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция КластерИнфо(Кластер)
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Кластеры.ШлюзАдрес КАК ШлюзАдрес,
	|	Кластеры.ШлюзПользователь КАК ШлюзПользователь,
	|	Кластеры.ШлюзПароль КАК ШлюзПароль,
	|	Кластеры.ШлюзТаймаут КАК ШлюзТаймаут
	|ИЗ
	|	Справочник.КафкаКластеры КАК Кластеры
	|ГДЕ
	|	Кластеры.Ссылка = &Кластер");
	Запрос.УстановитьПараметр("Кластер", Кластер);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение "Передан некорректный параметр.";
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ШлюзПароль = Выборка.ШлюзПароль.Получить();
	
	Результат = Новый Структура;
	Результат.Вставить("ШлюзАдрес", Выборка.ШлюзАдрес);
	Результат.Вставить("ШлюзПользователь", Выборка.ШлюзПользователь);
	Результат.Вставить("ШлюзПароль", Строка(ШлюзПароль));
	Результат.Вставить("ШлюзТаймаут", Выборка.ШлюзТаймаут);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Процедура ОбновитьРегламентныеЗадания(ШинаСсылка, Удалить = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ШинаИнфо = ШинаИнфо(ШинаСсылка);
	
	МассивЗаданийОтправка = Новый Массив;
	м = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.КафкаВыгрузка));
	Для Каждого Задание Из м Цикл
		Если Задание.Параметры = Неопределено Или Задание.Параметры.Количество()=0 Или ТипЗнч(Задание.Параметры[0]) <> Тип("СправочникСсылка.КафкаШины") Или Не ЗначениеЗаполнено(Задание.Параметры[0]) Тогда
			УдалитьРегламентноеЗадание(Задание);
		ИначеЕсли Задание.Параметры[0] = ШинаСсылка Тогда
			МассивЗаданийОтправка.Добавить(Задание);
		КонецЕсли;
	КонецЦикла;
	
	МассивЗаданийПрием = Новый Массив;
	м = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.КафкаЗагрузка));
	Для Каждого Задание Из м Цикл
		Если Задание.Параметры = Неопределено Или Задание.Параметры.Количество()=0 Или ТипЗнч(Задание.Параметры[0]) <> Тип("СправочникСсылка.КафкаШины") Или Не ЗначениеЗаполнено(Задание.Параметры[0]) Тогда
			УдалитьРегламентноеЗадание(Задание);
		ИначеЕсли Задание.Параметры[0] = ШинаСсылка Тогда
			МассивЗаданийПрием.Добавить(Задание);
		КонецЕсли;
	КонецЦикла;
	
	Если Удалить = Истина Или ШинаИнфо.ПометкаУдаления Тогда
		Для Каждого Задание Из МассивЗаданийОтправка Цикл
			УдалитьРегламентноеЗадание(Задание);
		КонецЦикла;
		Для Каждого Задание Из МассивЗаданийПрием Цикл
			УдалитьРегламентноеЗадание(Задание);
		КонецЦикла;
		Возврат;
	КонецЕсли;
		
	Если ШинаИнфо.ОбменНаправление = Перечисления.КафкаНаправленияОбмена.Выгрузка Тогда
		
		Для Каждого Задание Из МассивЗаданийПрием Цикл
			УдалитьРегламентноеЗадание(Задание);
		КонецЦикла;
		
		Задание = Неопределено;
		
		Если МассивЗаданийОтправка.Количество() > 0 Тогда
			Задание = МассивЗаданийОтправка.Получить(0);
			МассивЗаданийОтправка.Удалить(0);
		КонецЕсли;
		
		Для Каждого Задание_ Из МассивЗаданийОтправка Цикл
			УдалитьРегламентноеЗадание(Задание_);
		КонецЦикла;
		
		ОбновитьРегламентноеЗадание(ШинаИнфо, Задание);
							
	ИначеЕсли ШинаИнфо.ОбменНаправление = Перечисления.КафкаНаправленияОбмена.Загрузка Тогда
		
		Для Каждого Задание Из МассивЗаданийОтправка Цикл
			УдалитьРегламентноеЗадание(Задание);
		КонецЦикла;
		
		Задание = Неопределено;
		
		Если МассивЗаданийПрием.Количество() > 0 Тогда
			Задание = МассивЗаданийПрием.Получить(0);
			МассивЗаданийПрием.Удалить(0);
		КонецЕсли;
		
		Для Каждого Задание_ Из МассивЗаданийПрием Цикл
			УдалитьРегламентноеЗадание(Задание_);
		КонецЦикла;
		
		ОбновитьРегламентноеЗадание(ШинаИнфо, Задание);
											
	Иначе
		ВызватьИсключение "Неизвестное направление обмена шины: " + ШинаИнфо.ОбменНаправление;
	КонецЕсли;
	
КонецПроцедуры
Процедура ОбновитьРегламентноеЗадание(ШинаИнфо, Задание)
	
	Если ШинаИнфо.ОбменНаправление = Перечисления.КафкаНаправленияОбмена.Выгрузка Тогда
		ЗаданиеМетаданные = Метаданные.РегламентныеЗадания.КафкаВыгрузка;
	ИначеЕсли ШинаИнфо.ОбменНаправление = Перечисления.КафкаНаправленияОбмена.Загрузка Тогда
		ЗаданиеМетаданные = Метаданные.РегламентныеЗадания.КафкаЗагрузка;
	Иначе
		ВызватьИсключение "Неизвестное направление обмена шины: " + ШинаИнфо.ОбменНаправление;
	КонецЕсли;
	
	Если Задание = Неопределено Тогда
		Если ШинаИнфо.ПометкаУдаления Или Не ШинаИнфо.ОбменПоРасписанию Тогда
			Возврат;
		КонецЕсли;
		Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(ЗаданиеМетаданные);
	КонецЕсли;
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	ЗаполнитьЗначенияСвойств(Расписание, ШинаИнфо.ОбменРасписание);
	
	Если Расписание.ПериодПовтораВТечениеДня <> 0 И ШинаИнфо.ОбменРасписаниеРазброс <> 0 Тогда
		ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел;
		Смещение = ГенераторСлучайныхЧисел.СлучайноеЧисло(0, ШинаИнфо.ОбменРасписаниеРазброс*2) - ШинаИнфо.ОбменРасписаниеРазброс;
		Расписание.ПериодПовтораВТечениеДня = Расписание.ПериодПовтораВТечениеДня + Смещение;
	КонецЕсли;
	
	Параметры = Новый Массив;
	Параметры.Добавить(ШинаИнфо.Ссылка);
	
	Задание.Параметры		= Параметры;
	Задание.Ключ			= ЗаданиеМетаданные.Ключ+"_"+ШинаИнфо.Ссылка.УникальныйИдентификатор();
	Задание.Наименование	= ЗаданиеМетаданные.Наименование+" ("+ШинаИнфо.Наименование+")";
	Задание.Расписание		= Расписание;
	Задание.Использование	= ШинаИнфо.ОбменПоРасписанию И Не ШинаИнфо.ПометкаУдаления;
	Задание.ИмяПользователя	= ШинаИнфо.ПользовательРеглЗадания;
	
	Задание.Записать();
	
	Если Не Задание.Использование Тогда
		ОтменитьФоновоеЗадание(Задание);
	КонецЕсли;
	
КонецПроцедуры
Процедура УдалитьРегламентноеЗадание(РегламентноеЗадание)
	
	Если РегламентноеЗадание.Использование Тогда
		РегламентноеЗадание.Использование = Ложь;
		РегламентноеЗадание.Записать();
	КонецЕсли;
	
	ОтменитьФоновоеЗадание(РегламентноеЗадание);
	
	РегламентноеЗадание.Удалить();
		
КонецПроцедуры
Процедура ОтменитьФоновоеЗадание(РегламентноеЗадание)
	
	Отбор = Новый Структура;
	Отбор.Вставить("РегламентноеЗадание", РегламентноеЗадание);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	
	АктивныеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
		
	Для Каждого ФоновоеЗадание Из АктивныеФоновыеЗадания Цикл
		ФоновоеЗадание.Отменить();
	КонецЦикла;
	
КонецПроцедуры

Функция Тема(ИсходнаяТема) Экспорт
		
	Если КафкаПовтИсп.ЭтоБэкап() Тогда
		Возврат "test-" + ИсходнаяТема;
	КонецЕсли;
	
	Возврат ИсходнаяТема;
	
КонецФункции

Процедура ПолучитьГраничныеСмещенияТемыВФоне(Кластер, Тема, АдресРезультата) Экспорт
	
	Адаптер = Адаптер(Кластер);
		
	Операция = "Получение граничных смещений темы";
	
	Consumer = СоздатьConsumer(Кластер, Адаптер, Операция, , 10000);
		
	Если Consumer <> Неопределено Тогда
			
		Попытка
			
			Результат = ПолучитьГраничныеСмещенияТемы(Кластер, Адаптер, Consumer, Тема);
			
			Если Результат <> Неопределено Тогда
				ОписаниеРезультата = Новый Структура;
				ОписаниеРезультата.Вставить("Успех", Истина);
				ОписаниеРезультата.Вставить("Результат", Результат);
			Иначе
				ОписаниеРезультата = Новый Структура;
				ОписаниеРезультата.Вставить("Успех", Ложь);
				ОписаниеРезультата.Вставить("ОписаниеОшибки", Строка(Адаптер.КодОтвета) + " " + Адаптер.ОписаниеОшибки);
			КонецЕсли;
			
			Адаптер.ConsumerRelease(Consumer);
			
		Исключение
			Адаптер.ConsumerRelease(Consumer);
			ВызватьИсключение;
		КонецПопытки;
			
	КонецЕсли;
		
	ПоместитьВоВременноеХранилище(ОписаниеРезультата, АдресРезультата);
	
КонецПроцедуры

Функция ПолучитьГраничныеСмещенияТемы(Кластер, Адаптер, Consumer, Тема)
		
	Partitions = ПолучитьЧитаемыеРазделы(Адаптер, Consumer, Тема);
	Если Partitions = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Успех = Адаптер.ConsumerAssign(Consumer, Partitions);
	Если Успех <> Истина Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Смещения = Новый Соответствие;
	ДобавитьНачальныеСмещения(Смещения, Адаптер, Consumer, Partitions);
	ДобавитьКонечныеСмещения(Смещения, Адаптер, Consumer, Partitions);
	
	Возврат Смещения;
	
КонецФункции

Функция СтрокаСоединенияИнфобазы() Экспорт
	
	Если КафкаПовтИсп.ЭтоФоновоеЗадание() Тогда
		Возврат СтрокаСоединенияИнформационнойБазы();
	КонецЕсли;
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено);
	
	Параметры = Новый Массив;
	Параметры.Добавить(АдресРезультата);
	
	Задание = ФоновыеЗадания.Выполнить(
			"КафкаСервер.ПолучитьСтрокуСоединенияИнфобазыВФоне",
			Параметры,
			,
			"Кафка: Получение строки соединения информационной базы"
	);
	
	Пока Задание.Состояние = СостояниеФоновогоЗадания.Активно Цикл
		
		Задание = Задание.ОжидатьЗавершенияВыполнения(1);
		
	КонецЦикла;
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
		
		Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
		
		УдалитьИзВременногоХранилища(АдресРезультата);	
		
	Иначе
		
		УдалитьИзВременногоХранилища(АдресРезультата);	
		
		Если Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			
			ОписаниеОшибки = ?(Задание.ИнформацияОбОшибке = Неопределено,
					"Фоновое задание завершилось с неизвестнос ошибкой.",
			        ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке)
			);
			
		ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
			
			ОписаниеОшибки = "Фоновое задание было отменено.";
			
		ИначеЕсли Задание.Состояние <> СостояниеФоновогоЗадания.Завершено Тогда
			
			ОписаниеОшибки = "Неожиданное состояние фонового задания: "+Задание.Состояние+".";
			
		КонецЕсли;
		
		ВызватьИсключение ОписаниеОшибки;
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Процедура ПолучитьСтрокуСоединенияИнфобазыВФоне(АдресРезультата) Экспорт
	
	Результат = СтрокаСоединенияИнформационнойБазы();
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Функция ЭтоФоновоеЗадание() Экспорт
	
	ТекущийСеансИБ = ПолучитьТекущийСеансИнформационнойБазы();
	ТекущееФЗ = ТекущийСеансИБ.ПолучитьФоновоеЗадание();
	
	Возврат (ТекущееФЗ <> Неопределено);
	
КонецФункции

Функция ЭтоШаблон(Строка) Экспорт
	
	ЭтоШаблон = Ложь;
	ЭтоШаблон = ЭтоШаблон Или (СтрНайти(Строка, "*") > 0);
	ЭтоШаблон = ЭтоШаблон Или (СтрНайти(Строка, "?") > 0);
	ЭтоШаблон = ЭтоШаблон Или (СтрНайти(Строка, "+") > 0);
	
	Возврат ЭтоШаблон;
	
КонецФункции

Функция ПолучитьРегулярноеВыражениеПоШаблону(Шаблон) Экспорт
	
	// В шаблоне допускаются только следующие метасимволы:
	// * - ноль или более любых символов,
	// ? - ноль или один любой символ,
	// + один или более любых символов.
	// Проверка на соответствие шаблону осуществляется для всей строки.

	РегулярноеВыражение = Шаблон;
	РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение, "\", "\\");
	РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение, ".", "\.");
	РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение, "|", "\|");
	РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение, "^", "\^");
	РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение, "$", "\$");
	РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение, "[", "\[");
	РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение, "]", "\]");
	РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение, "{", "\{");
	РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение, "}", "\}");
	РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение, "(", "\(");
	РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение, ")", "\)");
	РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение, "*", ".*");
	РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение, "?", ".?");
	РегулярноеВыражение = СтрЗаменить(РегулярноеВыражение, "+", ".+");
	
	Возврат РегулярноеВыражение;
	
КонецФункции

#КонецОбласти

#Область СериализацияJSON

Функция JsonСериализовать(Значение, ПараметрыЗаписиИлиЗаписьJSON = Неопределено, НастройкиСериализацииJSON = Неопределено) Экспорт
		
	Если ПараметрыЗаписиИлиЗаписьJson = Неопределено Тогда
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
	Иначе
		ТипПараметра = ТипЗнч(ПараметрыЗаписиИлиЗаписьJSON);
		Если ТипПараметра = Тип("ПараметрыЗаписиJSON") Тогда
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиИлиЗаписьJSON);
		ИначеЕсли ТипПараметра = Тип("ЗаписьJSON") Тогда
			ЗаписьJSON = ПараметрыЗаписиИлиЗаписьJSON;
		Иначе
			ВызватьИсключение "Недопустимое значение параметра.";
		КонецЕсли;
	КонецЕсли;
	
	Если НастройкиСериализацииJSON = Неопределено Тогда
		ЗаписатьJSON(ЗаписьJSON, Значение);
	Иначе
		ЗаписатьJSON(ЗаписьJSON, Значение, НастройкиСериализацииJSON);
	КонецЕсли;
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция JsonДесериализовать(СтрокаИлиЧтениеJSON, КакСоответствие = Неопределено) Экспорт
	
    ТипПараметра = ТипЗнч(СтрокаИлиЧтениеJSON);
	Если ТипПараметра = Тип("Строка") Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаИлиЧтениеJSON);
	ИначеЕсли ТипПараметра = Тип("ЧтениеJSON") Тогда
		ЧтениеJSON = СтрокаИлиЧтениеJSON;
	Иначе
		ВызватьИсключение "Недопустимое значение параметра.";
	КонецЕсли;
	
	Если КакСоответствие = Неопределено Тогда
		Результат = ПрочитатьJSON(ЧтениеJSON);
	Иначе
		Результат = ПрочитатьJSON(ЧтениеJSON, КакСоответствие);
	КонецЕсли;
	
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СериализацияXML

Функция XmlСериализовать(Значение, ОтступИлиЗаписьXML = Неопределено) Экспорт
	
	Если ОтступИлиЗаписьXML = Неопределено Тогда
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
	Иначе
	    ТипПараметра = ТипЗнч(ОтступИлиЗаписьXML);
		Если ТипПараметра = Тип("Булево") Тогда
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.Отступ = ОтступИлиЗаписьXML;
			ЗаписьXML.УстановитьСтроку();
		ИначеЕсли ТипПараметра = Тип("ЗаписьXML") Тогда
			ЗаписьXML = ОтступИлиЗаписьXML;
		Иначе
			ВызватьИсключение "Недопустимое значение параметра.";
		КонецЕсли;
	КонецЕсли;
	
	XmlЗаписатьЗначение(ЗаписьXML, Значение);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции
Процедура XmlЗаписатьЗначение(ЗаписьXML, Значение)

	ТипЗнч = ТипЗнч(Значение);
	Если ТипЗнч = Тип("Структура") Или ТипЗнч = Тип("ФиксированнаяСтруктура") Тогда
	    XmlЗаписатьСтруктуру(ЗаписьXML, Значение);
	ИначеЕсли ТипЗнч = Тип("Соответствие") Или ТипЗнч = Тип("ФиксированноеСоответствие") Тогда
	    XmlЗаписатьСоответствие(ЗаписьXML, Значение);
	ИначеЕсли ТипЗнч = Тип("Массив") Или ТипЗнч = Тип("ФиксированныйМассив") Тогда
	    XmlЗаписатьМассив(ЗаписьXML, Значение);
	ИначеЕсли ТипЗнч = Тип("ТаблицаЗначений") Тогда
	    XmlЗаписатьТаблицуЗначений(ЗаписьXML, Значение);
	Иначе
		ЗаписатьXML(ЗаписьXML, Значение);
	КонецЕсли;
	
КонецПроцедуры
Процедура XmlЗаписатьСтруктуру(ЗаписьXML, Структура)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("struct");
	
	Для Каждого КлючЗначение Из Структура Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("structItem");
		ЗаписьXML.ЗаписатьАтрибут("key", КлючЗначение.Ключ);
		
		XmlЗаписатьЗначение(ЗаписьXML, КлючЗначение.Значение);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры	
Процедура XmlЗаписатьСоответствие(ЗаписьXML, Соответствие)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("map");
	
	Для Каждого КлючЗначение Из Соответствие Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("mapItem");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("mapItemKey");
		XmlЗаписатьЗначение(ЗаписьXML, КлючЗначение.Ключ);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("mapItemValue");
		XmlЗаписатьЗначение(ЗаписьXML, КлючЗначение.Значение);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры	
Процедура XmlЗаписатьМассив(ЗаписьXML, Массив)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("array");
	
	Для Каждого Элемент Из Массив Цикл
		XmlЗаписатьЗначение(ЗаписьXML, Элемент);
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры	
Процедура XmlЗаписатьТаблицуЗначений(ЗаписьXML, ТаблицаЗначений)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("valueTable");
	
	Для Каждого КолонкаТаблицы Из ТаблицаЗначений.Колонки Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("column");
		ЗаписьXML.ЗаписатьАтрибут("name", КолонкаТаблицы.Имя);
		XmlЗаписатьЗначение(ЗаписьXML, КолонкаТаблицы.ТипЗначения);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	МаксИндексКолонки = ТаблицаЗначений.Колонки.Количество() - 1;
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("row");
		Для ИндексКолонки = 0 По МаксИндексКолонки Цикл
			XmlЗаписатьЗначение(ЗаписьXML, СтрокаТаблицы[ИндексКолонки]);
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры	

Функция XmlДесериализовать(СтрокаИлиЧтениеXML) Экспорт
	
    ТипПараметра = ТипЗнч(СтрокаИлиЧтениеXML);
	Если ТипПараметра = Тип("Строка") Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(СтрокаИлиЧтениеXML);
	ИначеЕсли ТипПараметра = Тип("ЧтениеXML") Тогда
		ЧтениеXML = СтрокаИлиЧтениеXML;
	Иначе
		ВызватьИсключение "Недопустимое значение параметра.";
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	Результат = XmlПрочитатьЗначение(ЧтениеXML);
	
	ЧтениеXML.Закрыть();
	
	Возврат Результат;
	
КонецФункции
Функция XmlПрочитатьЗначение(ЧтениеXML)
	
	Если ЧтениеXML.Имя = "struct" Тогда
		Значение = XmlПрочитатьСтруктуру(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "map" Тогда
		Значение = XmlПрочитатьСоответствие(ЧтениеXML);
	ИначеЕсли ЧтениеXML.Имя = "array" Тогда
		Значение = XmlПрочитатьМассив(ЧтениеXML);	
	ИначеЕсли ЧтениеXML.Имя = "valueTable" Тогда
		Значение = XmlПрочитатьТаблицуЗначений(ЧтениеXML);
	Иначе
		Значение = ПрочитатьXML(ЧтениеXML);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции
Функция XmlПрочитатьСтруктуру(ЧтениеXML)
	
	Результат = Новый Структура;
	
	ЧтениеXML.Прочитать(); //потребим начало структуры
	
	Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
		
		Ключ = ЧтениеXML.ПолучитьАтрибут(0);
		
		ЧтениеXML.Прочитать(); // потребим начало элемента значения
		Значение = XmlПрочитатьЗначение(ЧтениеXML);
		ЧтениеXML.Прочитать(); // потребим конец элемента значения
		
		Результат.Вставить(Ключ, Значение);
		
	КонецЦикла;
	
	ЧтениеXML.Прочитать(); // потребим конец структуры
		
	Возврат Результат;
	
КонецФункции
Функция XmlПрочитатьСоответствие(ЧтениеXML)
	
	Результат = Новый Соответствие;
	
	ЧтениеXML.Прочитать(); //потребим начало соответствия
	
	Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
		
		ЧтениеXML.Прочитать(); // потребим начало элемента соответствия
		
		ЧтениеXML.Прочитать(); // потребим начало элемента ключа
		Ключ = XmlПрочитатьЗначение(ЧтениеXML);
		ЧтениеXML.Прочитать(); // потребим конец элемента ключа
		
		ЧтениеXML.Прочитать(); // потребим начало элемента значения
		Значение = XmlПрочитатьЗначение(ЧтениеXML);
		ЧтениеXML.Прочитать(); // потребим конец элемента значения
		
		ЧтениеXML.Прочитать(); // потребим конец элемента соответствия
		
		Результат.Вставить(Ключ, Значение);
		
	КонецЦикла;
	
	ЧтениеXML.Прочитать(); // потребим конец соответствия
		
	Возврат Результат;
	
КонецФункции
Функция XmlПрочитатьМассив(ЧтениеXML)
	
	Результат = Новый Массив;
	
	ЧтениеXML.Прочитать(); //потребим начало массива
	
	Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
		
		Значение = XmlПрочитатьЗначение(ЧтениеXML);
		
		Результат.Добавить(Значение);
		
	КонецЦикла;
		
	ЧтениеXML.Прочитать(); // потребим конец массива
	
	Возврат Результат;
	
КонецФункции
Функция XmlПрочитатьТаблицуЗначений(ЧтениеXML)
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	ЧтениеXML.Прочитать(); //потребим начало таблицы
	
	Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
		
		Если ЧтениеXML.Имя = "column" Тогда
			ИмяКолонки = ЧтениеXML.ПолучитьАтрибут("name");
			ЧтениеXML.Прочитать(); // потребим начало колонки
			ТипКолонки = XmlПрочитатьЗначение(ЧтениеXML);
			ТаблицаЗначений.Колонки.Добавить(ИмяКолонки, ТипКолонки);
			ЧтениеXML.Прочитать(); // потребим конец колонки
		ИначеЕсли ЧтениеXML.Имя = "row" Тогда
			СтрокаТаблицы = ТаблицаЗначений.Добавить();
			ЧтениеXML.Прочитать(); // потребим начало строки
			ИндексКолонки = 0;
			Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
				СтрокаТаблицы[ИндексКолонки] = XmlПрочитатьЗначение(ЧтениеXML);
				ИндексКолонки = ИндексКолонки + 1;
			КонецЦикла;
			ЧтениеXML.Прочитать(); // потребим конец строки
		Иначе
			ЧтениеXML.Пропустить();
		КонецЕсли;
		
	КонецЦикла;
		
	ЧтениеXML.Прочитать(); // потребим конец таблицы
	
	Возврат ТаблицаЗначений;
	
КонецФункции

#КонецОбласти

#Область СериализацияAvroAsXml

Функция AvroСериализовать(Значение, Имя = Неопределено, ПространствоИмен = Неопределено, ОтступИлиЗаписьXML = Ложь) Экспорт
	
    ТипПараметра = ТипЗнч(ОтступИлиЗаписьXML);
	
	Если ТипПараметра = Тип("Булево") Тогда
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.Отступ = ОтступИлиЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
	ИначеЕсли ТипПараметра = Тип("ЗаписьXML") Тогда
		ЗаписьXML = ОтступИлиЗаписьXML;
	Иначе
		ВызватьИсключение "Недопустимое значение параметра.";
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	Если ЗначениеТип = Тип("Структура") Или ЗначениеТип = Тип("ФиксированнаяСтруктура") Тогда
		AvroЗаписатьRecord(ЗаписьXML, Значение, Имя, ПространствоИмен);
	Иначе
		ВызватьИсключение "Корневым элементом сериализовываемых данных может быть только значение типа ""Структура"" или ""Фиксированная структура"".";
	КонецЕсли;
		
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

Процедура AvroЗаписатьЗначение(ЗаписьXML, Значение, Имя = Неопределено)

	Если Значение = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	
	Если ЗначениеТип = Тип("Строка") Тогда
		
		AvroЗаписатьString(ЗаписьXML, Значение, Имя);
		
	ИначеЕсли ЗначениеТип = Тип("Число") Тогда
		
		AvroЗаписатьDecimal(ЗаписьXML, Значение, Имя);
		
	ИначеЕсли ЗначениеТип = Тип("Дата") Тогда
		
		AvroЗаписатьTimestampMillis(ЗаписьXML, Значение, Имя);
		
	ИначеЕсли ЗначениеТип = Тип("Булево") Тогда
		
		AvroЗаписатьBoolean(ЗаписьXML, Значение, Имя);
		
	ИначеЕсли ЗначениеТип = Тип("УникальныйИдентификатор") Тогда
		
		AvroЗаписатьUuid(ЗаписьXML, Значение, Имя);
		
	ИначеЕсли ЗначениеТип = Тип("ДвоичныеДанные") Тогда
		
		AvroЗаписатьBytes(ЗаписьXML, Значение, Имя);
		
	ИначеЕсли ЗначениеТип = Тип("Структура") Или ЗначениеТип = Тип("ФиксированнаяСтруктура") Тогда
		
		AvroЗаписатьRecord(ЗаписьXML, Значение, Имя);
		
	ИначеЕсли ЗначениеТип = Тип("Массив") Или ЗначениеТип = Тип("ФиксированныйМассив") Тогда
		
		AvroЗаписатьArray(ЗаписьXML, Значение, Имя);
		
	ИначеЕсли ЗначениеТип = Тип("Соответствие") Или ЗначениеТип = Тип("ФиксированноеСоответствие") Тогда
		
		AvroЗаписатьMap(ЗаписьXML, Значение, Имя);
		
#Если Сервер ИЛИ ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
			
	ИначеЕсли ЗначениеТип = Тип("ТаблицаЗначений") Тогда
	
		AvroЗаписатьТаблицуЗначений(ЗаписьXML, Значение, Имя);
		
	ИначеЕсли ЗначениеТип = Тип("РезультатЗапроса") Тогда
		
		AvroЗаписатьРезультатЗапроса(ЗаписьXML, Значение, Имя);
		
#КонецЕсли

	Иначе
		
		ВызватьИсключение "Передано значение некорректного типа: "+ЗначениеТип+".";
		
	КонецЕсли;
		
		
КонецПроцедуры

Процедура AvroЗаписатьRecord(ЗаписьXML, Структура, Имя, ПространствоИмен = Неопределено)
	
	Если Структура = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	AvroЗаписатьRecordНачало(ЗаписьXML, Имя, ПространствоИмен);
	
	Для Каждого КЗ Из Структура Цикл
		AvroЗаписатьЗначение(ЗаписьXML, КЗ.Значение, КЗ.Ключ);
	КонецЦикла;
	
	AvroЗаписатьRecordКонец(ЗаписьXML);
	
КонецПроцедуры

Процедура AvroЗаписатьArray(ЗаписьXML, Массив, Имя)
	
	Если Массив = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	AvroЗаписатьArrayНачало(ЗаписьXML, Имя);
	
	Для Каждого Элемент Из Массив Цикл
		AvroЗаписатьЗначение(ЗаписьXML, Элемент);
	КонецЦикла;
	
	AvroЗаписатьArrayКонец(ЗаписьXML);
	
КонецПроцедуры

Процедура AvroЗаписатьMap(ЗаписьXML, Соответствие, Имя)
	
	Если Соответствие = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	AvroЗаписатьMapНачало(ЗаписьXML, Имя);
	
	Для Каждого КЗ Из Соответствие Цикл
		AvroЗаписатьMapЭлемент(ЗаписьXML, КЗ.Ключ, КЗ.Значение);
	КонецЦикла;
	
	AvroЗаписатьMapКонец(ЗаписьXML);
	
КонецПроцедуры

Процедура AvroЗаписатьNull(ЗаписьXML, Имя = Неопределено) Экспорт
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("null");
	Если Имя <> Неопределено  Тогда
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьBoolean(ЗаписьXML, Значение, Имя = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	
	Если ЗначениеТип = Тип("Булево") Тогда
		ЗначениеБулево = Значение;
	Иначе
		ВызватьИсключение "Передано значение некорректного типа: """+ЗначениеТип+""".";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("boolean");
	Если Имя <> Неопределено  Тогда
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(ЗначениеБулево));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьInt(ЗаписьXML, Значение, Имя = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	
	Если ЗначениеТип = Тип("Число") Тогда
		ЗначениеЧисло = Цел(Значение);
	Иначе
		ВызватьИсключение "Передано значение некорректного типа: """+ЗначениеТип+""".";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("int");
	Если Имя <> Неопределено  Тогда
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(ЗначениеЧисло));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьLong(ЗаписьXML, Значение, Имя = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	
	Если ЗначениеТип = Тип("Число") Тогда
		ЗначениеЧисло = Цел(Значение);
	Иначе
		ВызватьИсключение "Передано значение некорректного типа: """+ЗначениеТип+""".";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("long");
	Если Имя <> Неопределено  Тогда
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(ЗначениеЧисло));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьString(ЗаписьXML, Значение, Имя = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	
	Если ЗначениеТип = Тип("Строка") Тогда
		ЗначениеСтрока = Значение;
	Иначе
		ВызватьИсключение "Передано значение некорректного типа: """+ЗначениеТип+""".";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("string");
	Если Имя <> Неопределено  Тогда
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
	ЗаписьXML.ЗаписатьТекст(ЗначениеСтрока);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьBytes(ЗаписьXML, Значение, Имя = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	
	Если ЗначениеТип = Тип("ДвоичныеДанные") Тогда
		ЗначениеСтрока = ПолучитьBase64СтрокуИзДвоичныхДанных(Значение);
	ИначеЕсли ЗначениеТип = Тип("БуферДвоичныхДанных") Тогда
		ЗначениеСтрока = ПолучитьBase64СтрокуИзБуфераДвоичныхДанных(Значение);
	Иначе
		ВызватьИсключение "Передано значение некорректного типа: """+ЗначениеТип+""".";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("bytes");
	Если Имя <> Неопределено  Тогда
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
	ЗаписьXML.ЗаписатьТекст(ЗначениеСтрока);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьRecordНачало(ЗаписьXML, Имя = Неопределено, ПространствоИмен = Неопределено) Экспорт
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("record");
	
	Если Имя <> Неопределено Тогда 
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
	
	Если ПространствоИмен <> Неопределено Тогда 
		ЗаписьXML.ЗаписатьАтрибут("namespace", ПространствоИмен);
	КонецЕсли;
	
КонецПроцедуры
Процедура AvroЗаписатьRecordКонец(ЗаписьXML) Экспорт
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьEnum(ЗаписьXML, Значение, Имя = Неопределено, ПространствоИмен = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	
	Если ЗначениеТип = Тип("Строка") Тогда
		ЗначениеСтрока = Значение;
	Иначе
		ВызватьИсключение "Передано значение некорректного типа: """+ЗначениеТип+""".";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("enum");
	
	Если Имя <> Неопределено  Тогда
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
	
	Если ПространствоИмен <> Неопределено Тогда 
		ЗаписьXML.ЗаписатьАтрибут("namespase", ПространствоИмен);
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьТекст(ЗначениеСтрока);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьArrayНачало(ЗаписьXML, Имя = Неопределено) Экспорт
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("array");
	
	Если Имя <> Неопределено Тогда 
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
		
КонецПроцедуры
Процедура AvroЗаписатьArrayКонец(ЗаписьXML) Экспорт
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьMapНачало(ЗаписьXML, Имя = Неопределено) Экспорт
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("map");
	
	Если Имя <> Неопределено Тогда 
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
		
КонецПроцедуры
Процедура AvroЗаписатьMapЭлемент(ЗаписьXML, Ключ, Значение) Экспорт
	
	КлючТип = ТипЗнч(Ключ);
	Если КлючТип <> Тип("Строка") Тогда
		ВызватьИсключение "Передан ключ некорректного типа: """+КлючТип+""".";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("mapItem");
	ЗаписьXML.ЗаписатьАтрибут("key", Ключ);
	
	AvroЗаписатьЗначение(ЗаписьXML, Значение);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры
Процедура AvroЗаписатьMapКонец(ЗаписьXML) Экспорт
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьFixed(ЗаписьXML, Значение, Имя = Неопределено, ПространствоИмен = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	
	Если ЗначениеТип = Тип("ДвоичныеДанные") Тогда
		ЗначениеСтрока = ПолучитьBase64СтрокуИзДвоичныхДанных(Значение);
	ИначеЕсли ЗначениеТип = Тип("БуферДвоичныхДанных") Тогда
		ЗначениеСтрока = ПолучитьBase64СтрокуИзБуфераДвоичныхДанных(Значение);
	Иначе
		ВызватьИсключение "Передано значение некорректного типа: """+ЗначениеТип+""".";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("fixed");
	
	Если Имя <> Неопределено  Тогда
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
	
	Если ПространствоИмен <> Неопределено Тогда 
		ЗаписьXML.ЗаписатьАтрибут("namespase", ПространствоИмен);
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьТекст(ЗначениеСтрока);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьDecimal(ЗаписьXML, Значение, Имя = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	
	Если ЗначениеТип = Тип("Число") Тогда
		ЗначениеЧисло = Значение;
	Иначе
		ВызватьИсключение "Передано значение некорректного типа: """+ЗначениеТип+""".";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("decimal");
	Если Имя <> Неопределено Тогда
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(ЗначениеЧисло));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьUuid(ЗаписьXML, Значение, Имя = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	
	Если ЗначениеТип = Тип("УникальныйИдентификатор") Тогда
		ЗначениеUUID = Значение;
	Иначе
		ВызватьИсключение "Передано значение некорректного типа: """+ЗначениеТип+""".";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("uuid");
	Если Имя <> Неопределено  Тогда
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(ЗначениеUUID));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьDate(ЗаписьXML, Значение, Имя = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	
	Если ЗначениеТип = Тип("Дата") Тогда
		ЗначениеДата = Значение;
	Иначе
		ВызватьИсключение "Передано значение некорректного типа: """+ЗначениеТип+""".";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("date");
	Если Имя <> Неопределено  Тогда
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
	ЗаписьXML.ЗаписатьТекст(Формат(ЗначениеДата, "ДФ=yyyy-MM-dd; ДП=0001-01-01"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьTimestampMillis(ЗаписьXML, Значение, Имя = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	
	Если ЗначениеТип = Тип("Дата") Тогда
		ЗначениеСтрока = XMLСтрока(Значение);
	ИначеЕсли ЗначениеТип = Тип("Число") Тогда // количество миллисекунд, начиная с 01.01.0001 00:00:00 UTC
		Миллисекунды = Цел(Значение % 1000);
		ЗначениеДата = '00010101' + Цел(Значение/1000);
		ЗначениеДата = МестноеВремя(ЗначениеДата);
		ЗначениеСтрока = XMLСтрока(ЗначениеДата);
		Если Миллисекунды <> 0 Тогда
			ЗначениеСтрока = ЗначениеСтрока+Формат(Миллисекунды, "ЧЦ=3; ЧВН=; ЧГ=0; ЧФ=.Ч");
		КонецЕсли;
	Иначе
		ВызватьИсключение "Передано значение некорректного типа: """+ЗначениеТип+""".";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("timestamp-millis");
	Если Имя <> Неопределено  Тогда
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
	ЗаписьXML.ЗаписатьТекст(ЗначениеСтрока);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьTimestampMicros(ЗаписьXML, Значение, Имя = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	
	Если ЗначениеТип = Тип("Дата") Тогда
		ЗначениеДата = Значение;
	ИначеЕсли ЗначениеТип = Тип("Число") Тогда // количество микросекунд, начиная с 01.01.0001 00:00:00 UTC
		Микросекунды = Цел(Значение % 1000000);
		ЗначениеДата = '00010101' + Цел(Значение/1000000);
		ЗначениеДата = МестноеВремя(ЗначениеДата);
		ЗначениеСтрока = XMLСтрока(ЗначениеДата);
		Если Микросекунды <> 0 Тогда
			ЗначениеСтрока = ЗначениеСтрока+"."+Формат(Микросекунды, "ЧЦ=6; ЧВН=; ЧГ=0; ЧФ=.Ч");
		КонецЕсли;
	Иначе
		ВызватьИсключение "Передано значение некорректного типа: """+ЗначениеТип+""".";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("timestamp-micros");
	Если Имя <> Неопределено  Тогда
		ЗаписьXML.ЗаписатьАтрибут("name", Имя);
	КонецЕсли;
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(ЗначениеДата));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура AvroЗаписатьТаблицуЗначений(ЗаписьXML, Значение, Имя = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	
	Если ЗначениеТип = Тип("ТаблицаЗначений") Тогда
		ТаблицаЗначений = Значение;
	Иначе
		ВызватьИсключение "Передано значение некорректного типа: """+ЗначениеТип+""".";
	КонецЕсли;
	
	Колонки = ТаблицаЗначений.Колонки;
	
	AvroЗаписатьArrayНачало(ЗаписьXML, Имя);
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		
		AvroЗаписатьRecordНачало(ЗаписьXML);
		
		Для Каждого Колонка Из Колонки Цикл
			AvroЗаписатьЗначение(ЗаписьXML, Строка[Колонка.Имя], Колонка.Имя);
		КонецЦикла;
		
		AvroЗаписатьRecordКонец(ЗаписьXML);
		
	КонецЦикла;
	
	AvroЗаписатьArrayКонец(ЗаписьXML);
	
КонецПроцедуры

Процедура AvroЗаписатьРезультатЗапроса(ЗаписьXML, Значение, Имя = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда
		AvroЗаписатьNull(ЗаписьXML, Имя);
		Возврат;
	КонецЕсли;
	
	ЗначениеТип = ТипЗнч(Значение);
	
	Если ЗначениеТип = Тип("РезультатЗапроса") Тогда
		РезультатЗапроса = Значение;
	Иначе
		ВызватьИсключение "Передано значение некорректного типа: """+ЗначениеТип+""".";
	КонецЕсли;
	
	Колонки = РезультатЗапроса.Колонки;
	
	AvroЗаписатьArrayНачало(ЗаписьXML, Имя);
		
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		AvroЗаписатьRecordНачало(ЗаписьXML);
		
		Для Каждого Колонка Из Колонки Цикл
			AvroЗаписатьЗначение(ЗаписьXML, Выборка[Колонка.Имя], Колонка.Имя);
		КонецЦикла;
		
		AvroЗаписатьRecordКонец(ЗаписьXML);
		
	КонецЦикла;
	
	AvroЗаписатьArrayКонец(ЗаписьXML);
	
КонецПроцедуры

#КонецОбласти

#Область ДесериализацияAvroAsXml

Функция AvroДесериализовать(СтрокаИлиЧтениеXML, Имя = Неопределено, ПространствоИмен = Неопределено) Экспорт
	
	Если СтрокаИлиЧтениеXML = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
    ТипПараметра = ТипЗнч(СтрокаИлиЧтениеXML);
	Если ТипПараметра = Тип("Строка") Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(СтрокаИлиЧтениеXML);
	ИначеЕсли ТипПараметра = Тип("ЧтениеXML") Тогда
		ЧтениеXML = СтрокаИлиЧтениеXML;
	Иначе
		ВызватьИсключение "Недопустимое значение параметра.";
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	
	Имя = ЧтениеXML.ПолучитьАтрибут("name");
	ПространствоИмен = ЧтениеXML.ПолучитьАтрибут("namespace");
	
	Результат = AvroПрочитатьЗначение(ЧтениеXML);
	
	ЧтениеXML.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция AvroПрочитатьЗначение(ЧтениеXML)
	
	Если ЧтениеXML.Имя = "decimal" Тогда
		
		Значение = AvroПрочитатьDecimal(ЧтениеXML);
		
	ИначеЕсли ЧтениеXML.Имя = "uuid" Тогда
		
		Значение = AvroПрочитатьUuid(ЧтениеXML);
		
	ИначеЕсли ЧтениеXML.Имя = "record" Тогда
		
		Значение = AvroПрочитатьRecord(ЧтениеXML);
		
	ИначеЕсли ЧтениеXML.Имя = "string" Тогда
		
		Значение = AvroПрочитатьString(ЧтениеXML);
				
	ИначеЕсли ЧтениеXML.Имя = "int" Тогда
		
		Значение = AvroПрочитатьInt(ЧтениеXML);
		
	ИначеЕсли ЧтениеXML.Имя = "long" Тогда
		
		Значение = AvroПрочитатьLong(ЧтениеXML);
		
	ИначеЕсли ЧтениеXML.Имя = "date" Тогда
		
		Значение = AvroПрочитатьDate(ЧтениеXML);
				
	ИначеЕсли ЧтениеXML.Имя = "timestamp-millis" Тогда
		
		Значение = AvroПрочитатьTimestampMillis(ЧтениеXML);
		
	ИначеЕсли ЧтениеXML.Имя = "timestamp-micros" Тогда
		
		Значение = AvroПрочитатьTimestampMicros(ЧтениеXML);
				
	ИначеЕсли ЧтениеXML.Имя = "boolean" Тогда
		
		Значение = AvroПрочитатьBoolean(ЧтениеXML);
		
	ИначеЕсли ЧтениеXML.Имя = "enum" Тогда
		
		Значение = AvroПрочитатьEnum(ЧтениеXML);
		
	ИначеЕсли ЧтениеXML.Имя = "fixed" Тогда
		
		Значение = AvroПрочитатьFixed(ЧтениеXML);
		
	ИначеЕсли ЧтениеXML.Имя = "bytes" Тогда
		
		Значение = AvroПрочитатьBytes(ЧтениеXML);
				
	ИначеЕсли ЧтениеXML.Имя = "array" Тогда
		
		Значение = AvroПрочитатьArray(ЧтениеXML);
		
	ИначеЕсли ЧтениеXML.Имя = "map" Тогда
		
		Значение = AvroПрочитатьMap(ЧтениеXML);	
		
	ИначеЕсли ЧтениеXML.Имя = "null" Тогда
		
		Значение = AvroПрочитатьNull(ЧтениеXML);
		
	Иначе
		
		ВызватьИсключение "Неизвестный тип Avro: """+ЧтениеXML.Имя+""".";
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция AvroПрочитатьBoolean(ЧтениеXML)
	
	ЧтениеXML.Прочитать();
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		Значение = XMLЗначение(Тип("Булево"), ЧтениеXML.Значение);
		ЧтениеXML.Прочитать();
	Иначе
		Значение = Ложь;
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	
	Возврат Значение;
	
КонецФункции

Функция AvroПрочитатьInt(ЧтениеXML)
	
	ЧтениеXML.Прочитать();
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		Значение = XMLЗначение(Тип("Число"), ЧтениеXML.Значение);
		ЧтениеXML.Прочитать();
	Иначе
		Значение = 0;
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	
	Возврат Значение;
	
КонецФункции

Функция AvroПрочитатьLong(ЧтениеXML)
	
	ЧтениеXML.Прочитать();
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		Значение = XMLЗначение(Тип("Число"), ЧтениеXML.Значение);
		ЧтениеXML.Прочитать();
	Иначе
		Значение = 0;
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	
	Возврат Значение;
	
КонецФункции

Функция AvroПрочитатьBytes(ЧтениеXML)
	
	ЧтениеXML.Прочитать();
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда		
		ЗначениеСтрока = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
	Иначе
		ЗначениеСтрока = "";
	КонецЕсли;
	
	Значение = ПолучитьДвоичныеДанныеИзBase64Строки(ЗначениеСтрока);
		
	ЧтениеXML.Прочитать();
	
	Возврат Значение;
	
КонецФункции

Функция AvroПрочитатьString(ЧтениеXML)
	
	ЧтениеXML.Прочитать();
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		Значение = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
	Иначе
		Значение = "";
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	
	Возврат Значение;
	
КонецФункции

Функция AvroПрочитатьRecord(ЧтениеXML)
	
	Результат = Новый Структура;
	
	ЧтениеXML.Прочитать(); //потребим начало структуры
	
	Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
		
		Ключ = ЧтениеXML.ПолучитьАтрибут("name");
		
		Значение = AvroПрочитатьЗначение(ЧтениеXML);
		
		Результат.Вставить(Ключ, Значение);
		
	КонецЦикла;
	
	ЧтениеXML.Прочитать(); // потребим конец структуры
		
	Возврат Результат;
	
КонецФункции

Функция AvroПрочитатьEnum(ЧтениеXML)
	
	ЧтениеXML.Прочитать();
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда		
		Значение = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
	Иначе
		Значение = "";
	КонецЕсли;
		
	ЧтениеXML.Прочитать();
	
	Возврат Значение;
	
КонецФункции

Функция AvroПрочитатьArray(ЧтениеXML)
	
	Результат = Новый Массив;
	
	ЧтениеXML.Прочитать(); //потребим начало массива
	
	Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
		
		Значение = AvroПрочитатьЗначение(ЧтениеXML);
		
		Результат.Добавить(Значение);
		
	КонецЦикла;
		
	ЧтениеXML.Прочитать(); // потребим конец массива
	
	Возврат Результат;
	
КонецФункции

Функция AvroПрочитатьMap(ЧтениеXML)
	
	Результат = Новый Соответствие;
	
	ЧтениеXML.Прочитать(); //потребим начало соответствия
	
	Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
		
		Ключ = ЧтениеXML.ПолучитьАтрибут(0);
		
		ЧтениеXML.Прочитать(); // потребим начало элемента значения
		Значение = AvroПрочитатьЗначение(ЧтениеXML);
		ЧтениеXML.Прочитать(); // потребим конец элемента значения
		
		Результат.Вставить(Ключ, Значение);
		
	КонецЦикла;
	
	ЧтениеXML.Прочитать(); // потребим конец соответствия
		
	Возврат Результат;
	
КонецФункции

Функция AvroПрочитатьFixed(ЧтениеXML)
	
	ЧтениеXML.Прочитать();
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда		
		ЗначениеСтрока = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
	Иначе
		ЗначениеСтрока = "";
	КонецЕсли;
	
	Значение = ПолучитьДвоичныеДанныеИзBase64Строки(ЗначениеСтрока);
		
	ЧтениеXML.Прочитать();
	
	Возврат Значение;
	
КонецФункции

Функция AvroПрочитатьDecimal(ЧтениеXML)
	
	ЧтениеXML.Прочитать();
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		Значение = XMLЗначение(Тип("Число"), ЧтениеXML.Значение);
		ЧтениеXML.Прочитать();
	Иначе
		Значение = 0;
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	
	Возврат Значение;
	
КонецФункции

Функция AvroПрочитатьUuid(ЧтениеXML)
	
	ЧтениеXML.Прочитать();
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		Значение = Новый УникальныйИдентификатор(ЧтениеXML.Значение);
		ЧтениеXML.Прочитать();
	Иначе
		Значение = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	
	Возврат Значение;
	
КонецФункции

Функция AvroПрочитатьDate(ЧтениеXML)
	
	ЧтениеXML.Прочитать();
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		Значение = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение);
		ЧтениеXML.Прочитать();
	Иначе
		Значение = '00010101';
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	
	Возврат Значение;
	
КонецФункции

Функция AvroПрочитатьTimestampMillis(ЧтениеXML)
	
	ЧтениеXML.Прочитать();
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		Значение = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение);
		ЧтениеXML.Прочитать();
	Иначе
		Значение = '00010101';
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	
	Возврат Значение;
	
КонецФункции

Функция AvroПрочитатьTimestampMicros(ЧтениеXML)
	
	ЧтениеXML.Прочитать();
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		Значение = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение);
		ЧтениеXML.Прочитать();
	Иначе
		Значение = '00010101';
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	
	Возврат Значение;
	
КонецФункции

Функция AvroПрочитатьNull(ЧтениеXML)
	
	ЧтениеXML.Прочитать();
	
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		ЧтениеXML.Прочитать();
	КонецЕсли;
	
	ЧтениеXML.Прочитать();
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
