
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГруппаId	= Параметры.ГруппаId;
	Тема		= Параметры.Тема;
	Раздел		= Параметры.Раздел;
	Позиция		= Параметры.Позиция;
	Метаданные	= Параметры.Метаданные;
	
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
		
	Результат = Новый Структура;
	Результат.Вставить("ГруппаId", ГруппаId);
	Результат.Вставить("Тема", Тема);
	Результат.Вставить("Раздел", Раздел);
	Результат.Вставить("Позиция", Позиция);
	Результат.Вставить("Метаданные", Метаданные);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры
