// Copyright 2025 Сергей Савельев (serge@savel.pro)
//
// Лицензировано согласно Лицензии Apache, Версия 2.0 ("Лицензия");
// вы можете использовать этот файл только в соответствии с Лицензией.
// Вы можете найти копию Лицензии по адресу
//
// http://www.apache.org/licenses/LICENSE-2.0.
//
// За исключением случаев, когда это регламентировано существующим
// законодательством, или если это не оговорено в письменном соглашении,
// программное обеспечение, распространяемое на условиях данной Лицензии,
// предоставляется "КАК ЕСТЬ", и любые явные или неявные ГАРАНТИИ ОТВЕРГАЮТСЯ.
// Информацию об основных правах и ограничениях, применяемых к определенному
// языку согласно Лицензии, вы можете найти в данной Лицензии.

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГруппаId	= Параметры.ГруппаId;
	Тема		= Параметры.Тема;
	Раздел		= Параметры.Раздел;
	Позиция		= Параметры.Позиция;
	Метаданные	= Параметры.Метаданные;
	
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
		
	Результат = Новый Структура;
	Результат.Вставить("ГруппаId", ГруппаId);
	Результат.Вставить("Тема", Тема);
	Результат.Вставить("Раздел", Раздел);
	Результат.Вставить("Позиция", Позиция);
	Результат.Вставить("Метаданные", Метаданные);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры
