
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Механизм = Элементы.Механизм.СписокВыбора[0].Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПользователя(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Пароль <> ПарольПодтверждение Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Пароль";
		Сообщение.Текст = "Пароль и подтверждение пароля не совпадают.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Пользователь", Пользователь);
	Результат.Вставить("Механизм", Механизм);
	Результат.Вставить("Пароль", Пароль);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры
