// Copyright 2025 Сергей Савельев (serge@savel.pro)
//
// Лицензировано согласно Лицензии Apache, Версия 2.0 ("Лицензия");
// вы можете использовать этот файл только в соответствии с Лицензией.
// Вы можете найти копию Лицензии по адресу
//
// http://www.apache.org/licenses/LICENSE-2.0.
//
// За исключением случаев, когда это регламентировано существующим
// законодательством, или если это не оговорено в письменном соглашении,
// программное обеспечение, распространяемое на условиях данной Лицензии,
// предоставляется "КАК ЕСТЬ", и любые явные или неявные ГАРАНТИИ ОТВЕРГАЮТСЯ.
// Информацию об основных правах и ограничениях, применяемых к определенному
// языку согласно Лицензии, вы можете найти в данной Лицензии.

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Механизм = Элементы.Механизм.СписокВыбора[0].Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПользователя(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Пароль <> ПарольПодтверждение Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Пароль";
		Сообщение.Текст = "Пароль и подтверждение пароля не совпадают.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Пользователь", Пользователь);
	Результат.Вставить("Механизм", Механизм);
	Результат.Вставить("Пароль", Пароль);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры
