// Copyright 2025 Сергей Савельев (serge@savel.pro)
//
// Лицензировано согласно Лицензии Apache, Версия 2.0 ("Лицензия");
// вы можете использовать этот файл только в соответствии с Лицензией.
// Вы можете найти копию Лицензии по адресу
//
// http://www.apache.org/licenses/LICENSE-2.0.
//
// За исключением случаев, когда это регламентировано существующим
// законодательством, или если это не оговорено в письменном соглашении,
// программное обеспечение, распространяемое на условиях данной Лицензии,
// предоставляется "КАК ЕСТЬ", и любые явные или неявные ГАРАНТИИ ОТВЕРГАЮТСЯ.
// Информацию об основных правах и ограничениях, применяемых к определенному
// языку согласно Лицензии, вы можете найти в данной Лицензии.

#Область КлиентскиеПеременные

&НаКлиенте
Перем Admin;
&НаКлиенте
Перем АдаптерПараметры;
&НаКлиенте
Перем АдаптерКодОтвета;
&НаКлиенте
Перем АдаптерОписаниеОшибки;

#КонецОбласти

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Кластер = Константы.КафкаКластерПоУмолчанию.Получить();
	
	ВерсияПодсистемы = КафкаСервер.ВерсияПодсистемы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
			
	Если ЗначениеЗаполнено(Кластер) Тогда
		ПриИзмененииКластера();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
		
	Если Admin <> Неопределено И Не ЗавершениеРаботы Тогда
		Попытка
			AdminRelease();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Кластер

&НаКлиенте
Процедура КластерПриИзменении(Элемент)
	
	ПриИзмененииКластера();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКластера()
	
	УзелСбросить();
	
	ТемыСбросить();
	
	ГруппыСбросить();
	
	КонтрольДоступаСбросить();
	
	ScramПользователиСбросить();
	
	Если Admin <> Неопределено Тогда
		AdminRelease();
	КонецЕсли;
	
	АдаптерПараметры = Неопределено;
		
	Если Не ЗначениеЗаполнено(Кластер) Тогда
		Возврат;
	КонецЕсли;
	
	АдаптерПараметры = ПолучитьПараметрыАдаптера(Кластер);
	
	ВерсияШлюза_ = GetVersionНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки);
	Если ВерсияШлюза_ = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
	ВерсияШлюза = ВерсияШлюза_;
	
	Если Не AdminCreate() Тогда
		Возврат;
	КонецЕсли;
		
	ПодключитьОбработчикОжидания("ПериодическийAdminTouch", 60, Ложь);
		
	КластерОбновить();
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыАдаптера(Кластер)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Кластеры.ШлюзАдрес КАК ШлюзАдрес,
	|	Кластеры.ШлюзПользователь КАК ШлюзПользователь,
	|	Кластеры.ШлюзПароль КАК ШлюзПароль,
	|	Кластеры.ШлюзТаймаут КАК ШлюзТаймаут
	|ИЗ
	|	Справочник.КафкаКластеры КАК Кластеры
	|ГДЕ
	|	Кластеры.Ссылка = &Кластер");
	Запрос.УстановитьПараметр("Кластер", Кластер);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение "Передан некорректный параметр.";
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Результат.Вставить("ШлюзАдрес", Выборка.ШлюзАдрес);
	Результат.Вставить("ШлюзПользователь", Выборка.ШлюзПользователь);
	Результат.Вставить("ШлюзПароль", Выборка.ШлюзПароль.Получить());
	Результат.Вставить("ШлюзТаймаут", Выборка.ШлюзТаймаут);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПериодическийAdminTouch()
	
	Если Admin = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Успех = AdminTouch();
	
	Если Не Успех Тогда
		Если АдаптерКодОтвета = 404 Тогда
			Admin = Неопределено;
		Иначе
			Сообщить(АдаптерОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КластерОбновить()
	
	УзелСбросить();
	
	КонтрольДоступаСбросить();
	
	ScramПользователиСбросить();
	
	clusterDescription = AdminDescribeClusterНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin);
	Если clusterDescription = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	КластерId = clusterDescription.clusterId;
	КластерКонтроллер = clusterDescription.controller.host + ":" + Формат(clusterDescription.controller.port, "ЧН=0; ЧГ=0");
	
	Для Каждого node Из clusterDescription.nodes Цикл
		Строка = ТаблицаУзлы.Добавить();
		Строка.Id = node.id;
		Строка.Сервер = node.host;
		Строка.Порт = node.port;
		Строка.Стойка = node.rack;
	КонецЦикла;
	
	ТаблицаУзлы.Сортировать("Id");
	
КонецПроцедуры

#КонецОбласти

#Область Узлы

&НаКлиенте
Процедура ТаблицаУзлыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УзелОбновить", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область Узел

&НаКлиенте
Процедура УзелСбросить()
	
	УзелКонфигурацияСбросить();
	
	УзелКаталогиСбросить();
	
КонецПроцедуры

&НаКлиенте
Процедура УзелОбновить()
	
	УзелСбросить();
	
	Если Элементы.ГруппаКластерУзлыСтраницы.ТекущаяСтраница = Элементы.ГруппаКластерУзлыКонфигурация Тогда
		УзелКонфигурацияОбновить();
	ИначеЕсли Элементы.ГруппаКластерУзлыСтраницы.ТекущаяСтраница = Элементы.ГруппаКластерУзлыКаталоги Тогда
		УзелКаталогиОбновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УзелКонфигурация

&НаКлиенте
Процедура УзелКонфигурацияКомандаОбновить(Команда)
	
	УзелКонфигурацияОбновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УзелКонфигурацияСбросить()
	
	ТаблицаУзелКонфигурация.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура УзелКонфигурацияОбновить()
	
	УзелКонфигурацияСбросить();
	
	СтрокаУзел = Элементы.ТаблицаУзлы.ТекущиеДанные;
	
	Если СтрокаУзел = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	brokerConfigs = AdminDescribeBrokerConfigsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, СтрокаУзел.Id);
	
	Если brokerConfigs = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Для Каждого configEntry Из brokerConfigs Цикл
		
		Если configEntry.sensitive Тогда
			Продолжить;
		КонецЕсли;
		
		Строка = ТаблицаУзелКонфигурация.Добавить();
		Строка.Имя = configEntry.name;
		Строка.Значение = configEntry.value;
		Строка.ТолькоЧтение = configEntry.readOnly;
		Строка.ПоУмолчанию = configEntry.default;
		
	КонецЦикла;
	
	ТаблицаУзелКонфигурация.Сортировать("Имя");
	
КонецПроцедуры

#КонецОбласти

#Область УзелКаталоги

&НаКлиенте
Процедура УзелКаталогиСбросить()
	
	ТаблицаБрокерКаталоги.Очистить();
	ТаблицаБрокерКаталогиРеплики.Очистить();
	
	СтруктураОтбор = Новый ФиксированнаяСтруктура("Каталог", Строка(Новый УникальныйИдентификатор));
	Элементы.ТаблицаБрокерКаталогиРеплики.ОтборСтрок = СтруктураОтбор;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаБрокерКаталогиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаБрокерКаталоги.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		СтруктураОтбор = Новый ФиксированнаяСтруктура("Каталог", Строка(Новый УникальныйИдентификатор));
		Элементы.ТаблицаБрокерКаталогиРеплики.ОтборСтрок = СтруктураОтбор;
		
		УзелКаталогиОбновить();
		Возврат;
		
	КонецЕсли;
	
	СтруктураОтбор = Новый ФиксированнаяСтруктура("Каталог", ТекущиеДанные.Каталог);
	Элементы.ТаблицаБрокерКаталогиРеплики.ОтборСтрок = СтруктураОтбор;
	
КонецПроцедуры

&НаКлиенте
Процедура УзелКаталогиОбновить()
	
	УзелКаталогиСбросить();
	
	СтрокаУзел = Элементы.ТаблицаУзлы.ТекущиеДанные;
	
	Если СтрокаУзел = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	brokerIds = Новый Массив;
	brokerIds.Добавить(СтрокаУзел.Id);
	
	clusterLogDirs = AdminDescribelogDirsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, brokerIds);
	
	Если clusterLogDirs = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Для Каждого brokerLogDirs Из clusterLogDirs Цикл
		
		Для Каждого logDirDescription Из brokerLogDirs.logDirs Цикл
			
			РазмерКаталог = 0;
			
			СтрокаКаталог = ТаблицаБрокерКаталоги.Добавить();
			СтрокаКаталог.Каталог = logDirDescription.path;
			
			Если logDirDescription.errorMessage <> Неопределено Тогда
				СтрокаКаталог.Ошибка = logDirDescription.errorMessage;
			КонецЕсли;
			
			Для Каждого replicaInfo Из logDirDescription.replicaInfos Цикл
				
				СтрокаРеплика = ТаблицаБрокерКаталогиРеплики.Добавить();
				СтрокаРеплика.Каталог = logDirDescription.path;
				СтрокаРеплика.Тема = replicaInfo.topic;
				СтрокаРеплика.Раздел = replicaInfo.partition;
				СтрокаРеплика.РазмерКБ = Окр(replicaInfo.size / 1000);
				СтрокаРеплика.Отставание = replicaInfo.offsetLag;
				СтрокаРеплика.Будущий = replicaInfo.future;
				
				РазмерКаталог = РазмерКаталог + replicaInfo.size;
				
			КонецЦикла;
			
			СтрокаКаталог.РазмерКБ = Окр(РазмерКаталог / 1000);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаБрокерКаталоги.Сортировать("Каталог");
	ТаблицаБрокерКаталогиРеплики.Сортировать("РазмерКБ Убыв, Каталог, Тема, Раздел");
	
КонецПроцедуры

#КонецОбласти

#Область Темы

&НаКлиенте
Процедура ТаблицаТемыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаТемы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ТемыОбновить();
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ТемыПриАктивизацииСтроки", 0.1, Истина); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТемыПриАктивизацииСтроки()
				
	ТемаОбновить();
					
КонецПроцедуры

&НаКлиенте
Процедура ТемыКомандаОбновить(Команда)
	
	ТемыОбновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТемыСбросить()
	
	ТаблицаТемы.Очистить();
	
	ТемаСбросить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТемыОбновить()
	
	ТемыСбросить();
	
	Если АдаптерПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	topics = AdminListTopicsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin);
	Если topics = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
		
	Для Каждого topic Из topics Цикл
		Строка = ТаблицаТемы.Добавить();
		Строка.Id = topic.id;
		Строка.Имя = topic.name;
		Строка.Внутренняя = topic.internal;
	КонецЦикла;
	
	ТаблицаТемы.Сортировать("Имя");
	
КонецПроцедуры

&НаКлиенте
Процедура ТемыКомандаСоздать(Команда)
	
	Если АдаптерПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму(
			"Обработка.КафкаАдминистрирование.Форма.СозданиеТемы",
			,
			ЭтаФорма,
			,
			,
			,
			Новый ОписаниеОповещения("ТемыСоздатьПриЗакрытииФормы", ЭтаФорма),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ТемыСоздатьПриЗакрытииФормы(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	topicName = РезультатЗакрытия.ИмяТемы;
	
	numPartitions = РезультатЗакрытия.КоличествоРазделов;
	Если numPartitions = 0 Тогда
		numPartitions = Неопределено;
	КонецЕсли;
	
	replicationFactor = РезультатЗакрытия.КоэффициентРепликации;
	Если replicationFactor = 0 Тогда
		replicationFactor = Неопределено;
	КонецЕсли;
	
	result = AdminCreateTopicНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, topicName, numPartitions, replicationFactor);
	Если result = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Строка = ТаблицаТемы.Добавить();
	Строка.Id = result.topicId;
	Строка.Имя = topicName;
	Строка.Внутренняя = Ложь;
	
	ТаблицаТемы.Сортировать("Имя");
	
КонецПроцедуры

&НаКлиенте
Процедура ТемыКомандаУдалить(Команда)
	
	СтрокаТема = Элементы.ТаблицаТемы.ТекущиеДанные;
	
	Если СтрокаТема = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ПоказатьВопрос(
			Новый ОписаниеОповещения("ТемыУдалитьПриОтветеНаВопрос", ЭтаФорма, Новый Структура("ТемаИмя", СтрокаТема.Имя)),
			"Вы действительно хотите удалить тему """ + СтрокаТема.Имя + """?",
			РежимДиалогаВопрос.ДаНет,
			60,
			КодВозвратаДиалога.Нет,
			"Удаление темы",
			КодВозвратаДиалога.Нет
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ТемыУдалитьПриОтветеНаВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТемаИмя = ДополнительныеПараметры.ТемаИмя;
	
	Успех = AdminDeleteTopicНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, ТемаИмя);
	Если Успех = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ТемыОбновить();
	
КонецПроцедуры

#КонецОбласти

#Область Тема

&НаКлиенте
Процедура ТемаКомандаОбновить(Команда)
	
	ТемаОбновить(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаСбросить()
	
	ТемаИмя = Неопределено;
	ТемаId = Неопределено;
	ТемаВнутренняя = Неопределено;
	
	ТаблицаТемаРазделы.Очистить();
	
	ТаблицаТемаРазделыРеплики.Очистить();
	
	ТаблицаТемаРазрешенныеОперации.Очистить();
	
	ТемаКонфигурацияСбросить();
	
	ТемаСмещенияСбросить();
	
	ТемаДанныеСбросить();
	
	СтруктураОтбор = Новый ФиксированнаяСтруктура("Раздел", -9999);
	Элементы.ТаблицаТемаРазделыРеплики.ОтборСтрок = СтруктураОтбор;
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаОбновить(Перечитать = Ложь)
	
	ТемаСбросить();
	
	СтрокаТема = Элементы.ТаблицаТемы.ТекущиеДанные;
	
	Если СтрокаТема = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	topicDescription = Неопределено;
	Если Перечитать Или СтрокаТема.Описание = Неопределено Тогда
		
		topicDescription = AdminDescribeTopicНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, СтрокаТема.Имя);
		Если topicDescription = Неопределено Тогда
			Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
			Возврат;
		КонецЕсли;
		
		СтрокаТема.Описание = topicDescription;
				
	КонецЕсли;
	
	ТемаИмя = СтрокаТема.Описание.name;
	ТемаId = СтрокаТема.Описание.id;
	ТемаВнутренняя = СтрокаТема.Описание.internal;
	
	Для Каждого partitionInfo Из СтрокаТема.Описание.partitions Цикл
		
		СтрокаРаздел = ТаблицаТемаРазделы.Добавить();
		СтрокаРаздел.Раздел = partitionInfo.partition;
		
		Если partitionInfo.leader <> Неопределено Тогда
			СтрокаРаздел.Лидер = partitionInfo.leader.host + ":" + Формат(partitionInfo.leader.port, "ЧН=0; ЧГ=0");
		КонецЕсли;
		
		Для Каждого node Из partitionInfo.replicas Цикл
			
			СтрокаРеплика = ТаблицаТемаРазделыРеплики.Добавить();
			СтрокаРеплика.Раздел = partitionInfo.partition;
			СтрокаРеплика.Id = node.id;
			СтрокаРеплика.Сервер = node.host;
			СтрокаРеплика.Порт = node.port;
			СтрокаРеплика.Стойка = node.rack;
			
			Если partitionInfo.leader <> Неопределено И partitionInfo.leader.id = node.id Тогда
				СтрокаРеплика.Лидер = Истина;
			КонецЕсли;
			
			Если partitionInfo.isr <> Неопределено Тогда
				Для Каждого nodeId Из partitionInfo.isr Цикл
					Если nodeId = node.id Тогда
						СтрокаРеплика.ISR = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если partitionInfo.elr <> Неопределено Тогда
				Для Каждого nodeId Из partitionInfo.elr Цикл
					Если nodeId = node.id Тогда
						СтрокаРеплика.ELR = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если partitionInfo.lastKnownElr <> Неопределено Тогда
				Для Каждого nodeId Из partitionInfo.lastKnownElr Цикл
					Если nodeId = node.id Тогда
						СтрокаРеплика.ПоследнийELR = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если СтрокаТема.Описание.authorizedOperations <> Неопределено Тогда
		Для Каждого Operation Из СтрокаТема.Описание.authorizedOperations Цикл
			СтрокаОперация = ТаблицаТемаРазрешенныеОперации.Добавить();
			СтрокаОперация.Операция = Operation;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаТемаРазделы.Сортировать("Раздел");
	ТаблицаТемаРазделыРеплики.Сортировать("Раздел, Id");
	ТаблицаТемаРазрешенныеОперации.Сортировать("Операция");
	
	Если Элементы.ГруппаТемаСтраницы.ТекущаяСтраница = Элементы.ГруппаТемаКонфигурация Тогда
		ТемаКонфигурацияОбновить();
	ИначеЕсли Элементы.ГруппаТемаСтраницы.ТекущаяСтраница = Элементы.ГруппаТемаСмещения Тогда
		ТемаСмещенияОбновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаКомандаСоздатьРазделы(Команда)
	
	СтрокаТема = Элементы.ТаблицаТемы.ТекущиеДанные;
	
	Если СтрокаТема = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	topicDescription = СтрокаТема.Описание;
	
	ПоказатьВводЧисла(
			Новый ОписаниеОповещения("ТемаСоздатьРазделыПриВводеЧисла", ЭтаФорма, Новый Структура("ТемаИмя", СтрокаТема.Имя)),
			topicDescription.partitions.Количество() + 1,
			"Новое количество разделов",
			10,
			0
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаСоздатьРазделыПриВводеЧисла(Число, ДополнительныеПараметры) Экспорт
	
	Если Число = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТемаИмя = ДополнительныеПараметры.ТемаИмя;
	
	Успех = AdminCreatePartitionsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, ТемаИмя, Число);
	Если Успех = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;

	ТемаОбновить(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТемаРазделыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаТемаРазделы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Раздел = -9999;
	Иначе
		Раздел = ТекущиеДанные.Раздел;
	КонецЕсли;
	СтруктураОтбор = Новый ФиксированнаяСтруктура("Раздел", Раздел);
		
	Элементы.ТаблицаТемаРазделыРеплики.ОтборСтрок = СтруктураОтбор;
	
КонецПроцедуры

#КонецОбласти

#Область ТемаДанные

&НаКлиенте
Процедура ТемаДанныеСбросить()
	
	ТаблицаТемаСообщения = "Новые";
	ТаблицаТемаКоличествоНаРаздел = 50;
	ТаблицаТемаДанные.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаДанныеКомандаПолучитьСообщения(Команда)
	
	ТаблицаТемаДанные.Очистить();
	
	СтрокаТема = Элементы.ТаблицаТемы.ТекущиеДанные;
	
	Если СтрокаТема = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Records = ConsumerGetMessagesНаСервере(Кластер, АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, СтрокаТема.Имя, ТаблицаТемаСообщения, ТаблицаТемаКоличествоНаРаздел);
	Если Records = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Для Каждого Record Из Records Цикл
		СтрокаТемаДанные = ТаблицаТемаДанные.Добавить();
		СтрокаТемаДанные.Раздел = Record.partition;
		СтрокаТемаДанные.Ключ = Record.key;
		СтрокаТемаДанные.Значение = Record.value;
		СтрокаТемаДанные.МоментВремени = ПредставлениеМоментаВремени(Record.timestamp);
		СтрокаТемаДанные.Смещение = Record.offset;
		Для Каждого Header Из Record.headers Цикл
			СтрокаЗаголовок = СтрокаТемаДанные.Заголовки.Добавить();
			СтрокаЗаголовок.Ключ = Header.key;
			СтрокаЗаголовок.Значение = Header.Value;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаТемаДанные.Сортировать("МоментВремени");
	
КонецПроцедуры

#КонецОбласти

#Область ТемаКонфигурация

&НаКлиенте
Процедура ТемаКонфигурацияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаТемаКонфигурация.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ТемаКонфигурацияОбновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаКонфигурацияКомандаОбновить(Команда)
	
	ТемаКонфигурацияОбновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаКонфигурацияСбросить()
	
	ТаблицаТемаКонфигурация.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаКонфигурацияОбновить()
	
	ТемаКонфигурацияСбросить();
	
	СтрокаТема = Элементы.ТаблицаТемы.ТекущиеДанные;
	
	Если СтрокаТема = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	topicConfigs = AdminDescribeTopicConfigsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, СтрокаТема.Имя);
	Если topicConfigs = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
		
	Для Каждого configEntry Из topicConfigs Цикл
		Если configEntry.sensitive Тогда
			Продолжить;
		КонецЕсли;
		Строка = ТаблицаТемаКонфигурация.Добавить();
		Строка.Имя = configEntry.name;
		Строка.Значение = configEntry.value;
		Строка.ТолькоЧтение = configEntry.readOnly;
		Строка.ПоУмолчанию = configEntry.default;
	КонецЦикла;
	
	ТаблицаТемаКонфигурация.Сортировать("Имя");
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаКонфигурацияКомандаИзменить(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаТемаКонфигурация.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьВводСтроки(
			Новый ОписаниеОповещения("ТемаКонфигурацияИзменитьПослеВводаЗначения", ЭтаФорма, Новый Структура("ТекущиеДанные", ТекущиеДанные)),
			ТекущиеДанные.Значение,
			ТекущиеДанные.Имя
	);
		
КонецПроцедуры

&НаКлиенте
Процедура ТемаКонфигурацияИзменитьПослеВводаЗначения(НовоеЗначение, ДопПараметры) Экспорт
	
	Если НовоеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТема = Элементы.ТаблицаТемы.ТекущиеДанные;
	
	ТекущиеДанные = ДопПараметры.ТекущиеДанные;
	
	Результат = AdminAlterTopicConfigНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, СтрокаТема.Имя, ТекущиеДанные.Имя, НовоеЗначение);
	Если Результат = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
		
	ТемаКонфигурацияОбновить();

КонецПроцедуры

&НаКлиенте
Процедура ТемаКонфигурацияКомандаСбросить(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаТемаКонфигурация.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(
			Новый ОписаниеОповещения("ТемаКонфигурацияСброситьПриОтветеНаВопрос", ЭтаФорма, Новый Структура("ТекущиеДанные", ТекущиеДанные)),
			"Вы действительно хотите сбросить значение параметра?",
			РежимДиалогаВопрос.ДаНет,
			60,
			КодВозвратаДиалога.Нет,
			ТекущиеДанные.Имя,
			КодВозвратаДиалога.Нет
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаКонфигурацияСброситьПриОтветеНаВопрос(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТема = Элементы.ТаблицаТемы.ТекущиеДанные;
	
	ТекущиеДанные = ДопПараметры.ТекущиеДанные;
	
	Результат = AdminDeleteTopicConfigНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, СтрокаТема.Имя, ТекущиеДанные.Имя);
	Если Результат = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
		
	ТемаКонфигурацияОбновить();
	
КонецПроцедуры

#КонецОбласти

#Область ТемаСмещения

&НаКлиенте
Процедура ТаблицаТемаСмещенияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаТемаСмещения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ТемаСмещенияОбновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаСмещенияКомандаОбновить(Команда)
	
	ТемаСмещенияОбновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаСмещенияСбросить()
	
	ТаблицаТемаСмещения.Очистить();
	ТаблицаТемаСмещенияКоличество = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаСмещенияОбновить()
	
	ТемаСмещенияСбросить();
	
	СтрокаТема = Элементы.ТаблицаТемы.ТекущиеДанные;
	
	Если СтрокаТема = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТекущаяТема = СтрокаТема.Имя;
	
	ТекущиеРазделы = Новый Массив;
	Для Каждого partitionDescription Из СтрокаТема.Описание.partitions Цикл
		ТекущиеРазделы.Добавить(partitionDescription.partition);
	КонецЦикла;
	
	СмещенияТемы = ТемаСмещенияОбновитьНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, ТекущаяТема, ТекущиеРазделы);
	
	Если СмещенияТемы = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из СмещенияТемы Цикл
		
		СмещенияРаздела = КлючЗначение.Значение;
		
		Строка = ТаблицаТемаСмещения.Добавить();
		Строка.Раздел = КлючЗначение.Ключ;
		Строка.НачальноеСмещение = СмещенияРаздела.НачальноеСмещение;
		Строка.НачальноеСмещениеМоментВремени = ПредставлениеМоментаВремени(СмещенияРаздела.НачальноеСмещениеМоментВремени);
		Строка.КонечноеСмещение = СмещенияРаздела.КонечноеСмещение;
		Строка.КонечноеСмещениеМоментВремени = ПредставлениеМоментаВремени(СмещенияРаздела.КонечноеСмещениеМоментВремени);
		
		Строка.Количество = Строка.КонечноеСмещение - Строка.НачальноеСмещение;
		ТаблицаТемаСмещенияКоличество = ТаблицаТемаСмещенияКоличество + Строка.Количество;
		
	КонецЦикла;
		
	ТаблицаТемаСмещения.Сортировать("Раздел");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТемаСмещенияОбновитьНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, Тема, Разделы)
	
	Partitions = Новый Массив;
	Для Каждого Раздел Из Разделы Цикл
		Partitions.Добавить(Новый Структура("topic, partition", Тема, Раздел));
	КонецЦикла;
	
	earliestOffsets = AdminListEarliestOffsets(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, Partitions);
	Если earliestOffsets = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	latestOffsets = AdminListLatestOffsets(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, Partitions);
	Если latestOffsets = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Соответствие;
	
	Для Каждого offsetListing Из earliestOffsets Цикл
		
		Смещения = Результат.Получить(offsetListing.partition);
		
		Если Смещения = Неопределено Тогда
			Смещения = Новый Структура;
			Результат.Вставить(offsetListing.partition, Смещения);
		КонецЕсли;
		
		Смещения.Вставить("НачальноеСмещение", offsetListing.offset);
		Смещения.Вставить("НачальноеСмещениеМоментВремени", offsetListing.timestamp);
		
	КонецЦикла;
	
	Для Каждого offsetListing Из latestOffsets Цикл
		
		Смещения = Результат.Получить(offsetListing.partition);
		
		Если Смещения = Неопределено Тогда
			Смещения = Новый Структура;
			Результат.Вставить(offsetListing.partition, Смещения);
		КонецЕсли;
		
		Смещения.Вставить("КонечноеСмещение", offsetListing.offset);
		Смещения.Вставить("КонечноеСмещениеМоментВремени", offsetListing.timestamp);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Групппы

&НаКлиенте
Процедура ГруппыКомандаОбновить(Команда)
	
	ГруппыОбновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыСбросить()
	
	ТаблицаГруппы.Очистить();
	
	ГруппаClassicСбросить();
	
	ГруппаConsumerСбросить();
	
	ГруппаShareСбросить();
	
	ГруппаStreamsСбросить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыОбновить()
	
	ГруппыСбросить();
	
	Если АдаптерПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	groups = AdminListGroupsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin);
	Если groups = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Для Каждого groupInfo Из groups Цикл
		
		Строка = ТаблицаГруппы.Добавить();
		Строка.Id = groupInfo.groupId;		
		Если groupInfo.type <> Неопределено Тогда
			Строка.Тип = groupInfo.type;
		КонецЕсли;
		Строка.Протокол = groupInfo.protocol;
		Если groupInfo.groupState <> Неопределено Тогда
			Строка.Состояние = groupInfo.groupState;
		КонецЕсли;
		Строка.ЭтоПростаяГруппаПолучателей = groupInfo.simpleConsumerGroup;
		Строка.Данные = Новый Структура;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаГруппыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаГруппы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Элементы.НадписьНеизвестнаяГруппа.Заголовок = "";;
		
		Элементы.ГруппаГруппа.ТекущаяСтраница = Элементы.ГруппаГруппаНеизвестно;
		
		ГруппыОбновить();
		
	Иначе
		
		ПодключитьОбработчикОжидания("ГруппыПриАктивизацииСтроки", 0.1, Истина); 
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПриАктивизацииСтроки()
	
	ТекущиеДанные = Элементы.ТаблицаГруппы.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И СтрСравнить(ТекущиеДанные.Тип, "CLASSIC") = 0 Тогда
		
		ГруппаClassicОбновить();
		
		Элементы.ГруппаГруппа.ТекущаяСтраница = Элементы.ГруппаГруппаClassic;
		
	ИначеЕсли ТекущиеДанные <> Неопределено И СтрСравнить(ТекущиеДанные.Тип, "CONSUMER") = 0 Тогда
		
		ГруппаConsumerОбновить();
		
		Элементы.ГруппаГруппа.ТекущаяСтраница = Элементы.ГруппаГруппаConsumer;
		
	ИначеЕсли ТекущиеДанные <> Неопределено И СтрСравнить(ТекущиеДанные.Тип, "SHARE") = 0 Тогда
		
		ГруппаShareОбновить();
		
		Элементы.ГруппаГруппа.ТекущаяСтраница = Элементы.ГруппаГруппаShare;
		
	ИначеЕсли ТекущиеДанные <> Неопределено И СтрСравнить(ТекущиеДанные.Тип, "STREAMS") = 0 Тогда
		
		ГруппаStreamsОбновить();
		
		Элементы.ГруппаГруппа.ТекущаяСтраница = Элементы.ГруппаГруппаStreams;
		
	Иначе
		
		Если ТекущиеДанные = Неопределено Тогда
			Элементы.НадписьНеизвестнаяГруппа.Заголовок = "";
		Иначе
			Элементы.НадписьНеизвестнаяГруппа.Заголовок = "Неизвестный тип группы: """ + ТекущиеДанные.Тип + """.";
		КонецЕсли;
		
		Элементы.ГруппаГруппа.ТекущаяСтраница = Элементы.ГруппаГруппаНеизвестно;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ГруппыКомандаУдалить(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаГруппы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ГруппаId", ТекущиеДанные.Id);
	ПараметрыОповещения.Вставить("ГруппаТип", ТекущиеДанные.Тип);
	
	ПоказатьВопрос(
			Новый ОписаниеОповещения("ГруппыУдалитьПриОтветеНаВопрос", ЭтаФорма, ПараметрыОповещения),
			"Вы действительно хотите удалить " + НРег(ТекущиеДанные.Тип) + "-группу """ + ТекущиеДанные.Id + """?",
			РежимДиалогаВопрос.ДаНет,
			60,
			КодВозвратаДиалога.Нет,
			"Удаление " + НРег(ТекущиеДанные.Тип) + "-группы.",
			КодВозвратаДиалога.Нет
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыУдалитьПриОтветеНаВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаId = ДополнительныеПараметры.ГруппаId;
	ГруппаТип = ДополнительныеПараметры.ГруппаТип;
	
	Если СтрСравнить(ГруппаТип, "CLASSIC") = 0 Тогда
		
		Успех = AdminDeleteConsumerGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, ГруппаId);
		
	ИначеЕсли СтрСравнить(ГруппаТип, "COMSUMER") = 0 Тогда
		
		Успех = AdminDeleteConsumerGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, ГруппаId);
		
	ИначеЕсли СтрСравнить(ГруппаТип, "SHARE") = 0 Тогда
		
		Успех = AdminDeleteShareGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, ГруппаId);
		
	ИначеЕсли СтрСравнить(ГруппаТип, "STREAMS") = 0 Тогда
		
		Успех = AdminDeleteStreamsGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, ГруппаId);
		
	Иначе
		
		ВызватьИсключение "Неожиданный тип группы: """ + ГруппаТип + """.";
		
	КонецЕсли;
	
	Если Успех = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ГруппыОбновить();
	
КонецПроцедуры

#КонецОбласти

#Область Групппа

&НаКлиенте
Процедура ГруппаКомандаОбновить(Команда)
	
	ГруппаОбновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОбновить()
	
	СтрокаГруппа = Элементы.ТаблицаГруппы.ТекущиеДанные;
	
	Если СтрокаГруппа = Неопределено Тогда
		ВызватьИсключение "Неожиданное состояние.";
	КонецЕсли;
	
	Если СтрСравнить(СтрокаГруппа.Тип, "CLASSIC") = 0 Тогда
		
		ГруппаClassicОбновить(Истина);
		
	ИначеЕсли СтрСравнить(СтрокаГруппа.Тип, "CONSUMER") = 0 Тогда
		
		ГруппаConsumerОбновить(Истина);
		
	ИначеЕсли СтрСравнить(СтрокаГруппа.Тип, "SHARE") = 0 Тогда
		
		ГруппаShareОбновить(Истина);		
		
	ИначеЕсли СтрСравнить(СтрокаГруппа.Тип, "STREAMS") = 0 Тогда
		
		ГруппаStreamsОбновить(Истина);
		
	Иначе
		
		ВызватьИсключение "Неожиданное состояние.";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаClassicСбросить()
	
	ГруппаClassicId = Неопределено;
	ГруппаClassicСостояние = Неопределено;
	ГруппаClassicПротокол = Неопределено;
	ГруппаClassicПротоколДанные = Неопределено;
	ГруппаClassicКоординатор = Неопределено;
	ГруппаClassicЭтоПростаяГруппаПолучателей = Неопределено;
	
	ТаблицаГруппаУчастники.Очистить();
	ТаблицаГруппаУчастникиНазначение.Очистить();
	ТаблицаГруппаУчастникиЦелевоеНазначение.Очистить();
	ТаблицаГруппаРазрешенныеОперации.Очистить();
	
	СтруктураОтбор = Новый ФиксированнаяСтруктура("ПолучательId", Строка(Новый УникальныйИдентификатор));
	Элементы.ТаблицаГруппаClassicУчастникиНазначение.ОтборСтрок = СтруктураОтбор;
	
	ГруппаConsumerПозицииСбросить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаClassicОбновить(Перечитать = Ложь)
	
	ГруппаClassicСбросить();

	СтрокаГруппа = Элементы.ТаблицаГруппы.ТекущиеДанные;
	
	Если СтрокаГруппа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрСравнить(СтрокаГруппа.Тип, "CLASSIC") <> 0 Тогда
		ВызватьИсключение "Неожиданное состояние.";
	КонецЕсли;
	
	groupDescription = Неопределено;
	
	Если Перечитать Или Не СтрокаГруппа.Данные.Свойство("description", groupDescription) Тогда
		
		groupDescription = AdminDescribeClassicGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, СтрокаГруппа.Id, Истина);
		
		Если groupDescription = Неопределено Тогда
			Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
			Возврат;
		КонецЕсли;
		
		СтрокаГруппа.Данные.Вставить("description", groupDescription);
		
	КонецЕсли;
	
	ГруппаClassicId = groupDescription.groupId;
	ГруппаClassicСостояние = groupDescription.state;
	ГруппаClassicПротокол = groupDescription.protocol;
	ГруппаClassicПротоколДанные = groupDescription.protocolData;
	Если groupDescription.coordinator <> Неопределено Тогда
		ГруппаClassicКоординатор = groupDescription.coordinator.host + ":" + Формат(groupDescription.coordinator.port, "ЧН=0; ЧГ=0");
	КонецЕсли;
	ГруппаClassicЭтоПростаяГруппаПолучателей = groupDescription.simpleConsumerGroup;
	
	Для Каждого memberDescription Из groupDescription.members Цикл
		
		СтрокаУчастник = ТаблицаГруппаУчастники.Добавить();
		СтрокаУчастник.ПолучательId = memberDescription.consumerId;
		Если memberDescription.groupInstanceId <> Неопределено Тогда
			СтрокаУчастник.ЭкземплярId = memberDescription.groupInstanceId;
		КонецЕсли;
		СтрокаУчастник.КлиентId = memberDescription.clientId;
		СтрокаУчастник.Компьютер = memberDescription.host;
		Если memberDescription.memberEpoch <> Неопределено Тогда
			СтрокаУчастник.Поколение = Формат(memberDescription.memberEpoch, "ЧН=0");
		КонецЕсли;
		Если memberDescription.upgraded <> Неопределено Тогда
			СтрокаУчастник.Обновлен = memberDescription.upgraded;
		КонецЕсли;
		
		Для Каждого topicPartition Из memberDescription.assignment Цикл
			СтрокаНазначение = ТаблицаГруппаУчастникиНазначение.Добавить();
			СтрокаНазначение.ПолучательId = СтрокаУчастник.ПолучательId;
			СтрокаНазначение.Тема = topicPartition.topic;
			СтрокаНазначение.Раздел = topicPartition.partition;
		КонецЦикла;			
		
		Если memberDescription.targetAssignment <> Неопределено Тогда
			Для Каждого topicPartition Из memberDescription.targetAssignment Цикл
				СтрокаНазначение = ТаблицаГруппаУчастникиЦелевоеНазначение.Добавить();
				СтрокаНазначение.ПолучательId = СтрокаУчастник.ПолучательId;
				СтрокаНазначение.Тема = topicPartition.topic;
				СтрокаНазначение.Раздел = topicPartition.partition;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Если groupDescription.authorizedOperations <> Неопределено Тогда
		Для Каждого aclOperation Из groupDescription.authorizedOperations Цикл
			СтрокаОперация = ТаблицаГруппаРазрешенныеОперации.Добавить();
			СтрокаОперация.Операция = aclOperation;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаГруппаУчастники.Сортировать("ПолучательId");
	ТаблицаГруппаУчастникиНазначение.Сортировать("ПолучательId, Тема, Раздел");
	ТаблицаГруппаУчастникиЦелевоеНазначение.Сортировать("ПолучательId, Тема, Раздел");
	ТаблицаГруппаРазрешенныеОперации.Сортировать("Операция");	
	
	Если Элементы.ГруппаГруппаClassicСтраницы.ТекущаяСтраница = Элементы.ГруппаГруппаClassicПозиции Тогда
		ГруппаConsumerПозицииЗаполнить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаConsumerСбросить()
	
	ГруппаConsumerId = Неопределено;
	ГруппаConsumerТип = Неопределено;
	ГруппаConsumerСостояние = Неопределено;
	ГруппаConsumerКоординатор = Неопределено;
	ГруппаConsumerНазначениеРазделов = Неопределено;
	ГруппаConsumerПоколение = Неопределено;
	ГруппаConsumerПоколениеЦелевогоНазначения = Неопределено;
	ГруппаConsumerЭтоПростаяГруппаПолучателей = Неопределено;
	
	ТаблицаГруппаУчастники.Очистить();
	ТаблицаГруппаУчастникиНазначение.Очистить();
	ТаблицаГруппаУчастникиЦелевоеНазначение.Очистить();
	ТаблицаГруппаРазрешенныеОперации.Очистить();
	
	СтруктураОтбор = Новый ФиксированнаяСтруктура("ПолучательId", Строка(Новый УникальныйИдентификатор));
	Элементы.ТаблицаГруппаConsumerУчастникиНазначение.ОтборСтрок = СтруктураОтбор;
	Элементы.ТаблицаГруппаConsumerУчастникиЦелевоеНазначение.ОтборСтрок = СтруктураОтбор;
	
	ГруппаConsumerПозицииСбросить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаConsumerОбновить(Перечитать = Ложь)
	
	ГруппаConsumerСбросить();

	СтрокаГруппа = Элементы.ТаблицаГруппы.ТекущиеДанные;
	
	Если СтрокаГруппа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрСравнить(СтрокаГруппа.Тип, "CONSUMER") <> 0 Тогда
		ВызватьИсключение "Неожиданное состояние.";
	КонецЕсли;
	
	groupDescription = Неопределено;
	
	Если Перечитать Или Не СтрокаГруппа.Данные.Свойство("description", groupDescription) Тогда
		
		groupDescription = AdminDescribeConsumerGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, СтрокаГруппа.Id, Истина);
		
		Если groupDescription = Неопределено Тогда
			Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
			Возврат;
		КонецЕсли;
		
		СтрокаГруппа.Данные.Вставить("description", groupDescription);
		
	КонецЕсли;
	
	ГруппаConsumerId = groupDescription.groupId;
	ГруппаConsumerТип = groupDescription.type;
	ГруппаConsumerСостояние = groupDescription.groupState;
	Если groupDescription.coordinator <> Неопределено Тогда
		ГруппаConsumerКоординатор = groupDescription.coordinator.host + ":" + Формат(groupDescription.coordinator.port, "ЧН=0; ЧГ=0");
	КонецЕсли;
	ГруппаConsumerНазначениеРазделов = groupDescription.partitionAssignor;
	Если groupDescription.groupEpoch <> Неопределено Тогда
		ГруппаConsumerПоколение = Формат(groupDescription.groupEpoch, "ЧН=0");
	КонецЕсли;
	Если groupDescription.targetAssignmentEpoch <> Неопределено Тогда
		ГруппаConsumerПоколениеЦелевогоНазначения = Формат(groupDescription.targetAssignmentEpoch, "ЧН=0");
	КонецЕсли;
	ГруппаConsumerЭтоПростаяГруппаПолучателей = groupDescription.simpleConsumerGroup;
	
	Для Каждого memberDescription Из groupDescription.members Цикл
		
		СтрокаУчастник = ТаблицаГруппаУчастники.Добавить();
		СтрокаУчастник.ПолучательId = memberDescription.consumerId;
		Если memberDescription.groupInstanceId <> Неопределено Тогда
			СтрокаУчастник.ЭкземплярId = memberDescription.groupInstanceId;
		КонецЕсли;
		СтрокаУчастник.КлиентId = memberDescription.clientId;
		СтрокаУчастник.Компьютер = memberDescription.host;
		Если memberDescription.memberEpoch <> Неопределено Тогда
			СтрокаУчастник.Поколение = Формат(memberDescription.memberEpoch, "ЧН=0");
		КонецЕсли;
		Если memberDescription.upgraded <> Неопределено Тогда
			СтрокаУчастник.Обновлен = memberDescription.upgraded;
		КонецЕсли;
		
		Для Каждого topicPartition Из memberDescription.assignment Цикл
			СтрокаНазначение = ТаблицаГруппаУчастникиНазначение.Добавить();
			СтрокаНазначение.ПолучательId = СтрокаУчастник.ПолучательId;
			СтрокаНазначение.Тема = topicPartition.topic;
			СтрокаНазначение.Раздел = topicPartition.partition;
		КонецЦикла;			
		
		Если memberDescription.targetAssignment <> Неопределено Тогда
			Для Каждого topicPartition Из memberDescription.targetAssignment Цикл
				СтрокаНазначение = ТаблицаГруппаУчастникиЦелевоеНазначение.Добавить();
				СтрокаНазначение.ПолучательId = СтрокаУчастник.ПолучательId;
				СтрокаНазначение.Тема = topicPartition.topic;
				СтрокаНазначение.Раздел = topicPartition.partition;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Если groupDescription.authorizedOperations <> Неопределено Тогда
		Для Каждого aclOperation Из groupDescription.authorizedOperations Цикл
			СтрокаОперация = ТаблицаГруппаРазрешенныеОперации.Добавить();
			СтрокаОперация.Операция = aclOperation;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаГруппаУчастники.Сортировать("ПолучательId");
	ТаблицаГруппаУчастникиНазначение.Сортировать("ПолучательId, Тема, Раздел");
	ТаблицаГруппаУчастникиЦелевоеНазначение.Сортировать("ПолучательId, Тема, Раздел");
	ТаблицаГруппаРазрешенныеОперации.Сортировать("Операция");	
	
	Если Элементы.ГруппаГруппаConsumerСтраницы.ТекущаяСтраница = Элементы.ГруппаГруппаConsumerПозиции Тогда
		ГруппаConsumerПозицииЗаполнить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаShareСбросить()
	
	ГруппаShareId = Неопределено;
	ГруппаShareСостояние = Неопределено;
	ГруппаShareКоординатор = Неопределено;
	ГруппаShareПоколение = Неопределено;
	ГруппаShareПоколениеЦелевогоНазначения = Неопределено;
	
	ТаблицаГруппаShareУчастники.Очистить();
	ТаблицаГруппаУчастникиНазначение.Очистить();
	ТаблицаГруппаРазрешенныеОперации.Очистить();
	
	СтруктураОтбор = Новый ФиксированнаяСтруктура("ПолучательId", Строка(Новый УникальныйИдентификатор));
	Элементы.ТаблицаГруппаShareУчастникиНазначение.ОтборСтрок = СтруктураОтбор;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаShareОбновить(Перечитать = Ложь)
	
	ГруппаShareСбросить();
	
	СтрокаГруппа = Элементы.ТаблицаГруппы.ТекущиеДанные;
	
	Если СтрокаГруппа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрСравнить(СтрокаГруппа.Тип, "SHARE") <> 0 Тогда
		ВызватьИсключение "Неожиданное состояние.";
	КонецЕсли;
	
	groupDescription = Неопределено;
	
	Если Перечитать Или Не СтрокаГруппа.Данные.Свойство("description", groupDescription) Тогда
		
		groupDescription = AdminDescribeShareGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, СтрокаГруппа.Id, Истина);
		
		Если groupDescription = Неопределено Тогда
			Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
			Возврат;
		КонецЕсли;
		
		СтрокаГруппа.Данные.Вставить("description", groupDescription);
		
	КонецЕсли;
	
	ГруппаShareId = groupDescription.groupId;
	ГруппаShareСостояние = groupDescription.groupState;
	Если groupDescription.coordinator <> Неопределено Тогда
		ГруппаShareКоординатор = groupDescription.coordinator.host + ":" + Формат(groupDescription.coordinator.port, "ЧН=0; ЧГ=0");
	КонецЕсли;
	Если groupDescription.groupEpoch <> Неопределено Тогда
		ГруппаShareПоколение = Формат(groupDescription.groupEpoch, "ЧН=0");
	КонецЕсли;
	Если groupDescription.targetAssignmentEpoch <> Неопределено Тогда
		ГруппаShareПоколениеЦелевогоНазначения = Формат(groupDescription.targetAssignmentEpoch, "ЧН=0");
	КонецЕсли;
	
	Для Каждого memberDescription Из groupDescription.members Цикл
		
		СтрокаУчастник = ТаблицаГруппаShareУчастники.Добавить();
		СтрокаУчастник.ПолучательId = memberDescription.consumerId;
		СтрокаУчастник.КлиентId = memberDescription.clientId;
		СтрокаУчастник.Компьютер = memberDescription.host;
		Если memberDescription.memberEpoch <> Неопределено Тогда
			СтрокаУчастник.Поколение = Формат(memberDescription.memberEpoch, "ЧН=0");
		КонецЕсли;
		
		Для Каждого topicPartition Из memberDescription.assignment Цикл
			СтрокаНазначение = ТаблицаГруппаУчастникиНазначение.Добавить();
			СтрокаНазначение.ПолучательId = СтрокаУчастник.ПолучательId;
			СтрокаНазначение.Тема = topicPartition.topic;
			СтрокаНазначение.Раздел = topicPartition.partition;
		КонецЦикла;			
		
	КонецЦикла;
	
	Если groupDescription.authorizedOperations <> Неопределено Тогда
		Для Каждого aclOperation Из groupDescription.authorizedOperations Цикл
			СтрокаОперация = ТаблицаГруппаРазрешенныеОперации.Добавить();
			СтрокаОперация.Операция = aclOperation;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаГруппаShareУчастники.Сортировать("ПолучательId");
	ТаблицаГруппаУчастникиНазначение.Сортировать("ПолучательId, Тема, Раздел");
	ТаблицаГруппаРазрешенныеОперации.Сортировать("Операция");	
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаStreamsСбросить()
	
	ГруппаStreamsId = Неопределено;
	ГруппаStreamsСостояние = Неопределено;
	ГруппаStreamsКоординатор = Неопределено;
	ГруппаStreamsПоколение = Неопределено;
	ГруппаStreamsПоколениеЦелевогоНазначения = Неопределено;
	ГруппаStreamsПоколениеТопологии = Неопределено;
	
	ТаблицаГруппаStreamsУчастники.Очистить();
	ТаблицаГруппаРазрешенныеОперации.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаStreamsОбновить(Перечитать = Ложь)
	
	ГруппаStreamsСбросить();
		
	СтрокаГруппа = Элементы.ТаблицаГруппы.ТекущиеДанные;
	
	Если СтрокаГруппа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрСравнить(СтрокаГруппа.Тип, "STREAMS") <> 0 Тогда
		ВызватьИсключение "Неожиданное состояние.";
	КонецЕсли;
	
	groupDescription = Неопределено;
	
	Если Перечитать Или Не СтрокаГруппа.Данные.Свойство("description", groupDescription) Тогда
		
		groupDescription = AdminDescribeStreamsGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, СтрокаГруппа.Id, Истина);
		
		Если groupDescription = Неопределено Тогда
			Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
			Возврат;
		КонецЕсли;
		
		СтрокаГруппа.Данные.Вставить("description", groupDescription);
		
	КонецЕсли;
	
	ГруппаStreamsId = groupDescription.groupId;
	ГруппаStreamsСостояние = groupDescription.groupState;
	Если groupDescription.coordinator <> Неопределено Тогда
		ГруппаStreamsКоординатор = groupDescription.coordinator.host + ":" + Формат(groupDescription.coordinator.port, "ЧН=0; ЧГ=0");
	КонецЕсли;
	Если groupDescription.groupEpoch <> Неопределено Тогда
		ГруппаStreamsПоколение = Формат(groupDescription.groupEpoch, "ЧН=0");
	КонецЕсли;
	Если groupDescription.targetAssignmentEpoch <> Неопределено Тогда
		ГруппаStreamsПоколениеЦелевогоНазначения = Формат(groupDescription.targetAssignmentEpoch, "ЧН=0");
	КонецЕсли;
	Если groupDescription.topologyEpoch <> Неопределено Тогда
		ГруппаStreamsПоколениеТопологии = Формат(groupDescription.topologyEpoch, "ЧН=0");
	КонецЕсли;
	
	Для Каждого memberDescription Из groupDescription.members Цикл
		
		СтрокаУчастник = ТаблицаГруппаStreamsУчастники.Добавить();
		СтрокаУчастник.УчастникId = memberDescription.memberId;
		Если memberDescription.memberEpoch <> Неопределено Тогда
			СтрокаУчастник.Поколение = Формат(memberDescription.memberEpoch, "ЧН=0");
		КонецЕсли;
		СтрокаУчастник.КлиентId = memberDescription.clientId;
		СтрокаУчастник.Компьютер = memberDescription.clientHost;
		Если memberDescription.instanceId <> Неопределено Тогда
			СтрокаУчастник.ЭкземплярId = memberDescription.instanceId;
		КонецЕсли;
		СтрокаУчастник.ПроцессId = memberDescription.processId;
		СтрокаУчастник.ЭтоКлассическийУчастник = memberDescription.isClassic;
				
	КонецЦикла;
	
	Если groupDescription.authorizedOperations <> Неопределено Тогда
		Для Каждого aclOperation Из groupDescription.authorizedOperations Цикл
			СтрокаОперация = ТаблицаГруппаРазрешенныеОперации.Добавить();
			СтрокаОперация.Операция = aclOperation;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаГруппаStreamsУчастники.Сортировать("ПолучательId");
	ТаблицаГруппаРазрешенныеОперации.Сортировать("Операция");	
	
КонецПроцедуры

#КонецОбласти

#Область ГруппаУчастники

&НаКлиенте
Процедура ТаблицаГруппаClassicУчастникиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаГруппаClassicУчастники.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПолучательId_ = Строка(Новый УникальныйИдентификатор);
	Иначе
		ПолучательId_ = ТекущиеДанные.ПолучательId;
	КонецЕсли;
	СтруктураОтбор = Новый ФиксированнаяСтруктура("ПолучательId", ПолучательId_);
		
	Элементы.ТаблицаГруппаClassicУчастникиНазначение.ОтборСтрок = СтруктураОтбор;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаГруппаConsumerУчастникиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаГруппаConsumerУчастники.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПолучательId_ = Строка(Новый УникальныйИдентификатор);
	Иначе
		ПолучательId_ = ТекущиеДанные.ПолучательId;
	КонецЕсли;
	СтруктураОтбор = Новый ФиксированнаяСтруктура("ПолучательId", ПолучательId_);
		
	Элементы.ТаблицаГруппаConsumerУчастникиНазначение.ОтборСтрок = СтруктураОтбор;
	Элементы.ТаблицаГруппаConsumerУчастникиЦелевоеНазначение.ОтборСтрок = СтруктураОтбор;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаГруппаShareУчастникиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаГруппаShareУчастники.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПолучательId_ = Строка(Новый УникальныйИдентификатор);
	Иначе
		ПолучательId_ = ТекущиеДанные.ПолучательId;
	КонецЕсли;
	СтруктураОтбор = Новый ФиксированнаяСтруктура("ПолучательId", ПолучательId_);
		
	Элементы.ТаблицаГруппаShareУчастникиНазначение.ОтборСтрок = СтруктураОтбор;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаClassicУчастникиУдалить(Команда)
	
	ВыделенныеСтроки = Элементы.ТаблицаГруппаClassicУчастники.ВыделенныеСтроки;
	
	ГруппаConsumerУдалитьУчастников(ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаCоnsumerУчастникиУдалить(Команда)
	
	ВыделенныеСтроки = Элементы.ТаблицаГруппаConsumerУчастники.ВыделенныеСтроки;
	
	ГруппаConsumerУдалитьУчастников(ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаConsumerУдалитьУчастников(ВыделенныеСтроки)
	
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаГруппа = Элементы.ТаблицаГруппы.ТекущиеДанные;
	
	Если СтрокаГруппа = Неопределено Или (СтрСравнить(СтрокаГруппа.Тип, "CLASSIC") <> 0 И СтрСравнить(СтрокаГруппа.Тип, "CONSUMER") <> 0) Тогда
		ВызватьИсключение "Неожиданное состояние.";
	КонецЕсли;
	
	Участники = Новый Массив;
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		Строка = ТаблицаГруппаУчастники.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ЗначениеЗаполнено(Строка.ЭкземплярId) Тогда
			Участники.Добавить(Строка.ЭкземплярId);
		КонецЕсли;
	КонецЦикла;
	
	Если Участники.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ГруппаId", СтрокаГруппа.Id);
	ПараметрыФормы.Вставить("УдалитьВсех", Ложь);
	ПараметрыФормы.Вставить("Участники", Участники);
	
	ОткрытьФорму(
			"Обработка.КафкаАдминистрирование.Форма.УдалениеУчастниковГруппы",
			ПараметрыФормы,
			ЭтаФорма,
			,
			,
			,
			Новый ОписаниеОповещения("ГруппаConsumerУдалитьУчастниковПриЗакрытииФормы", ЭтаФорма),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаConsumerУдалитьУчастниковПриЗакрытииФормы(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатЗакрытия.Участники <> Неопределено И РезультатЗакрытия.Участники.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	GroupId = РезультатЗакрытия.ГруппаId;
	
	Members = РезультатЗакрытия.Участники;
	
	Если Не ПустаяСтрока(РезультатЗакрытия.Причина) Тогда
		Reason = РезультатЗакрытия.Причина;
	КонецЕсли;
	
	Успех = AdminRemoveMembersFromConsumerGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, GroupId, Members, Reason);
	
	Если Успех = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ГруппаОбновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаClassicУчастникиОчистить(Команда)
	
	ГруппаConsumerОчиститьУчастников();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаConsumerУчастникиОчистить(Команда)
	
	ГруппаConsumerОчиститьУчастников();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаConsumerОчиститьУчастников()
	
	СтрокаГруппа = Элементы.ТаблицаГруппы.ТекущиеДанные;
	
	Если СтрокаГруппа = Неопределено Или (СтрСравнить(СтрокаГруппа.Тип, "CLASSIC") <> 0 И СтрСравнить(СтрокаГруппа.Тип, "CONSUMER") <> 0) Тогда
		ВызватьИсключение "Неожиданное состояние.";
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ГруппаId", СтрокаГруппа.Id);
	ПараметрыФормы.Вставить("УдалитьВсех", Истина);
	
	ОткрытьФорму(
			"Обработка.КафкаАдминистрирование.Форма.УдалениеУчастниковГруппы",
			ПараметрыФормы,
			ЭтаФорма,
			,
			,
			,
			Новый ОписаниеОповещения("ГруппаConsumerУдалитьУчастниковПриЗакрытииФормы", ЭтаФорма),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

#КонецОбласти

#Область ГруппаПозиции

&НаКлиенте
Процедура ТаблицаГруппаClassicПозицииПриАктивизацииСтроки(Элемент)
		
	ТекущаяСтрока = Элементы.ТаблицаГруппаClassicПозиции.ТекущаяСтрока;
	
	Если ТекущаяСтрока = Неопределено Тогда
		
		ГруппаConsumerПозицииЗаполнить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаClassicПозицииОбновить(Команда)
	
	ГруппаConsumerПозицииЗаполнить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаConsumerПозицииОбновить(Команда)
	
	ГруппаConsumerПозицииЗаполнить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаConsumerПозицииСбросить()
	
	ТаблицаГруппаПозиции.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаConsumerПозицииЗаполнить()
	
	ГруппаConsumerПозицииСбросить();
	
	СтрокаГруппа = Элементы.ТаблицаГруппы.ТекущиеДанные;
	
	Если СтрокаГруппа = Неопределено Или (СтрСравнить(СтрокаГруппа.Тип, "CLASSIC") <> 0 И СтрСравнить(СтрокаГруппа.Тип, "CONSUMER") <> 0) Тогда
		ВызватьИсключение "Неожиданное состояние.";
	КонецЕсли;
	
	groupOffsets = AdminListConsumerGroupOffsetsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, СтрокаГруппа.Id);
			
	Если groupOffsets = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Partitions = Новый Массив;
	ТаблицаГруппаПозицииОтставание_ = 0;
	
	Для Каждого topicPartitionOffsetMetadata Из groupOffsets Цикл
		
		СтрокаГруппаПозиции = ТаблицаГруппаПозиции.Добавить();
		
		Если topicPartitionOffsetMetadata.topic <> Неопределено Тогда
			СтрокаГруппаПозиции.Тема = topicPartitionOffsetMetadata.topic;
		КонецЕсли;
		
		Если topicPartitionOffsetMetadata.partition <> Неопределено Тогда
			СтрокаГруппаПозиции.Раздел = topicPartitionOffsetMetadata.partition;
		КонецЕсли;
		
		Если topicPartitionOffsetMetadata.offset <> Неопределено Тогда
			СтрокаГруппаПозиции.Позиция = topicPartitionOffsetMetadata.offset;
		КонецЕсли;
		
		Если topicPartitionOffsetMetadata.leaderEpoch <> Неопределено Тогда
			СтрокаГруппаПозиции.ПоколениеЛидера = Формат(topicPartitionOffsetMetadata.leaderEpoch, "ЧН=0");
		КонецЕсли;
		
		Если topicPartitionOffsetMetadata.metadata <> Неопределено Тогда
			СтрокаГруппаПозиции.Метаданные = topicPartitionOffsetMetadata.metadata;
		КонецЕсли;
		
		СтрокаГруппаПозиции.Отставание = "n/a";
		
		Если topicPartitionOffsetMetadata.topic <> Неопределено
		И topicPartitionOffsetMetadata.partition <> Неопределено
		И topicPartitionOffsetMetadata.offset <> Неопределено Тогда
			TopicPartiton = Новый Структура;
			TopicPartiton.Вставить("topic", topicPartitionOffsetMetadata.topic);
			TopicPartiton.Вставить("partition", topicPartitionOffsetMetadata.partition);
			Partitions.Добавить(TopicPartiton);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Partitions.Количество() > 0 Тогда
		
		latestOffsets = AdminListLatestOffsets(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, Partitions);
		
		Если latestOffsets = Неопределено Тогда
			Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
			Возврат;
		КонецЕсли;
		
		СтруктураПоиск = Новый Структура("Тема, Раздел");
		
		Для Каждого latestOffset Из latestOffsets Цикл
			
			СтруктураПоиск.Тема = latestOffset.topic;
			СтруктураПоиск.Раздел = latestOffset.partition;
			
			НайденныеСтроки = ТаблицаГруппаПозиции.НайтиСтроки(СтруктураПоиск);
			
			Для Каждого СтрокаГруппаПозиции Из НайденныеСтроки Цикл
				
				Отставание_ = latestOffset.offset - СтрокаГруппаПозиции.Позиция;
				СтрокаГруппаПозиции.Отставание = Формат(Отставание_, "ЧН=0");
				ТаблицаГруппаПозицииОтставание_ = ТаблицаГруппаПозицииОтставание_ + Отставание_;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ТаблицаГруппаПозицииОтставание_) Тогда
			ТаблицаГруппаПозицииОтставание = Формат(ТаблицаГруппаПозицииОтставание_, "ЧН=0");
		КонецЕсли;
		
	КонецЕсли;
		
	ТаблицаГруппаПозиции.Сортировать("Тема, Раздел");
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаClassicИзменитьПозицию(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаГруппаClassicПозиции.ТекущиеДанные;
	
	ГруппаConsumerИзменитьПозицию(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаConsumerПозицияИзменить(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаГруппаConsumerПозиции.ТекущиеДанные;
	
	ГруппаConsumerИзменитьПозицию(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаConsumerИзменитьПозицию(ТекущаяСтрока)
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаГруппа = Элементы.ТаблицаГруппы.ТекущиеДанные;
	
	Если СтрокаГруппа = Неопределено Или (СтрСравнить(СтрокаГруппа.Тип, "CLASSIC") <> 0 И СтрСравнить(СтрокаГруппа.Тип, "CONSUMER") <> 0) Тогда
		ВызватьИсключение "Неожиданное состояние.";
	КонецЕсли;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ГруппаId"	, СтрокаГруппа.Id);
	ПараметрыФормы.Вставить("Тема"		, ТекущаяСтрока.Тема);
	ПараметрыФормы.Вставить("Раздел"	, ТекущаяСтрока.Раздел);
	ПараметрыФормы.Вставить("Позиция"	, ТекущаяСтрока.Позиция);
	ПараметрыФормы.Вставить("Метаданные", ТекущаяСтрока.Метаданные);
	
	ОткрытьФорму(
			"Обработка.КафкаАдминистрирование.Форма.РедактированиеПозицииГруппы",
			ПараметрыФормы,
			ЭтаФорма,
			,
			,
			,
			Новый ОписаниеОповещения("ГруппаConsumerИзменитьПозициюПриЗакрытииФормы", ЭтаФорма),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаConsumerИзменитьПозициюПриЗакрытииФормы(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	GroupId = РезультатЗакрытия.ГруппаId;
	
	TopicPartitionOffsetMetadata = Новый Структура;
	TopicPartitionOffsetMetadata.Вставить("topic", РезультатЗакрытия.Тема);
	TopicPartitionOffsetMetadata.Вставить("partition", РезультатЗакрытия.Раздел);
	TopicPartitionOffsetMetadata.Вставить("offset", РезультатЗакрытия.Позиция);
	Если ЗначениеЗаполнено(РезультатЗакрытия.Метаданные) Тогда
		TopicPartitionOffsetMetadata.Вставить("metadata", РезультатЗакрытия.Метаданные);
	КонецЕсли;
	
	Offsets = Новый Массив;
	Offsets.Добавить(TopicPartitionOffsetMetadata);
	
	Успех = AdminAlterConsumerGroupOffsetsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, GroupId, Offsets);
	
	Если Успех = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ГруппаConsumerПозицииЗаполнить();
		
КонецПроцедуры

&НаКлиенте
Процедура ГруппаClassicПозицияУдалить(Команда)
	
	ВыделенныеСтроки = Элементы.ТаблицаГруппаClassicПозиции.ВыделенныеСтроки;
	
	ГруппаConsumerУдалитьПозиции(ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаConsumerПозицияУдалить(Команда)
	
	ВыделенныеСтроки = Элементы.ТаблицаГруппаConsumerПозиции.ВыделенныеСтроки;
	
	ГруппаConsumerУдалитьПозиции(ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаConsumerУдалитьПозиции(ВыделенныеСтроки)
		
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаГруппа = Элементы.ТаблицаГруппы.ТекущиеДанные;
	
	Если СтрокаГруппа = Неопределено Или (СтрСравнить(СтрокаГруппа.Тип, "CLASSIC") <> 0 И СтрСравнить(СтрокаГруппа.Тип, "CONSUMER") <> 0) Тогда
		ВызватьИсключение "Неожиданное состояние.";
	КонецЕсли;
		
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ГруппаId"	, СтрокаГруппа.Id);
	ДопПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	ПоказатьВопрос(
			Новый ОписаниеОповещения("ГруппаConsumerУдалитьПозициюПриОтветеНаВопрос", ЭтаФорма, ДопПараметры),
			"Вы действительно хотите удалить позиции чтения группы """ + СтрокаГруппа.Id + """?",
			РежимДиалогаВопрос.ДаНет,
			60,
			КодВозвратаДиалога.Нет,
			"Удаление позиций чтения группы",
			КодВозвратаДиалога.Нет
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаConsumerУдалитьПозициюПриОтветеНаВопрос(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	GroupId = ДопПараметры.ГруппаId;
	
	Partitions = Новый Массив;
	Для Каждого ИдентификаторСтроки Из ДопПараметры.ВыделенныеСтроки Цикл
		Строка = ТаблицаГруппаПозиции.НайтиПоИдентификатору(ИдентификаторСтроки);
		Partitions.Добавить(Новый Структура("topic, partition", Строка.Тема, Строка.Раздел));
	КонецЦикла;
	
	Успех = AdminDeleteConsumerGroupOffsetsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, GroupId, Partitions);
	
	Если Успех = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;

	ГруппаConsumerПозицииЗаполнить();
	
КонецПроцедуры

#КонецОбласти

#Область ScramПользователи

&НаКлиенте
Процедура ScramПользователиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаScramПользователи.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ScramПользователиОбновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ScramПользователиКомандаОбновить(Команда)
	
	ScramПользователиОбновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ScramПользователиСбросить()
	
	ТаблицаScramПользователи.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ScramПользователиОбновить()
	
	ScramПользователиСбросить();
	
	Если АдаптерПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	userScramCredentials = AdminDescribeUserScramCredentialsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin);
	Если userScramCredentials = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
		
	Для Каждого scramCredentialDescription Из userScramCredentials Цикл
		Для Каждого credentialInfo Из scramCredentialDescription.credentialInfos Цикл
			Строка = ТаблицаScramПользователи.Добавить();
			Строка.Пользователь = scramCredentialDescription.name;
			Строка.Механизм = credentialInfo.scramMechanism;
			Строка.КоличествоИтераций = credentialInfo.iterations;
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаScramПользователи.Сортировать("Пользователь, Механизм, КоличествоИтераций");
	
КонецПроцедуры

&НаКлиенте
Процедура ScramПользователиКомандаДобавить(Команда)
	
	ОткрытьФорму(
			"Обработка.КафкаАдминистрирование.Форма.ДобавлениеScramПользователя",
			,
			ЭтаФорма,
			,
			,
			,
			Новый ОписаниеОповещения("ScramПользователиДобавитьПриЗакрытииФормы", ЭтаФорма),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ScramПользователиДобавитьПриЗакрытииФормы(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	User = РезультатЗакрытия.Пользователь;
	Mechanism = РезультатЗакрытия.Механизм;
	Password = РезультатЗакрытия.Пароль;
	
	Успех = AdminUpsertUserScramCredentialsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, User, Mechanism, Password);
	
	Если Успех = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;

	ScramПользователиОбновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ScramПользователиКомандаИзменить(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаScramПользователи.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму(
			"Обработка.КафкаАдминистрирование.Форма.ИзменениеScramПользователя",
			Новый Структура("Пользователь, Механизм", ТекущиеДанные.Пользователь, ТекущиеДанные.Механизм),
			ЭтаФорма,
			,
			,
			,
			Новый ОписаниеОповещения("ScramПользователиИзменитьПриЗакрытииФормы", ЭтаФорма),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ScramПользователиИзменитьПриЗакрытииФормы(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	User = РезультатЗакрытия.Пользователь;
	Mechanism = РезультатЗакрытия.Механизм;
	Password = РезультатЗакрытия.Пароль;
	
	Успех = AdminUpsertUserScramCredentialsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, User, Mechanism, Password);
	Если Успех = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;

	ScramПользователиОбновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ScramПользователиКомандаУдалить(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаScramПользователи.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(
			Новый ОписаниеОповещения("ScramПользователиУдалитьПриОтветеНаВопрос", ЭтаФорма, Новый Структура("ТекущиеДанные", ТекущиеДанные)),
			"Вы действительно хотите удалить пользователя """ + ТекущиеДанные.Пользователь + " (" + ТекущиеДанные.Механизм + ")""?",
			РежимДиалогаВопрос.ДаНет,
			60,
			КодВозвратаДиалога.Нет,
			"Удаление пользователя",
			КодВозвратаДиалога.Нет
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ScramПользователиУдалитьПриОтветеНаВопрос(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ДопПараметры.ТекущиеДанные;
	
	Успех = AdminDeleteUserScramCredentialsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, ТекущиеДанные.Пользователь, ТекущиеДанные.Механизм);
	Если Успех = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;

	ScramПользователиОбновить();
	
КонецПроцедуры

#КонецОбласти

#Область КонтрольДоступа

&НаКлиенте
Процедура КонтрольДоступаСбросить()
	
	КонтрольДоступаФильтрResourceType = "ANY";
	КонтрольДоступаФильтрResourceName = "";
	КонтрольДоступаФильтрResourcePatternType = "ANY";
		
	ТаблицаКонтрольДоступа.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольДоступаКомандаПрочитать(Команда)
	
	КонтрольДоступаПрочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольДоступаПрочитать()
	
	ТаблицаКонтрольДоступа.Очистить();
	
	Если АдаптерПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КонтрольДоступаФильтрResourceType) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "КонтрольДоступаФильтрResourceType";
		Сообщение.Текст = "Не заполнен фильтр ""Resource Type"".";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КонтрольДоступаФильтрResourcePatternType) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "КонтрольДоступаФильтрResourcePatternType";
		Сообщение.Текст = "Не заполнен фильтр ""Pattern Type"".";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
		
	ResourcePatternFilter = КонтрольДоступаNewResourcePatternFilter(
			КонтрольДоступаФильтрResourceType,
			КонтрольДоступаФильтрResourceName,
			КонтрольДоступаФильтрResourcePatternType
	);
	
	AclBindingFilter = КонтрольДоступаNewAclBindingFilter(ResourcePatternFilter);
		
	aclBindings = AdminDescribeAclsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, AclBindingFilter);
	Если aclBindings = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Для Каждого aclBinding Из aclBindings Цикл
		
		Строка = ТаблицаКонтрольДоступа.Добавить();
				
		Строка.ResourceType			= aclBinding.pattern.resourceType;
		Строка.ResourceName			= aclBinding.pattern.name;
		Строка.ResourcePatternType	= aclBinding.pattern.patternType;

		Строка.EntryPrincipal	= aclBinding.entry.principal;
		Строка.EntryHost		= aclBinding.entry.host;
		Строка.EntryOperation	= aclBinding.entry.operation;
		Строка.EntryPermission	= aclBinding.entry.permissionType;
		
		КонтрольДоступаОбновитьИсходныеЗначенияСтроки(Строка);
		
	КонецЦикла;
		
	Элементы.ТаблицаКонтрольДоступа.ТолькоПросмотр = Ложь;
	Элементы.КонтрольДоступаЗаписать.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольДоступаКомандаЗаписать(Команда)
	
	КонтрольДоступаЗаписать();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольДоступаЗаписать()
	
	// Проверка
	
	Отказ = Ложь;
	
	ИндексСтроки = 0;
	
	Пока ИндексСтроки < ТаблицаКонтрольДоступа.Количество() Цикл
		
		Строка = ТаблицаКонтрольДоступа[ИндексСтроки];
		
		ИндексСтроки = ИндексСтроки + 1;
		
		Если Не (Строка.Добавить Или Строка.Удалить) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Строка.ResourceType) Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Строка.ResourcePatternType) Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Если СтрНайти(Строка.EntryPrincipal, ":") = 0 Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Строка.EntryOperation) Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Строка.EntryPermission) Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		ПоказатьПредупреждение(
				,
				"Не все поля измененных строк таблицы заполнены корректно.",
				,
				"Контроль доступа"
		);
		Возврат;
	КонецЕсли;
	
	// Запись
	
	ИндексСтроки = 0;
	
	Пока ИндексСтроки < ТаблицаКонтрольДоступа.Количество() Цикл
		
		Строка = ТаблицаКонтрольДоступа[ИндексСтроки];
		
		Если Строка.Удалить Тогда
			
			ResourcePatternFilter = КонтрольДоступаNewResourcePatternFilter(
					Строка.ResourceTypeИсходный,
					Строка.ResourceNameИсходный,
					Строка.ResourcePatternTypeИсходный
			);
			
			AccessControlEntryFilter = КонтрольДоступаNewAccessControlEntryFilter(
					Строка.EntryPrincipalИсходный,
					Строка.EntryHostИсходный,
					Строка.EntryOperationИсходный,
					Строка.EntryPermissionИсходный
			);
			
			AclBindingFilter = КонтрольДоступаNewAclBindingFilter(
					ResourcePatternFilter,
					AccessControlEntryFilter
			);
						
			AclBindingFilters = Новый Массив;
			AclBindingFilters.Добавить(AclBindingFilter);
			
			Result = AdminDeleteAclsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, AclBindingFilters);
			Если Result = Неопределено Тогда
				Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
				Возврат;
			КонецЕсли;
			
			Строка.Удалить = Ложь;
			
			Если Не Строка.Добавить Тогда
				ТаблицаКонтрольДоступа.Удалить(Строка);
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Строка.Добавить Тогда
			
			ResourcePattern = КонтрольДоступаNewResourcePattern(
					Строка.ResourceType,
					Строка.ResourceName,
					Строка.ResourcePatternType
			);
			
			AccessControlEntry = КонтрольДоступаNewAccessControlEntry(
					Строка.EntryPrincipal,
					Строка.EntryHost,
					Строка.EntryOperation,
					Строка.EntryPermission
			);
			
			AclBinding = КонтрольДоступаNewAclBinding(
					ResourcePattern,
					AccessControlEntry
			);
						
			AclBindings = Новый Массив;
			AclBindings.Добавить(AclBinding);
			
			Result = AdminCreateAclsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, AclBindings);
			Если Result = Неопределено Тогда
				Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
				Возврат;
			КонецЕсли;
			
			Строка.Добавить = Ложь;
			
			КонтрольДоступаОбновитьИсходныеЗначенияСтроки(Строка);
			
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольДоступаТаблицаПриНачалеРедактированияСтроки(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные; 
	
	Если НоваяСтрока Тогда
		ТекущиеДанные.Добавить = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольДоступаТаблицаПередОкончаниемРедактированияСтроки(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Не ТекущиеДанные.Добавить И Не ТекущиеДанные.Удалить Тогда
		
		// эта строка не модифицировалась ранее
		ТекущиеДанные.Добавить = Истина;
		ТекущиеДанные.Удалить = Истина;
		
	ИначеЕсли ТекущиеДанные.Добавить И ТекущиеДанные.Удалить Тогда
		
		// это модифицированная строка, все нужные флаги уже есть
		
	ИначеЕсли ТекущиеДанные.Добавить И Не ТекущиеДанные.Удалить Тогда
		
		// это новая строка, менять флаги не нужно
		
	Иначе
		ВызватьИсключение "Неожиданное состояние.";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольДоступаТаблицаПередУдалениемСтроки(Элемент, Отказ)
		
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Не ТекущиеДанные.Добавить И Не ТекущиеДанные.Удалить Тогда
		
		// эта строка не модифицировалась ранее
		Отказ = Истина;
		ТекущиеДанные.Удалить = Истина;
		
	ИначеЕсли ТекущиеДанные.Добавить И ТекущиеДанные.Удалить Тогда
		
		// это модифицированная строка
		Отказ = Истина;
		ТекущиеДанные.Добавить = Ложь;
		ТекущиеДанные.Удалить = Истина;
		КонтрольДоступаВосстановитьИсходныеЗначенияСтроки(ТекущиеДанные);
		
	ИначеЕсли Не ТекущиеДанные.Добавить И ТекущиеДанные.Удалить Тогда
		
		// это ранее помеченная на удаление строка
		Отказ = Истина;
		ТекущиеДанные.Удалить = Ложь;
		
	ИначеЕсли ТекущиеДанные.Добавить И Не ТекущиеДанные.Удалить Тогда
		
		// это новая строка, ее можно просто удалить
		
	Иначе
		ВызватьИсключение "Неожиданное состояние.";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольДоступаОбновитьИсходныеЗначенияСтроки(Строка)
	
	Строка.ResourceTypeИсходный			= Строка.ResourceType;
	Строка.ResourceNameИсходный			= Строка.ResourceName;
	Строка.ResourcePatternTypeИсходный	= Строка.ResourcePatternType;
	
	Строка.EntryPrincipalИсходный	= Строка.EntryPrincipal;
	Строка.EntryHostИсходный		= Строка.EntryHost;
	Строка.EntryOperationИсходный	= Строка.EntryOperation;
	Строка.EntryPermissionИсходный	= Строка.EntryPermission;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольДоступаВосстановитьИсходныеЗначенияСтроки(Строка)
	
	Строка.ResourceType			= Строка.ResourceTypeИсходный;
	Строка.ResourceName			= Строка.ResourceNameИсходный;
	Строка.ResourcePatternType	= Строка.ResourcePatternTypeИсходный;
	
	Строка.EntryPrincipal	= Строка.EntryPrincipalИсходный;
	Строка.EntryHost		= Строка.EntryHostИсходный;
	Строка.EntryOperation	= Строка.EntryOperationИсходный;
	Строка.EntryPermission	= Строка.EntryPermissionИсходный;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КонтрольДоступаNewResourcePatternFilter(ResourceType, Name, ResourcePatternType)
	
	ResourcePatternFilter = Новый Структура;
	ResourcePatternFilter.Вставить("resourceType", ResourceType);
	ResourcePatternFilter.Вставить("name", ?(ЗначениеЗаполнено(Name), Name, Неопределено));
	ResourcePatternFilter.Вставить("patternType", ResourcePatternType);
	
	Возврат ResourcePatternFilter;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КонтрольДоступаNewAccessControlEntryFilter(Principal, Host, Operation, PermissionType)
	
	AccessControlEntryFilter = Новый Структура;
	AccessControlEntryFilter.Вставить("principal", ?(ЗначениеЗаполнено(Principal), Principal, Неопределено));
	AccessControlEntryFilter.Вставить("host", ?(ЗначениеЗаполнено(Host), Host, Неопределено));
	AccessControlEntryFilter.Вставить("operation", Operation);
	AccessControlEntryFilter.Вставить("permissionType", PermissionType);
	
	Возврат AccessControlEntryFilter;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КонтрольДоступаNewAclBindingFilter(ResourcePatternFilter = Неопределено, AccessControlEntryFilter = Неопределено)
	
	AclBindingFilter = Новый Структура;
	AclBindingFilter.Вставить("patternFilter", ResourcePatternFilter);
	AclBindingFilter.Вставить("entryFilter", AccessControlEntryFilter);
	
	Возврат AclBindingFilter;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КонтрольДоступаNewResourcePattern(ResourceType, Name, PatternType)
	
	ResourcePattern = Новый Структура;
	ResourcePattern.Вставить("resourceType", ResourceType);
	ResourcePattern.Вставить("name", ?(ЗначениеЗаполнено(Name), Name, "*"));
	ResourcePattern.Вставить("patternType", PatternType);
	
	Возврат ResourcePattern;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КонтрольДоступаNewAccessControlEntry(Principal, Host, Operation, PermissionType)
	
	AccessControlEntry = Новый Структура;
	AccessControlEntry.Вставить("principal", Principal);
	AccessControlEntry.Вставить("host", ?(ЗначениеЗаполнено(Host), Host, "*"));
	AccessControlEntry.Вставить("operation", Operation);
	AccessControlEntry.Вставить("permissionType", PermissionType);
	
	Возврат AccessControlEntry;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КонтрольДоступаNewAclBinding(ResourcePattern, AccessControlEntry)
	
	AclBinding = Новый Структура;
	AclBinding.Вставить("pattern", ResourcePattern);
	AclBinding.Вставить("entry", AccessControlEntry);
	
	Возврат AclBinding;
	
КонецФункции

#КонецОбласти

#Область Кафка

&НаСервереБезКонтекста
Функция Адаптер(Параметры)
	
	Адаптер = Обработки.КафкаАдаптер.Создать();
	
	Адаптер.Инициализировать(
			Параметры.ШлюзАдрес,
			Параметры.ШлюзПользователь,
			Параметры.ШлюзПароль,
			Параметры.ШлюзТаймаут,
	);
	
	Возврат Адаптер;
	
КонецФункции

&НаСервереБезКонтекста
Функция GetVersionНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.GetVersion();
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция AdminCreate()
	
	Admin = AdminCreateНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Кластер);
	
	Если Admin = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
	КонецЕсли;
	
	Возврат (Admin <> Неопределено);
	
КонецФункции
&НаСервереБезКонтекста
Функция AdminCreateНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Кластер)
	
	Адаптер = Адаптер(АдаптерПараметры);
		
	Admin = КафкаСервер.СоздатьAdmin(
			Кластер,
			Адаптер,
			"Обработка КафкаАдминистрирование",
			,
			120000
	);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Admin;
	
КонецФункции

&НаКлиенте
Функция AdminRelease()
		
	Результат = AdminReleaseНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin);
	
	Admin = Неопределено;
	
	Если Результат = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
	КонецЕсли;
	
	Возврат (Результат <> Неопределено);
	
КонецФункции
&НаСервереБезКонтекста
Функция AdminReleaseНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminRelease(Admin);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция AdminTouch()
		
	Результат = AdminTouchНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin);
	
	Если Результат = Неопределено Тогда
		Сообщить(Строка(АдаптерКодОтвета) + " " + АдаптерОписаниеОшибки);
	КонецЕсли;
	
	Возврат (Результат <> Неопределено);
	
КонецФункции
&НаСервереБезКонтекста
Функция AdminTouchНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminTouch(Admin);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат; 
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDescribeClusterНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDescribeCluster(Admin);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат; 
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDescribeLogDirsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, ClusterIds)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDescribeLogDirs(Admin, ClusterIds);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат; 
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminListTopicsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	МассивРезультат = Адаптер.AdminListTopics(Admin);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Если МассивРезультат <> Неопределено Тогда
		СписокРезультат = Новый СписокЗначений;
		Для Каждого topicInfo Из МассивРезультат Цикл
			ЭлементРезультат = СписокРезультат.Добавить(topicInfo, topicInfo.name);
		КонецЦикла;
		СписокРезультат.СортироватьПоПредставлению();
		МассивРезультат = СписокРезультат.ВыгрузитьЗначения();
	КонецЕсли;
	
	Возврат МассивРезультат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDescribeTopicНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, topic)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDescribeTopic(Admin, topic, Истина);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDescribeBrokerConfigsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, brokerId)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDescribeBrokerConfigs(Admin, brokerId);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDescribeTopicConfigsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, topicName)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDescribeTopicConfigs(Admin, topicName);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminCreateTopicНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, topicName, numPartitions, replicationFactor)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminCreateTopic(Admin, topicName, numPartitions, replicationFactor);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат; 
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDeleteTopicНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, topicName)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDeleteTopic(Admin, topicName);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат; 
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminCreatePartitionsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, topicName, increaseTo)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminCreatePartitions(Admin, topicName, increaseTo);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ConsumerGetMessagesНаСервере(Кластер, АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Тема, СтарыеИлиНовые, КоличествоНаРаздел)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	ДопКонфигурация = Новый Соответствие;
	ДопКонфигурация.Вставить("auto.offset.reset", "earliest");
	ДопКонфигурация.Вставить("enable.auto.commit", "false");
		
	Consumer = КафкаСервер.СоздатьConsumer(
			Кластер,
			Адаптер,
			"Обработка КафкаАдминистрирование",
			ДопКонфигурация,
			120000
	);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Если Consumer = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		
		Результат = ConsumerGetMessagesНаСервере_(АдаптерКодОтвета, АдаптерОписаниеОшибки, Тема, СтарыеИлиНовые, КоличествоНаРаздел, Адаптер, Consumer);
		
		Адаптер.ConsumerRelease(Consumer);
		//АдаптерКодОтвета = Адаптер.КодОтвета;
		//АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
		
	Исключение
		Адаптер.ConsumerRelease(Consumer);
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции
&НаСервереБезКонтекста
Функция ConsumerGetMessagesНаСервере_(АдаптерКодОтвета, АдаптерОписаниеОшибки, Тема, СтарыеИлиНовые, КоличествоНаРаздел, Адаптер, Consumer)
	
	Результат = Новый Массив;
	
	PartitionInfos = Адаптер.ConsumerGetPartitions(Consumer, Тема);
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	Если PartitionInfos = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Partitions = Новый Массив;
	Для Каждого PartitionInfo Из PartitionInfos Цикл
		Partitions.Добавить(Новый ФиксированнаяСтруктура("topic, partition", Тема, PartitionInfo.partition));
	КонецЦикла;
	
	Успех = Адаптер.ConsumerAssign(Consumer, Partitions);
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	Если Успех <> Истина Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СостояниеЧтения = Новый Соответствие;
	
	Для Каждого TopicPartition Из Partitions Цикл
		СостояниеЧтенияТемы = СостояниеЧтения.Получить(TopicPartition.topic);
		Если СостояниеЧтенияТемы = Неопределено Тогда
			СостояниеЧтенияТемы = Новый Соответствие;
			СостояниеЧтения.Вставить(TopicPartition.topic, СостояниеЧтенияТемы);
		КонецЕсли;
		СостояниеЧтенияРаздела = Новый Структура;
		СостояниеЧтенияТемы.Вставить(TopicPartition.partition, СостояниеЧтенияРаздела);
	КонецЦикла;
	
	BeginningOffsets = Адаптер.ConsumerGetBeginningOffsets(Consumer, Partitions);
	Если BeginningOffsets = Неопределено Тогда
		ВызватьИсключение Строка(Адаптер.КодОтвета) + " " + Адаптер.ОписаниеОшибки;
	КонецЕсли;
	Для Каждого TopicOffsets Из BeginningOffsets Цикл
		Для Каждого PartitionOffset Из TopicOffsets.offsets Цикл
			СостояниеЧтенияРаздела = СостояниеЧтения[TopicOffsets.topic][PartitionOffset.partition];
			СостояниеЧтенияРаздела.Вставить("НачальноеСмещение", partitionOffset.offset);
		КонецЦикла;
	КонецЦикла;
	
	EndOffsets = Адаптер.ConsumerGetEndOffsets(Consumer, Partitions);
	Если EndOffsets = Неопределено Тогда
		ВызватьИсключение Строка(Адаптер.КодОтвета) + " " + Адаптер.ОписаниеОшибки;
	КонецЕсли;
	Для Каждого TopicOffsets Из EndOffsets Цикл
		Для Каждого PartitionOffset Из TopicOffsets.offsets Цикл
			СостояниеЧтенияРаздела = СостояниеЧтения[TopicOffsets.topic][PartitionOffset.partition];
			СостояниеЧтенияРаздела.Вставить("КонечноеСмещение", partitionOffset.offset);
		КонецЦикла;
	КонецЦикла;
	
	ОсталосьРазделов = 0;
	
	Для Каждого КлючЗначениеТема Из СостояниеЧтения Цикл
		Для Каждого КлючЗначениеРаздел Из КлючЗначениеТема.Значение Цикл
			
			СостояниеЧтенияРаздела = КлючЗначениеРаздел.Значение;
			
			Если СтарыеИлиНовые = "Старые" Тогда
				СостояниеЧтенияРаздела.КонечноеСмещение = Мин(СостояниеЧтенияРаздела.КонечноеСмещение, СостояниеЧтенияРаздела.НачальноеСмещение + КоличествоНаРаздел);
			ИначеЕсли СтарыеИлиНовые = "Новые" Тогда
				СостояниеЧтенияРаздела.НачальноеСмещение = Макс(СостояниеЧтенияРаздела.НачальноеСмещение, СостояниеЧтенияРаздела.КонечноеСмещение - КоличествоНаРаздел);
			Иначе
				ВызватьИсключение "Неожиданное состояние.";
			КонецЕсли;
			
			СостояниеЧтенияРаздела.Вставить("ТекущееСмещение", СостояниеЧтенияРаздела.НачальноеСмещение);
			
			Если СостояниеЧтенияРаздела.ТекущееСмещение < СостояниеЧтенияРаздела.КонечноеСмещение Тогда
				ОсталосьРазделов = ОсталосьРазделов + 1;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
		
	Если ОсталосьРазделов = 0 Тогда
		Возврат Результат;
	КонецЕсли;
		
	Для Каждого КлючЗначениеТема Из СостояниеЧтения Цикл
		Для Каждого КлючЗначениеРаздел Из КлючЗначениеТема.Значение Цикл
			
			СостояниеЧтенияРаздела = КлючЗначениеРаздел.Значение;
			
			Успех = Адаптер.ConsumerSeek(Consumer, КлючЗначениеТема.Ключ, КлючЗначениеРаздел.Ключ, СостояниеЧтенияРаздела.ТекущееСмещение);
			АдаптерКодОтвета = Адаптер.КодОтвета;
			АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
			Если Успех <> Истина Тогда
				Возврат Неопределено;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Пока ОсталосьРазделов > 0 Цикл
		
		Records = Адаптер.ConsumerPoll(Consumer, 30000);
		АдаптерКодОтвета = Адаптер.КодОтвета;
		АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
		Если Records = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Для Каждого Record Из Records Цикл
			
			Результат.Добавить(Record);
			
			СостояниеЧтенияРаздела = СостояниеЧтения[Record.topic][Record.partition];
			
			ПредыдущееСмещение = СостояниеЧтенияРаздела.ТекущееСмещение;
			СостояниеЧтенияРаздела.ТекущееСмещение = Record.offset + 1;
			
			Если ПредыдущееСмещение < СостояниеЧтенияРаздела.КонечноеСмещение
			И СостояниеЧтенияРаздела.ТекущееСмещение >= СостояниеЧтенияРаздела.КонечноеСмещение Тогда
				ОсталосьРазделов = ОсталосьРазделов - 1;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminAlterTopicConfigНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, TopicName, ConfigName, NewValue)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminAlterTopicConfig(Admin, TopicName, ConfigName, NewValue);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат; 
		
КонецФункции

&НаСервереБезКонтекста
Функция AdminDeleteTopicConfigНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, TopicName, ConfigName)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDeleteTopicConfig(Admin, TopicName, ConfigName);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат; 
		
КонецФункции

&НаСервереБезКонтекста
Функция AdminDescribeUserScramCredentialsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDescribeUserScramCredentials(Admin);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminUpsertUserScramCredentialsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, User, Mechanism, Password)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminUpsertUserScramCredentials(Admin, User, Mechanism, Password);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDeleteUserScramCredentialsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, User, Mechanism)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDeleteUserScramCredentials(Admin, User, Mechanism);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDescribeAclsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, AclBindingsFilter)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDescribeAcls(Admin, AclBindingsFilter);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminCreateAclsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, AclBindings)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminCreateAcls(Admin, AclBindings);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDeleteAclsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, AclBindingFilters)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDeleteAcls(Admin, AclBindingFilters);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminListGroupsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	МассивРезультат = Адаптер.AdminListGroups(Admin);
	
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
	
	Если МассивРезультат <> Неопределено Тогда
		СписокРезультат = Новый СписокЗначений;
		Для Каждого groupInfo Из МассивРезультат Цикл
			ЭлементРезультат = СписокРезультат.Добавить(groupInfo, groupInfo.groupId);
		КонецЦикла;
		СписокРезультат.СортироватьПоПредставлению();
		МассивРезультат = СписокРезультат.ВыгрузитьЗначения();
	КонецЕсли;
	
	Возврат МассивРезультат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDescribeClassicGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, GroupId, IncludeAuthorizedOperations)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDescribeClassicGroup(Admin, GroupId, IncludeAuthorizedOperations);
		
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDescribeConsumerGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, GroupId, IncludeAuthorizedOperations)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDescribeConsumerGroup(Admin, GroupId, IncludeAuthorizedOperations);
		
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDescribeShareGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, GroupId, IncludeAuthorizedOperations)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDescribeShareGroup(Admin, GroupId, IncludeAuthorizedOperations);
		
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDescribeStreamsGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, GroupId, IncludeAuthorizedOperations)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDescribeStreamsGroup(Admin, GroupId, IncludeAuthorizedOperations);
		
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDeleteConsumerGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, GroupId)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDeleteConsumerGroup(Admin, GroupId);
		
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDeleteShareGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, GroupId)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDeleteShareGroup(Admin, GroupId);
		
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDeleteStreamsGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, GroupId)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDeleteStreamsGroup(Admin, GroupId);
		
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminListConsumerGroupOffsetsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, GroupId)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminListConsumerGroupOffsets(Admin, GroupId);
		
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminAlterConsumerGroupOffsetsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, GroupId, Offsets)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminAlterConsumerGroupOffsets(Admin, GroupId, Offsets);
		
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminDeleteConsumerGroupOffsetsНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, GroupId, Partitions)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminDeleteConsumerGroupOffsets(Admin, GroupId, Partitions);
		
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminRemoveMembersFromConsumerGroupНаСервере(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, GroupId, Members, Reason)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminRemoveMembersFromConsumerGroup(Admin, GroupId, Members, Reason);
		
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminListEarliestOffsets(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, Partitions)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminListEarliestOffsets(Admin, Partitions);
		
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция AdminListLatestOffsets(АдаптерПараметры, АдаптерКодОтвета, АдаптерОписаниеОшибки, Admin, Partitions)
	
	Адаптер = Адаптер(АдаптерПараметры);
	
	Результат = Адаптер.AdminListLatestOffsets(Admin, Partitions);
		
	АдаптерКодОтвета = Адаптер.КодОтвета;
	АдаптерОписаниеОшибки = Адаптер.ОписаниеОшибки;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеМоментаВремени(timestamp)
	
	Если timestamp < 0 Тогда
		Возврат "";
	КонецЕсли;
	
	КолвоСекунд = Цел(timestamp/1000);
	ОстатокМиллисекунд = timestamp - КолвоСекунд*1000;
	
	УниверсальноеВремя = '19700101' + КолвоСекунд;
	МестноеВремя = МестноеВремя(УниверсальноеВремя);
	
	Возврат Формат(МестноеВремя, "ДФ='yyyy-MM-dd HH:mm:ss'") + "." + Формат(ОстатокМиллисекунд, "ЧЦ=3; ЧН=; ЧВН=");
	
КонецФункции
