
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГруппаId = Параметры.ГруппаId;
	УдалитьВсех = Параметры.УдалитьВсех;
	
	Если УдалитьВсех Тогда
		
		Заголовок = "Удаление всех участников группы";
		
		Элементы.Участники.Видимость = Ложь;
		
	Иначе
		
		Заголовок = "Удаление статических участников группы";
		
		Участники.ЗагрузитьЗначения(Параметры.Участники);
		Участники.ЗаполнитьПометки(Истина);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	Если Не УдалитьВсех Тогда
		
		МассивУчастники = Новый Массив;
		Для Каждого Элемент Из Участники Цикл
			Если Не Элемент.Пометка тогда
				Продолжить;
			КонецЕсли;
			МассивУчастники.Добавить(Элемент.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ГруппаId", ГруппаId);
	Результат.Вставить("Участники", МассивУчастники);
	Результат.Вставить("Причина", Причина);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры
