// Copyright 2025 Сергей Савельев (serge@savel.pro)
//
// Лицензировано согласно Лицензии Apache, Версия 2.0 ("Лицензия");
// вы можете использовать этот файл только в соответствии с Лицензией.
// Вы можете найти копию Лицензии по адресу
//
// http://www.apache.org/licenses/LICENSE-2.0.
//
// За исключением случаев, когда это регламентировано существующим
// законодательством, или если это не оговорено в письменном соглашении,
// программное обеспечение, распространяемое на условиях данной Лицензии,
// предоставляется "КАК ЕСТЬ", и любые явные или неявные ГАРАНТИИ ОТВЕРГАЮТСЯ.
// Информацию об основных правах и ограничениях, применяемых к определенному
// языку согласно Лицензии, вы можете найти в данной Лицензии.

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГруппаId = Параметры.ГруппаId;
	УдалитьВсех = Параметры.УдалитьВсех;
	
	Если УдалитьВсех Тогда
		
		Заголовок = "Удаление всех участников группы";
		
		Элементы.Участники.Видимость = Ложь;
		
	Иначе
		
		Заголовок = "Удаление статических участников группы";
		
		Участники.ЗагрузитьЗначения(Параметры.Участники);
		Участники.ЗаполнитьПометки(Истина);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	Если Не УдалитьВсех Тогда
		
		МассивУчастники = Новый Массив;
		Для Каждого Элемент Из Участники Цикл
			Если Не Элемент.Пометка тогда
				Продолжить;
			КонецЕсли;
			МассивУчастники.Добавить(Элемент.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ГруппаId", ГруппаId);
	Результат.Вставить("Участники", МассивУчастники);
	Результат.Вставить("Причина", Причина);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры
