// Copyright 2023 Савельев Сергей Владимирович
//
// Лицензировано согласно Лицензии Apache, Версия 2.0 ("Лицензия");
// вы можете использовать этот файл только в соответствии с Лицензией.
// Вы можете найти копию Лицензии по адресу
//
// http://www.apache.org/licenses/LICENSE-2.0.
//
// За исключением случаев, когда это регламентировано существующим
// законодательством, или если это не оговорено в письменном соглашении,
// программное обеспечение, распространяемое на условиях данной Лицензии,
// предоставляется "КАК ЕСТЬ", и любые явные или неявные ГАРАНТИИ ОТВЕРГАЮТСЯ.
// Информацию об основных правах и ограничениях, применяемых к определенному
// языку согласно Лицензии, вы можете найти в данной Лицензии.

Процедура ПередЗаписью(Отказ)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.КафкаКластеры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	Если ДополнительныеСвойства.Свойство("НазначитьПоУмолчанию") И ДополнительныеСвойства.НазначитьПоУмолчанию = Истина Тогда
		
		ИмяПредопределенныхДанных = "ПоУмолчанию";
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Кластеры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КафкаКластеры КАК Кластеры
		|ГДЕ
		|	Кластеры.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных
		|	И Кластеры.Ссылка <> &Ссылка");
		Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", ИмяПредопределенныхДанных);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ПредТЗ = РезультатЗапроса.Выгрузить();
			Для Каждого ПредС Из ПредТЗ Цикл
				ПредОбъект = ПредС.Ссылка.ПолучитьОбъект();
				ПредОбъект.ИмяПредопределенныхДанных = "";
				ПредОбъект.Записать();
			КонецЦикла;
		КонецЕсли;
				
	КонецЕсли;
	
	Для Каждого С Из КафкаКонфигурацияОтправителя Цикл
		С.Параметр = СокрЛП(НРег(С.Параметр));
	КонецЦикла;
	
	Для Каждого С Из КафкаКонфигурацияПолучателя Цикл
		С.Параметр = СокрЛП(НРег(С.Параметр));
	КонецЦикла;
	
КонецПроцедуры
