// Copyright 2025 Сергей Савельев (serge@savel.pro)
//
// Лицензировано согласно Лицензии Apache, Версия 2.0 ("Лицензия");
// вы можете использовать этот файл только в соответствии с Лицензией.
// Вы можете найти копию Лицензии по адресу
//
// http://www.apache.org/licenses/LICENSE-2.0.
//
// За исключением случаев, когда это регламентировано существующим
// законодательством, или если это не оговорено в письменном соглашении,
// программное обеспечение, распространяемое на условиях данной Лицензии,
// предоставляется "КАК ЕСТЬ", и любые явные или неявные ГАРАНТИИ ОТВЕРГАЮТСЯ.
// Информацию об основных правах и ограничениях, применяемых к определенному
// языку согласно Лицензии, вы можете найти в данной Лицензии.

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если СтрНачинаетсяС(КафкаПротоколБезопасности, "SASL_") И ПустаяСтрока(КафкаМеханизмSASL) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "КафкаМеханизмSASL";
		Сообщение.Текст = "Механизм SASL должен быть заполнен в соответствии с выбранным протоколом безопасности.";
		Сообщение.Сообщить();
	КонецЕсли;
	
	//Если КафкаПользовательУстановлен И СтрНайти(КафкаПользователь, """") <> 0 Тогда
	//	Отказ = Истина;
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.УстановитьДанные(ЭтотОбъект);
	//	Сообщение.Поле = "КафкаПользователь";
	//	Сообщение.Текст = "Имя пользователя не должно содержать кавычки.";
	//	Сообщение.Сообщить();
	//КонецЕсли;
	//
	//Если СтрНайти(КафкаПароль, """") <> 0 Тогда
	//	Отказ = Истина;
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.УстановитьДанные(ЭтотОбъект);
	//	Сообщение.Поле = "КафкаПользователь";
	//	Сообщение.Текст = "Пароль не должен содержать кавычки.";
	//	Сообщение.Сообщить();
	//КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого С Из КафкаКонфигурацияОтправителя Цикл
		С.Параметр = СокрЛП(НРег(С.Параметр));
	КонецЦикла;
	
	Для Каждого С Из КафкаКонфигурацияПолучателя Цикл
		С.Параметр = СокрЛП(НРег(С.Параметр));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти